{"inkVersion":21,"root":[["#","^Aiolos = The Face (how the ego wants to appear)","/#","#","^Almos = The Mind (rationalization, justification)","/#","#","^Boris = The Heart (deflection, comfort through denial)","/#","#","^Rabbit = The Shadow (what the ego fears becoming)","/#","#","^The Limitless Blue’s “law” is the right to move, change, contradict — i.e., the power to reconcile what cannot coexist.","/#","#","^When Lucy wields it, it doesn’t kill Andromeda; it collapses the contradiction Bruce forced between them.","/#","\n","\n","\n","\n","\n","\n","\n","\n","\n","\n","\n","\n","\n","\n","^The balcony surveys well above the street. The street is empty and quiet. Almos is quiet. He sits across from you now, a table between you both. He usually isn’t quiet on Saturdays. Perhaps you’ve gotten it all wrong. It may be Sunday now that you think about it. The days don’t seem to matter anymore, at least to you, anyway.","\n","ev","str","^Aiolos","/str",{"x()":"AddCharacter","exArgs":1},"pop","/ev","\n","ev","str","^Revolver","/str",{"x()":"AddWeapon","exArgs":1},"pop","/ev","\n","^You have a cigarette in hand. Smoke leaves your lips. Almos' face is briefly obstructed from your sight. You're worried he has just disappeared.","\n",["ev",{"^->":"0.52.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":"0.c-0","flg":2},{"s":["^\"Almos?\"",{"->":"$r","var":true},null]}],["ev",{"^->":"0.53.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":"0.c-1","flg":2},{"s":["^\"...\"",{"->":"$r","var":true},null]}],["ev",{"^->":"0.54.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":"0.c-2","flg":2},{"s":["^\"Demo1\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":"0.52.s"},[{"#n":"$r2"}],"\n","ev",{"VAR?":"BotherAlmos"},1,"+",{"VAR=":"BotherAlmos","re":true},"/ev",{"->":"TB1"},{"->":"0.g-0"},{"#f":5}],"c-1":["ev",{"^->":"0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":"0.53.s"},[{"#n":"$r2"}],"\n",{"->":"TB1"},{"->":"0.g-0"},{"#f":5}],"c-2":["ev",{"^->":"0.c-2.$r2"},"/ev",{"temp=":"$r"},{"->":"0.54.s"},[{"#n":"$r2"}],"\n","ev","str","^Almos","/str",{"x()":"AddCharacter","exArgs":1},"pop","/ev","\n",{"->":"Rabbit"},{"->":"0.g-0"},{"#f":5}],"g-0":["done",{"#f":5}]}],"done",{"TB1":[["ev",{"VAR?":"BotherAlmos"},0,">","/ev",[{"->":".^.b","c":true},{"b":["\n","^He doesn’t acknowledge you calling his name. You couldn’t help but feel he was gone in that moment. You remind yourself that the smoke just had to clear a little.","\n","^Everything is fine. You can see Almos now.","\n","^Almos is looking out from the balcony down to the street.","\n",{"->":"TB1.0.6"},null]}],"nop","\n","^Almos also has a cigarette in his hand. Two days ago, you poked holes through all of his cigarettes so he wouldn’t be able to smoke them. You’re not sure how either of you is smoking. The cigarettes should have been duds.","\n","^Your mind is a jumbled mess, trying to figure out all the details.","\n","^You ignore the thought for now in defeat.","\n","^The balcony is small. You and Almos are sitting upon an aluminum patio set. Just two chairs and a small circular table between you.","\n","^Three months ago, you both barely sat here. It has become something of a ritual for you both to sit here and watch the sunset.","\n","^The aluminum of the table seems to be falling apart. You don’t blame the furniture, really, for not holding up. Neither you nor Almos took any particular measures to care for it. It was a cheap set, anyway.","\n",["ev",{"^->":"TB1.0.20.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^_Kick the table leg in frustration._",{"->":"$r","var":true},null]}],["ev",{"^->":"TB1.0.21.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^_Examine the table more closely._",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"TB1.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.20.s"},[{"#n":"$r2"}],"\n","ev",{"VAR?":"UncannyPeculiarity"},1,"+",{"VAR=":"UncannyPeculiarity","re":true},"/ev",{"->":"TB2"},{"#f":5}],"c-1":["ev",{"^->":"TB1.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.21.s"},[{"#n":"$r2"}],"\n",{"->":"TB2"},{"#f":5}]}],{"#f":1}],"TB2":[["ev",{"VAR?":"UncannyPeculiarity"},0,">","/ev",[{"->":".^.b","c":true},{"b":["\n","^You kick the table leg and the whole thing rattles.","\n","^Almos jumps a little, and says nothing while giving you a sharp but brief stare.","\n","^You’re becoming angry, but you find it challenging to continue to be upset at metal. Perhaps your outburst has little to do with the table itself, and more to do with frustration of feeling ignored by Almos.","\n",{"->":"TB2.0.7"},null]}],[{"->":".^.b"},{"b":["\n","^You look closer at the table to see brownish specles forming near the legs. It's not really immediately noticeable, but the table itself feels like it's about to collapse at any second.","\n","^Only three legs of the four are ever touching the ground at once. You do wonder though if those brown spots you're seeing are actually rust.","\n",{"->":"TB2.0.7"},null]}],"nop","\n","ev",{"f()":"JMP1"},"out","/ev","\n",["ev",{"^->":"TB2.0.14.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^_Pull out your phone from your pocket and search for the answer._",{"->":"$r","var":true},null]}],["ev",{"^->":"TB2.0.15.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^_Try to grab Almos' attention again._",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"TB2.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.14.s"},[{"#n":"$r2"}],"\n",{"->":"TB3"},{"#f":5}],"c-1":["ev",{"^->":"TB2.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.15.s"},[{"#n":"$r2"}],"\n","ev",{"VAR?":"BotherAlmos"},1,"+",{"VAR=":"BotherAlmos","re":true},"/ev",{"->":"TB3"},{"#f":5}]}],{"#f":1}],"TB3":[["ev",{"VAR?":"PhonePickup"},true,"==","/ev",[{"->":".^.b","c":true},{"b":["\n","^Almos seems captivated in his thoughts. You shouldn’t bother him when you can just look up the answer. You just like hearing his voice, you guess. You pull out your phone.","\n","^No. Aluminum doesn’t rust, apparently. It corrodes. Interesting, you suppose. You leave the phone out on the table.","\n",{"->":"TB3.0.6"},null]}],"nop","\n","^You try getting Almos’ attention again by touching his hand, but he stays fixated on the street below. He gets enraptured like this sometimes. Perhaps he’s daydreaming. Maybe he isn’t even really here.","\n","^His body is before you, but it's as if his mind is on another planet, for all you know.","\n","^You sit in silence for a bit longer.","\n",["ev",{"^->":"TB3.0.14.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^_Daydream along Almos_",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"TB3.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.14.s"},[{"#n":"$r2"}],"\n",{"->":"Daydream"},{"#f":5}]}],{"#f":1}],"Daydream":[["^Your mind starts to wander admist the silence between you both.","\n","^Without constant stimulation, what are you if not just flesh and meat?","\n","^You close your eyes and envision this tableset belonging to a cafe in the middle of a garden.","\n","^Oh, you can see it now. You and Almos are at a lovely coffee shop, which also happens to be in a garden.","\n","^You feel upkept, bourgeois even, as a nice breeze sifts through your hair, and a coffee that's consumed your pocket money waits patiently in front of you.","\n","^You romanticize the scene more. You’re on a small bridge, just above a nice running stream of water, which also happens to be where a coffee shop has put some seating–in the middle of a garden, that is.","\n","^You think that would be nice. Almos doesn’t like coffee, though. You suppose he liked feeling tired. You think he’d like it just as much as cigarettes.","\n","^You wonder if the garden would have nice flowers. Although you hope there wouldn’t be any flowers close to where you and Almos would be sitting. You get scared of bees, among other things.","\n","^Speaking of gardens, you’ve never asked Almos what his favorite flowers are. You think he likes carnations. Maybe you should ask him.","\n",["ev",{"^->":"Daydream.0.18.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"Almos?\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"Daydream.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.18.s"},[{"#n":"$r2"}],"\n",{"->":"Daydream1"},{"#f":5}]}],{"#f":1}],"Daydream1":[["^“Hm,” he mutters.","\n","^The street is still holding his gaze. His side profile is the only thing greeting you. He looks frozen. His forearm is like a pillar managing the integrity of his skull. His cheek and chin rest nicely in his hand, serving nicely as a capital.","\n","^You don’t know if you’re bothered by the fact that he’s not looking at you. His eyes look sullen and droopy. You think he may be tired. He’s always tired, though. You’ve already forgotten what you were going to ask him.","\n","^An uncomfortable amount of time seems to have passed, marked by his pupils slowly orbiting over to you.","\n","^“What is your favorite flower?” you finally blurt as if your heart had jump-started your lungs.","\n","^He still doesn’t respond. His other hand is still occupied, placing a cigarette in his mouth. You feel like you’ve tried forever to get Almos to stop smoking, but he kind of ropes you in as well.","\n","^You don’t reckon you have much of a head over your shoulders.","\n","^You bought him gum a while back as a substitute, but you think he likes both gum and cigarettes now. He alternates. You’ve tried hiding his cigarettes, but Almos is really smart. He can always find where you’ve hidden them. Sometimes you’ve thought yourself as doing an incredible job.","\n","^Smoke shrouds Almos once again. For those few seconds, you feel like he’s vanished. He returns to you with the cigarette in his mouth again. He inhales and sighs cotton wisps.","\n","^Images of you poking holes through all his cigarettes resurface within your mind once more. You just realized, how are you both smoking? Did you miss a pack or something? You examine your cigarette, sure enough, no holes.","\n","^You can't quite pin your emotions, but you feel yourself becoming a very potent mixture of anger and sadness. You feel like purple. You feel like if lavender didn’t have a smell.","\n","^You direct your attention back to Almos.","\n",["ev",{"^->":"Daydream1.0.24.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"Almos, how are we smoking?\"",{"->":"$r","var":true},null]}],["ev",{"^->":"Daydream1.0.25.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^\"How do you even afford new cigarettes?\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"Daydream1.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.24.s"},[{"#n":"$r2"}],"\n",{"->":"TB5"},{"#f":5}],"c-1":["ev",{"^->":"Daydream1.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.25.s"},[{"#n":"$r2"}],"\n",{"->":"TB5"},{"#f":5}]}],{"#f":1}],"TB5":[["^“Orchids.” He interjects quietly while slowly turning towards you. His face grew heavy with shame as he dropped his gaze.","\n",["ev",{"^->":"TB5.0.2.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"What the hell are you talking about?\"",{"->":"$r","var":true},null]}],["ev",{"^->":"TB5.0.3.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^\"Stop trying to distract me! Just answer the question Almos!\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"TB5.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.2.s"},[{"#n":"$r2"}],"\n",{"->":"TB6"},{"#f":5}],"c-1":["ev",{"^->":"TB5.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.3.s"},[{"#n":"$r2"}],"\n",{"->":"TB6"},{"#f":5}]}],{"#f":1}],"TB6":[["^Almos remains silent.","\n","^You're about to blow a fuse.","\n","^He relinquishes his cigarette in the ashtray between you two. He once more stares back at the empty street down below.","\n","^Why were you so easily provoked at nothing? You hope you didn't make Almos feel sad. You feel the need to say something, but you're a little choked up at the moment.","\n","^You try grabbing his hand to comfort him, but he quickly retracted it to his lap. You give out a heavy sigh in response.","\n",["ev",{"^->":"TB6.0.10.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^_Look out into the street with Almos_",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"TB6.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.10.s"},[{"#n":"$r2"}],"\n",{"->":"TB7"},{"#f":5}]}],{"#f":1}],"TB7":[["^Can't beat 'em join 'em, you suppose. You join Almos in looking out in the empty street.","\n","^As the sun begins to set Almos resigns from looking out. You feel him staring at you now, but you don't meet his gaze. You stare on as he once was, not out of choice, but a feeling of necessity.","\n","^Something beyond starts to demand your attention. You find siren in the moon's image.","\n","^Were these the same forces acting upon Almos? He seemed so different today. Inexplicablly compelled to the horizon.","\n","^The moon shimmeres more dramtically than before, as if it were purposely dazzling you.","\n","^Light waves waft through the skies. They call to you.","\n","^An irresistible sensation akin to a rush of adrenaline overwhelms you. You feel compelled to melt away with the sky.","\n","^Almos’ attention is now entirely on you. It seems your and Almos’ demeanor have completely switched.","\n","^You get out of your seat to lean against the banister. You stand high above the charcoal-black ground. The white stripes of the road reminded you of stars.","\n","^Leaning over the banister isn't enough. You must greet the sky. Become one with the stars and nothingness between.","\n","^You maneuver yourself over the banister, one leg after the other.","\n","^You're in a moment of mania. You wish to feed into the euphoria, and get closer to the stars.","\n","^There is just enough space on the other end to hold your heels. You know not if you're shaking in fear or excitement.","\n","^Your eyes glisten with the moon’s image, filling your body with envy. For a moment, you wish you could shimmer in Almos' mind the very same way the moon has enthralled yours.","\n","^You lull and drift off into the moon’s ocean of light.","\n","^Almos’ eyes calmly chase you seven stories down into the street.","\n",["ev",{"^->":"TB7.0.32.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^_Continue..._",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"TB7.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.32.s"},[{"#n":"$r2"}],"\n",{"->":"EndOfAnEnd"},{"#f":5}]}],{"#f":1}],"EndOfAnEnd":["ev","str","^Jupiter is an empty street. / Jupiter is  relentless grief. / Jupiter is the tabacco between your teeth.","/str","str","^Rabbit","/str",{"x()":"FadeOutSeq","exArgs":2},"pop","/ev","\n","done",{"#f":1}],"JMP1":["^“Almos,” you’re not even sure you consciously expelled his name from your mouth. Can aluminum rust?”","\n","^You always seem to just say his name when you have a question. You think Almos is really smart. He knows a lot of things.","\n","^He doesn’t respond to you, however.","\n",{"#f":1}],"Rabbit":[["ev","str","^InBetween","/str",{"x()":"PlaySong","exArgs":1},"pop","/ev","\n","^You don’t know how long you’ve been sleeping, but you wake up with your face in some concrete.","\n","^You’re on an empty street. You manage the strength to lift yourself onto your knees.","\n","^Your vision is a little blurry, but your body is seemingly intact. You look behind you in search of the apartment from which you’ve thrown yourself.","\n","^There’s no such place behind you. You feel like you’re nowhere.","\n","^The world echoes blue and indigo all around you as if the colors were whispering in the air. You inhale, and the world around you swirls into your lungs.","\n","^There's a horrible beeping permeating all around you.","\n","^You slowly turn round again, only to be met with a slender figure placing their face uncomfortably close to yours.","\n","^They’re crouched on the floor before you. They sport a suit and are humanoid in figure. They're covering their face with a rabbit mask.","\n",["ev",{"^->":"Rabbit.0.24.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"Who are you?\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"Rabbit.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.24.s"},[{"#n":"$r2"}],"\n",{"->":"RabbitBrain"},{"#f":5}]}],{"#f":1}],"RabbitBrain":[["^\"Who are you?\" you ask, uncertainly. The figure looks at you with curiosity while lifting itself to a half squat.","\n","^“Rabbit,” it responds quietly.","\n",["ev",{"^->":"RabbitBrain.0.4.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"Rabbit?\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"RabbitBrain.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.4.s"},[{"#n":"$r2"}],"\n",{"->":"RabbitBrain1"},{"#f":5}]}],{"#f":1}],"RabbitBrain1":[["^“Rabbit, huh. I’m Aiolos,” you announce. You’re not sure whether to feel scared or not.","\n","^\"Can you do this?\" Rabbit asks. He holds out his palm, and within it, you see a revolver begin to materialize. It's radiating a brilliant light blue color.","\n","^\"Um.. No,\" you respond.","\n","^\"Resonance weapon,\" Rabbit says. \"Think, and behold.\"","\n","^\"Think and behold,\" you echo.","\n","^Rabbit looks at you, confused. \"Do, don't say,\" they instruct.","\n","^You extend you arm out and look at your palm.","\n","^You focus, and think of a revolver in your mind--it's shape, feel, and power. You pull this image into your hand, attempting to will it into existence.","\n","^Sure enough a radiating blue gun materializes in your hand.","\n","^\"Bravo,\" Rabbit announces. You drop your focus, and the gun disappears.","\n","^Rabbit nods to you, gets up, and starts walking away. You feel compelled to follow Rabbit.","\n",["ev",{"^->":"RabbitBrain1.0.22.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^_Follow Rabbit_",{"->":"$r","var":true},null]}],["ev",{"^->":"RabbitBrain1.0.23.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^_Run away from Rabbit_",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"RabbitBrain1.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.22.s"},[{"#n":"$r2"}],"\n","ev",{"VAR?":"BornAgain"},0,">",{"VAR?":"KillCommandAlmos"},true,"==","&&","/ev",[{"->":".^.b","c":true},{"b":["\n",{"->":"DHR"},{"->":".^.^.^.18"},null]}],[{"->":".^.b"},{"b":["\n",{"->":"FollowRabbit"},{"->":".^.^.^.18"},null]}],"nop","\n",{"#f":5}],"c-1":["ev",{"^->":"RabbitBrain1.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.23.s"},[{"#n":"$r2"}],"\n","ev",{"VAR?":"BornAgain"},0,">",{"VAR?":"KillCommandAlmos"},true,"==","&&","/ev",[{"->":".^.b","c":true},{"b":["\n",{"->":"RotAway"},{"->":".^.^.^.18"},null]}],[{"->":".^.b"},{"b":["\n",{"->":"RunAway"},{"->":".^.^.^.18"},null]}],"nop","\n",{"#f":5}]}],{"#f":1}],"DHR":["^You approach Rabbit, but as soon as  you start following, they turn around and shake their head disapprovingly. You feel an overwhelming urge to run away from Rabbit.","\n",{"->":"RotAway"},{"#f":1}],"FollowRabbit":["^You cautiously follow Rabbit. Their footsteps sugar through the blue and indigo mist surrounding you. Their silhouette promenades at the edge of your vision.","\n","^You follow them for a while. Their footsteps ramp, faster and faster. To keep them in vision, you’re brought to a jog, and then burst into full-on sprinting.","\n","ev",{"VAR?":"BornAgain"},0,"==","/ev",[{"->":".^.b","c":true},{"b":["\n","^You lose Rabbit in the mist, you're utterly alone and swallowed in fog. A beeping noise continues to ring on in the distance. You hear yourself getting closer and closer to the source.","\n","^You're movements become a lot more deliberate and cautious.","\n","^You walk aimlessly in the genral direction of the noise until you stumble upon a figure in the distance.","\n","^\"Rabbit?\" you call out.","\n","^No response.","\n","^You approach thinking it's Rabbit, but you're greeted with a mechanical figure. They are faceless, and the metal rods and cogs that compose their body turn to you.","\n","^You feel the figure approach you with malicious content. You feel the need to protect yourself. You once more materialize a revolver in your hand.","\n","^The figure clanks towards you. Prepare for combat.","\n","ev",{"x()":"RevealInventoryButton"},"pop","/ev","\n","ev","str","^FacelessConstruct","/str",{"x()":"PlaySong","exArgs":1},"pop","/ev","\n","ev","str","^FacelessConstruct","/str","str","^FollowRabbit1","/str",{"x()":"StartCombat","exArgs":2},"pop","/ev","\n",{"->":".^.^.^.11"},null]}],[{"->":".^.b"},{"b":["\n","^You lose Rabbit in the mist, you're utterly alone and swallowed in fog. You begin to walk aimlessly and stumble upon a figure in the distance. You approach thinking it's Rabbit, but you're greeted with a balloon animal. You feel the most viscious of auras radiating off of it. It's most definetely dangerous. You tense yourself, and prepare to eliminate the balloon animal. You once more materialize a revolver in your hand.","\n","^The ballon animals waddles towards you, ready for a fight. Prepare for combat.","\n","ev","str","^BalloonAnimal","/str",{"x()":"PlaySong","exArgs":1},"pop","/ev","\n","ev","str","^BalloonAnimal","/str","str","^FollowRabbit1","/str",{"x()":"StartCombat","exArgs":2},"pop","/ev","\n",{"->":".^.^.^.11"},null]}],"nop","\n","done",{"#f":1}],"FollowRabbit1":["ev",{"x()":"StopSong"},"pop","/ev","\n","ev",{"CNT?":"BornOnceAgain"},0,"==","/ev",[{"->":".^.b","c":true},{"b":["\n","^The construct's gears sputter and grind to a halt.","\n","^Its final twitch echoes in the silence. You're still breathing, but barely.","\n",{"->":".^.^.^.12"},null]}],[{"->":".^.b"},{"b":["\n","^The balloon pops and deflates. The final bits of air that substantiated its being whir into the wash of colors that encompass this world.","\n",{"->":".^.^.^.12"},null]}],"nop","\n",{"->":"FollowRabbit2"},{"#f":1}],"FollowRabbit2":[["^You're not sure what's become of you or how you've just performed such feats. It felt as though something within you has awakened. You dread no longer on the topic, and continue your search to find Rabbit, and the source of the beeping noise.","\n","^You continue to follow the noise until its blaringly close by.","\n","^You're seemingly endless wander is interupted once more by another silhouette. When you approach, you realize it's Rabbit again. The figure stands next to a cubicle, and beeping, object sprouting from the floor. On further inspection, you realize it's a phone box.","\n","^\"Call,\" beckons Rabbit. You only know your own number.","\n",["ev",{"^->":"FollowRabbit2.0.8.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^_Call yourself._",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"FollowRabbit2.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.8.s"},[{"#n":"$r2"}],"\n",{"->":"R1"},{"#f":5}]}],{"#f":1}],"R1":["ev",{"VAR?":"PhonePickup"},true,"==","/ev",[{"->":".^.b","c":true},{"b":["\n","^You would think it would be pointess to call yourself, but you realize you don't have your phone in your pocket. You remember you left it out on the table to see whether aluminum could rust.","\n",{"->":"R1.7"},null]}],[{"->":".^.b"},{"b":["\n","^You would think it would be pointless to call yourself, but you realize you don't have your phone in your pocket. You thought for sure it was in your pocket from when you jumped off the balcony, but when you go to feel for it, it isn't there at all.","\n",{"->":"R1.7"},null]}],"nop","\n","^You call your own number, and the phone rings.","\n","ev",{"VAR?":"PhonePickup"},true,"==","/ev",[{"->":".^.b","c":true},{"b":["\n","^Someone picks up on the other end. You hear some shuffling before a voice indistinguishable from your own greets you with a \"Hello? Who is this?\"","\n","^Rabbit looks upon you; its body language is heavy with grief.","\n","^\"This is Aiolos... who are you?\" you ask.","\n","^\"I'm Aiolos too,\" the voice responds. They sound hollow, \"you sound exactly like me.\"","\n","^I think we're one and the same,\" you reply. \"Are you on the balcony right now?\"","\n","^A weary \"Yes...?\" crinkles across the line. You look to Rabbit for even the slightest bit of clarification. They continue to be mute. Their eyes pierce through yours. You feel as though they are artificially stringing fish hooks through your eyes and poking and pulling at your throat. You feel compelled to say just one thing.","\n","^\"Kill Almos.\"","\n",["ev",{"^->":"R1.16.b.15.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^_Continue..._",{"->":"$r","var":true},null]}],{"->":"R1.18"},{"c-0":["ev",{"^->":"R1.16.b.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.15.s"},[{"#n":"$r2"}],"\n","ev",true,"/ev",{"VAR=":"KillCommandAlmos","re":true},{"->":"BornBefore"},{"#f":5}]}]}],[{"->":".^.b"},{"b":["\n","^Rabbit begins ringing. There's a glowing square in their pocket. Rabbit picks up your call. Their eyes pierce through yours. You feel as though they are artificially stringing fish hooks through your eyes and poking and pulling at your throat. You feel compelled to say just one thing.","\n","^\"Kill Aiolos.\"","\n","^Rabbit approaches you, and in your panic, you collapse  to the floor and blackout. Rabbit kills you, and you unravel into nothing at all.","\n",["ev",{"^->":"R1.17.b.7.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^_Continue..._",{"->":"$r","var":true},null]}],{"->":"R1.18"},{"c-0":["ev",{"^->":"R1.17.b.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.7.s"},[{"#n":"$r2"}],"\n","ev","str","^ ","/str","str","^BornOnceAgain","/str",{"x()":"FadeOutSeq","exArgs":2},"pop","/ev","\n","done",{"#f":5}]}]}],"nop","\n",{"#f":1}],"BornBefore":["ev","str","^Jupiter is prolific. / Jupiter is demanding. / Jupiter is the Absolute Authority. / You are now playing as Almos.","/str","str","^TheGarden","/str",{"x()":"FadeOutSeq","exArgs":2},"pop","/ev","\n","done",{"#f":1}],"BornOnceAgain":[["^You feel your vision go hazy for a moment, but you deem it a passing moment of vertigo. What were you about to say again? Oh, yes, you remember now.","\n","ev",{"f()":"JMP1"},"out","/ev","\n","^Your thoughts are interrupted by your phone ringing in your pocket. You pick up the phone. \"Hello? Who is this?\" You hear nobody on the other end. Wrong number, you suppose. Since your phone is out anyway, you might as well search if aluminum can rust.","\n","^No. Aluminum doesn't rust, apparently. It corrodes. Huh. Interesting, you suppose. You leave the phone out on the table.","\n","^You try getting Almos' attention again by touching his hand, but he stays fixated on the street below. He gets  enraptured like this sometimes. Perhaps he's daydreaming. Maybe he isn't even really there. His body is before you, but his mind is on another planet, for all you know. You sit in silence for a bit longer.","\n",["ev",{"^->":"BornOnceAgain.0.13.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^_Daydream along Almos._",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"BornOnceAgain.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.13.s"},[{"#n":"$r2"}],"\n","ev",true,"/ev",{"VAR=":"PhonePickup","re":true},"ev",{"VAR?":"BornAgain"},1,"+",{"VAR=":"BornAgain","re":true},"/ev",{"->":"Daydream"},{"#f":5}]}],{"#f":1}],"RotAway":[["^You wander aimless through this picturesque orchid-hued world. You check behind yourself occasionally, and Rabbit is nowhere to be seen. You suppose he didn't care much to follow you, only lead.","\n","^A blue and indigo mist continues to swirl around your legs as you walk though each empty street after the next. You finally stumble upon a park, within it stands firm a children's slide. A peculiar figure could be seen sliding down it, and promptly climbing the ladder attached over and over again. You approach slowly, and catch the figure's attention. They leave the slide and walk up to you.","\n","ev",{"VAR?":"MeetBoris"},0,">","/ev",[{"->":".^.b","c":true},{"b":["\n","^\"Hellooo again,\" he bellows.","\n","^\"Again?\" you prompt.","\n","^\"Well, this version of you won't remember me, haha. But rest assured we have met before. There are a million spindles of you about, and I'm sure to meet a million more.\"","\n","^He grabs hold of your arm and pulls you close to him. With the other hand he clamps beneath your chin and examines your face.","\n",{"->":".^.^.^.11"},null]}],[{"->":".^.b"},{"b":["\n","^\"Hellooo,\" he bellows. \"Look at what we have here!\" He grabs hold of your arm and pulls you close to him. With the other hand he clamps beneath your chin and examines your face.","\n",{"->":".^.^.^.11"},null]}],"nop","\n",["ev",{"^->":"RotAway.0.13.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":18},{"s":["^\"Mind getting your hands off of me?\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"RotAway.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.13.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^He retracts a little and just smiles. \"Hahaha, aren't you a sexy one. You're diseased, aren't you? You look sickly and beautiful and empty.\" His face grows wicked and stupid. \"Jumping off a balcony for a man, now? How repulsing.\"","\n",["ev",{"^->":"RotAway.0.g-0.2.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":18},{"s":["^\"It wasn't like that, you know. Something called to me.\"",{"->":"$r","var":true},null]}],{"c-1":["ev",{"^->":"RotAway.0.g-0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.2.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.^.g-1"},{"#f":5}],"#f":5}],"g-1":["^\"Ah, yes, of course,\" he says while pacing about. He circles and examines you now like a shark teasing its prey. He's dressed in gray fabrics as if someone wrapped a feathery tapestry around him. The clothes carry the occasionally smear of green hues.","\n","ev",{"VAR?":"UncannyPeculiarity"},0,">","/ev",[{"->":".^.b","c":true},{"b":["\n","^\"Also, who are you calling diseased?\" you spout. You're the one that looks like a damn pigeon.\"","\n","^\"Perhaps I was in another life, who knows.\" he responds. \"I certainly dress the part, don't I? Anyhow...\"","\n",{"->":".^.^.^.8"},null]}],"nop","\n","^He halts in front of you once more, \"That would be Jupiter that was calling to you.\"","\n","^\"Jupiter? I was looking out at the moon,\" you say.","\n","^\"It was lovely, wasn't it?\" the man says. It seems like the man just ignored what you said.","\n","^\"It takes many shapes and forms,\" he continues. \"Jupiter is multitude, NO, an AMALGAMATION of inexplicable feeling. 'THE PINACLE OF EXISTENCE' some might be bold enough to say.\" He pauses briefly to clear his throat, \"It's also a very real place.\"","\n",["ev",{"^->":"RotAway.0.g-1.18.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-2","flg":18},{"s":["^\"Are we on Jupiter now?\"",{"->":"$r","var":true},null]}],{"c-2":["ev",{"^->":"RotAway.0.g-1.c-2.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.18.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.^.g-2"},{"#f":5}],"#f":5}],"g-2":["^\"Of course not,\" he responds dully. \"We're in a sort of in-between world. A proxy, if you will. Your signal to Jupiter was interrupted by something. This place is just as artificial as the reality you once stood in before.\"","\n",["ev",{"^->":"RotAway.0.g-2.2.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-3","flg":18},{"s":["^\"So, who interrupted the signal?\"",{"->":"$r","var":true},null]}],{"c-3":["ev",{"^->":"RotAway.0.g-2.c-3.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.2.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.^.g-3"},{"#f":5}],"#f":5}],"g-3":["^\"Well, that little friend of yours did,\" he says cheerily. \"I forgot to mention though, I'm Boris.\"","\n","^You think Boris is a bitch.","\n","^\"Well you're awfully quiet now. It's nice to meet you,\" he strikes his hand out.","\n","^You gaze at his hand, but don't go to shake it. You return your focus to his face.","\n",["ev",{"^->":"RotAway.0.g-3.8.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-4","flg":18},{"s":["^\"Why the hell are you here?\"",{"->":"$r","var":true},null]}],{"c-4":["ev",{"^->":"RotAway.0.g-3.c-4.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.8.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.^.g-4"},{"#f":5}],"#f":5}],"g-4":["^\"Straight to the point, are we? Well, according to the script, I'm here to keep you on track when you make stupid decisions. Rabbit is one of Almos' creations.\"","\n","^You interject, \"Didn't you just insult me earlier for jumping off the balcony? Why would Almos create you to say that?\"","\n","^\"Perhaps he thinks you're predicatable, or just straight pathetic. Who knows, I'm no prophet! Haha! I'm just following the script. Anyway, I'm glad you're here now. Almos wants you to enter some building over here.\"","\n","^<i>Boris promenades before you leading the path. Before long, you stumble upon what looks like a government facility. You feel compelled to voice this to Boris.<i>","\n","^\"Hey, isn't this a government building?\" you question.","\n","^Boris reels and is taken aback, \"How would you know what a government building looks like? Did... someone tell you that this is a government building? You're a spooky one, you know that? Anyway here it is. Almos awaits you within.\"","\n","^Boris reaches into his pocket and pulls out a keycard, opens the door, and beckons you through.","\n","ev",{"VAR?":"MeetBoris"},1,"+",{"VAR=":"MeetBoris","re":true},"/ev",["ev",{"^->":"RotAway.0.g-4.20.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-5","flg":18},{"s":["^_Enter the building._",{"->":"$r","var":true},null]}],{"c-5":["ev",{"^->":"RotAway.0.g-4.c-5.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.20.s"},[{"#n":"$r2"}],"\n",{"->":"Government"},{"#f":5}],"#f":5}]}],{"#f":1}],"RunAway":[["^You wander aimless through this picturesque orchid-hued world. You check behind yourself occasionally, and Rabbit is nowhere to be seen. You suppose he didn't care much to follow you, only lead.","\n","^A blue and indigo mist continues to swirl around your legs as you walk though each empty street after the next. You finally stumble upon a park, within it stands firm a children's slide. A peculiar figure could be seen sliding down it, and promptly climbing the ladder attached once again over and over again. You approach slowly, and the figure catches you approaching. He leaves the slide and walk up to you.","\n","^\"Hellooo,\" he bellows. \"Look at what we have here!\" He grabs hold of your arm and pulls you close to him. With the other hand he clamps beneath your chin and examines your face.","\n",["ev",{"^->":"RunAway.0.6.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"Mind getting your hands off of me?\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"RunAway.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.6.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^He retracts a little and just smiles. \"Hahaha, aren't you a sexy one. You're diseased, aren't you? You look sickly and beautiful and empty.\" His face grows wicked and stupid. \"Jumping off a balcony for a man, now? How repulsing.\"","\n",["ev",{"^->":"RunAway.0.g-0.2.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^\"It wasn't like that, you know. Something called to me.\"",{"->":"$r","var":true},null]}],{"c-1":["ev",{"^->":"RunAway.0.g-0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.2.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.^.g-1"},{"#f":5}],"#f":5}],"g-1":["^\"Ah, yes, of course,\" he says while pacing about. He circles and examines you now like a shark teasing its prey. He's dressed in gray cloths as if someone wrapped a feathery tapestry around him. The clothes carry the occasionally smear of green hues.","\n","^He halts in front of you once more, \"That would be Jupiter that was calling to you.\"","\n","^\"Jupiter? I was looking out at the moon,\" you say.","\n","^\"It was lovely, wasn't it?\" the man says. It seems like the man just ignored what you said.","\n","^\"It takes many shapes and forms,\" he continues. \"Jupiter is multitude, NO, an AMALGAMATION of inexplicable feeling. 'THE PINACLE OF EXISTENCE' some might be bold enough to say.\" He pauses briefly to clear his throat, \"It's also a very real place.\"","\n",["ev",{"^->":"RunAway.0.g-1.10.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-2","flg":2},{"s":["^\"Are we on Jupiter now?\"",{"->":"$r","var":true},null]}],{"c-2":["ev",{"^->":"RunAway.0.g-1.c-2.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.10.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.^.g-2"},{"#f":5}],"#f":5}],"g-2":["^\"Of course not,\" he responds dully. \"We're in a sort of in-between world. A proxy, if you will. Your signal to Jupiter was interrupted by something. This place is just as artificial as the reality you once stood in before.\"","\n",["ev",{"^->":"RunAway.0.g-2.2.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-3","flg":2},{"s":["^\"So, who interrupted the signal?\"",{"->":"$r","var":true},null]}],{"c-3":["ev",{"^->":"RunAway.0.g-2.c-3.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.2.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.^.g-3"},{"#f":5}],"#f":5}],"g-3":["^\"Well, that little friend of yours did,\" he says cheerily. \"I forgot to mention though, I'm Boris.\"","\n","^You think Boris is a bitch.","\n","^\"Well you're awfully quiet now. It's nice to meet you,\" he strikes his hand out.","\n","^You gaze at his hand, but don't go to shake  it. You return your focus to his face.","\n",["ev",{"^->":"RunAway.0.g-3.8.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-4","flg":2},{"s":["^\"Why the hell are you here?\"",{"->":"$r","var":true},null]}],{"c-4":["ev",{"^->":"RunAway.0.g-3.c-4.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.8.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.^.g-4"},{"#f":5}],"#f":5}],"g-4":["^\"Straight to the point, are we? Well, according to the script, I'm here to keep you on track when you make stupid decisions. Rabbit is one of Almos' creations.\"","\n","^You interject, \"Didn't you just insult me earlier for jumping off the balcony? Why would Almos create you to say that?\"","\n","^\"Perhaps he thinks you're predicatable, or just straight pathetic. Who knows, I'm no prophet! Haha! I'm just following the script.","\n","^Boris is now looking off in the distance, \"You hear that beeping right? It's best you follow it. It's getting kind of annoying now, ain't it? Also, isn't this your lucky day, I see Rabbit right over there in the distance, I think they still want you to follow them.\"","\n","ev",{"VAR?":"MeetBoris"},1,"+",{"VAR=":"MeetBoris","re":true},"/ev",["ev",{"^->":"RunAway.0.g-4.14.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-5","flg":2},{"s":["^_Follow Rabbit._",{"->":"$r","var":true},null]}],{"c-5":["ev",{"^->":"RunAway.0.g-4.c-5.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.14.s"},[{"#n":"$r2"}],"\n",{"->":"FollowRabbit"},{"#f":5}],"#f":5}]}],{"#f":1}],"TheGarden":["^You were offered work finally and haven’t had the heart to tell Aiolos yet. You accepted the offer without him knowing. You thought he would be hurt by that. But, at the same time, you had no desire to unpack all that was to come if you had told Aiolos.","\n","^To spare yourself from him, you kept quiet, but that doesn’t mean you’ve spared yourself from the guilt. Aiolos can be very dramatic at times, and you’ve never lied to Aiolos before. But, being afforded a night shift at this new job–after some slight negotiation with the recruiters–has made the lying a little easier.","\n","^Is it really lying if you haven’t said anything?","\n","^Regardless, you’ve left for work every night–or rather, early morning–on weekdays for a little over two weeks now. And, by leaving for work, you really mean sneaking out at night to avoid waking up Aiolos.","\n","^The work isn’t particularly exciting. You’re usually assigned small coding tasks, most of which require you to clean up some already present scripts, or you trying your hand at making them more efficient.","\n","^From twelve to six in the morning, you’re posted up in one of the government’s proxy facilities close to your apartment.","\n","^To manage population distributions, citizens were assigned keycards, and all exits to residences were equipped with scanners. Leaving one’s home requires both a key card and a retinal scan, at which point a curfew reminder will be sent to your phone.","\n","^Citizens are required to complete a second scan when they return to their residence. Failure to do so prior to the curfew could result in serious consequences–so you were informed that is. Neither Aiolos nor you had any intention of finding out.","\n","^Additionally, you could only scan your keycard to leave your home during permitted time slots on par with your citizen rank. At all other points in time, exits were permanently locked. Even windows, despite being open, were fitted with detection systems to alert law enforcement to suspicious activity.","\n",{"->":"TheGardenP2"},{"#f":1}],"TheGardenP2":["^You are both brought food and toiletries at the start of each week. It usually comfortably lasts us until the next drop-off. Essentials are always provided, but since neither Aiolos nor you were employed until recently, you both would just passively gain a newly established currency as an allowance. Varying items outside of the essentials could be ordered with the new coin.","\n","^The selection isn’t all too exciting unfortunately. There’s some stuff like board games, playing cards, and video games for entertainment purposes, but Aiolos loved to rave of how appreciative he was of the provided selection of different bouquets of flowers.","\n","^You suppose people wanted to make their interior a little bright and flashy, but it never was of much importance to you. Aiolos loves sprucing up the apartment though, ever since the government had mandated the tight restrictions around leaving the unit.","\n","^One thing you did love, though, was the selection of varied pastries and higher-end delicacies. Your apartment was subsequently always filled with flowers and pastry.","\n","^That’s pretty much all you and Aiolos spent the currency on.","\n","^Despite the added selection being behind a paywall, you’ve never had complaints about the essential food and ingredients provided to you both. You’re exceptional at cooking, and you extend that service to Aiolos as well.","\n","^C-class citizens, like Aiolos, could only open the door in times of Essential Collections. However, because citizens are meant only to briefly open their door to collect items, a five minute curfew timer was placed.","\n","^Aiolos somehow gets painfully close to missing the deadline, however. It’s often a mixture of him brining in the bags one at a time, and him deciding to organize the supplies in your fridge while the door is still open.","\n","^It drive you mad that he won’t just drag the bags inside, close the door, rescan, and deal with organizing after. You feel your throat straining in anger already at the thought of it. You try not to get too worked up.","\n","^Due to your new job, you were afforded B-class citizen status. It’s essentially identical to that of a C-class citizen, with the added authority of leaving for work in your allotted time slot.","\n","^You honestly wish the government gave you a color coded keycard that reflected your rank. The metallic, gray rectangles are a little bland for your taste. Citizen information is already openly available for public lookup.","\n","^Even B-class citizens have their curfew time-window attached to their profile. You think it wouldn’t be much of a security risk. Speaking of which, you really hope that Aiolos doesn’t go stalking your profile.","\n","^You’re afraid of the difficult conversation that would ensue. Sometimes you feel controlled by Aiolos. Perhaps you give him too much jurisdiction over your being.","\n",{"->":"T1"},{"#f":1}],"T1":[["ev",{"VAR?":"GunFun"},0,">","/ev",[{"->":".^.b","c":true},{"b":["\n","^You feel yourself awaken from a horrible nightmare. You were just murdered by Aiolos. You lay perfectly still as if still in stasis. You stay there and allow the fright to subside.","\n",{"->":"T1.0.6"},null]}],"nop","\n","^You prop yourself on your forearms and lift your chest to get a better look at the clock on your nightstand. You blink a couple of times to bring it into focus. It's around twelve o'clock noon. You don't sleep very much nowadays because of your night shift, but it's the only way to pursue this venture without Aiolos knowing. You wonder why he hasn't grown suspicious of the fact that you 'sleep' for an excessive amount of time. Perhaps he thinks you're depressed.","\n","^You try to pretend you're still sleeping to get an extra hour of rest in, but you fear you've already made too much noise ruffling the sheets. Aiolos has a pretty good ear for that, unfortunately. You guess he gets bored waiting for you to wake up.","\n","^\"Almos? Are you awake?\" His voice is miserable and distant. You feel your heart sink. You didn't  want to ignore him.","\n",["ev",{"^->":"T1.0.14.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":"T1.0.c-0","flg":2},{"s":["^_Go back to sleep._",{"->":"$r","var":true},null]}],["ev",{"^->":"T1.0.15.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":"T1.0.c-1","flg":2},{"s":["^_Get up from the bed and go to Aiolos._",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"T1.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":"T1.0.14.s"},[{"#n":"$r2"}],"\n",{"->":"FOF"},{"#f":5}],"c-1":["ev",{"^->":"T1.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":"T1.0.15.s"},[{"#n":"$r2"}],"\n",{"->":"Gun"},{"#f":5}]}],{"#f":1}],"FOF":[["^You face plant back into the pillow, and the world around you dims to nothing.","\n","ev","str","^TheGarden","/str",{"x()":"PlaySong","exArgs":1},"pop","/ev","\n","^You awake in your dreams. You’re sitting at a table with Aiolos. You’re at a lovely coffee shop, which also happens to be in a garden. You’re on a small bridge, just above a nice running stream of water, which also happens to be where a coffee shop has put some seating–in the middle of a garden, that is. You feel happy here.","\n","^Aiolos is smiling as well. He feels happy here.","\n","^You don’t like coffee, though. You’re not entirely sure why you’re here, maybe subconsciously your mind wants you to drink some coffee. You are tired all the time. You may like it just as much as cigarettes.","\n","^You wonder if the garden has some of your favorite flowers. You hope there aren’t any flowers close to where you and Aiolos would be sitting. Aiolos is scared of bees, among other things.","\n","^You sit in silence for a while. Aiolos stares intently at you, while your eyes are traced on a field of flowers just in vision from the bridge you sit upon.","\n","^Aiolos calls to you, “Almos?”","\n",["ev",{"^->":"FOF.0.22.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":18},{"s":["^\"Hm?\" you mutter.",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"FOF.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.22.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^You feel enraptured by the field of flowers in the distance. Aiolos doesn’t respond to your “Hm.” You feel tired. Your eyes are sullen and droopy. Finally, Aiolos breaks his silence, “What is your favorite flower?”","\n","^You’ve never really thought of an answer to this question. You sit in thought for a while, just thinking and thinking and thinking. You don't really have a favorite flower.","\n","^You think Aiolos is becoming frustrated with your lack of response. You want to ask Aiolos a question to break the silence.","\n",["ev",{"^->":"FOF.0.g-0.6.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":18},{"s":["^\"Where are we?\"",{"->":"$r","var":true},null]}],{"c-1":["ev",{"^->":"FOF.0.g-0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.6.s"},[{"#n":"$r2"}],"\n",{"->":"FOF.0.g-1"},{"#f":5}],"#f":5}],"g-1":["^Aiolos lets in a great sigh, “That’s a great question, honestly. I was hoping you would know the answer to that one.”","\n","^His eyes follow yours to the flower field. “It feels like we’re trapped, honestly, I haven’t been able to put all the pieces together, but nothing feels right. You ignore me a whole lot. What’s up with that?”","\n",["ev",{"^->":"FOF.0.g-1.4.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-2","flg":2},{"s":["^\"You're just kind of annoying, honestly.\"",{"->":"$r","var":true},null]}],["ev",{"^->":"FOF.0.g-1.5.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-3","flg":2},{"s":["^\"I've just been caught up in my thoughts a lot.\"",{"->":"$r","var":true},null]}],{"c-2":["ev",{"^->":"FOF.0.g-1.c-2.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.4.s"},[{"#n":"$r2"}],"\n","ev",{"VAR?":"UncannyPeculiarity"},1,"+",{"VAR=":"UncannyPeculiarity","re":true},"/ev",{"->":"FOF1"},{"#f":5}],"c-3":["ev",{"^->":"FOF.0.g-1.c-3.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.5.s"},[{"#n":"$r2"}],"\n",{"->":"FOF1"},{"#f":5}],"#f":5}]}],{"#f":1}],"FOF1":[["^“Yeah, I know that,” he responds, “but the old you would never have been this distant. I feel like you’re not even here sometimes, which honestly is kind of true.” He holds his tongue for a while, “I know about your new job, by the way. I think you sometimes take me for a fool. I don’t think I would have been upset. I’m just more upset you didn’t tell me.”","\n",["ev",{"^->":"FOF1.0.2.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":18},{"s":["^\"I'm sorry, I don't really know what to say.\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"FOF1.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.2.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^“You don’t have to say anything at all. I just want to share this moment with you. We won’t have this forever, you know.”","\n",["ev",{"^->":"FOF1.0.g-0.2.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":18},{"s":["^\"Do you want to head to the field of flowers?\"",{"->":"$r","var":true},null]}],{"c-1":["ev",{"^->":"FOF1.0.g-0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.2.s"},[{"#n":"$r2"}],"\n",{"->":"FOF1.0.g-1"},{"#f":5}],"#f":5}],"g-1":["^“Sure thing.” Aiolos rises from his seat gracefully and extends his hand out to you. You grab hold of his hand, and he leads you to the middle of the flower field. It feels as though the flower field gets further and further the more you pursue it.","\n","^\"Do you hear that?\" Aiolos says to you. He extends his arm out to you and blocks you from walking any further.","\n","^He begins shaking.","\n","^I think... I think I hear bees.","\n","^You look over to him and his face is flush with panic.","\n","^\"Don't worry we can handle it,\" you announce. You bring focus to your hand and manifest a sword within. You feel in control. You're aware you're in a dream state.","\n","^Aiolos is encouraged by your confidence. He reciprocally manifests a gun in hand.","\n","^Two bees materialize before you. Prepare for combat.","\n","ev","str","^Almos","/str",{"x()":"AddCharacter","exArgs":1},"pop","/ev","\n","ev","str","^Sword","/str",{"x()":"AddWeapon","exArgs":1},"pop","/ev","\n","ev",{"x()":"StopSong"},"pop","/ev","\n","ev","str","^Bees","/str",{"x()":"PlaySong","exArgs":1},"pop","/ev","\n","ev","str","^Bees!","/str","str","^FOF2","/str",{"x()":"StartCombat","exArgs":2},"pop","/ev","\n","done",{"#f":5}]}],{"#f":1}],"FOF2":[["ev",{"x()":"StopSong"},"pop","/ev","\n","^The bees return to nothingness.","\n","^You look to each other but neither of you speak.","\n","^You both continue your march to the field of flowers.","\n","^You both walk for an un-trivial amount of time before finally stumbling upon a pocket of orchids.","\n","^The orchids are aranged in too perfect of a matter. The pocket is a perfect circle. It's as if the orchids were meant to be a beacon, or rather a target. You internalize these thoughts, but a part of you feels like you're meant to be here in this very moment. This place is calling to you, and you're braced to fall within its influence.","\n","^Aiolos pulls you down to the ground, and you’re both lying in the flowers. The sun above you feels gentle as it pours its warmth upon you. You feel happy being around Aiolos.","\n","^Aiolos lifts himself from his back and collapses upon you, hugging you. You hug him back. Aiolos leans in closer to your ear and whispers to you, “Earlier today, a voice over the phone told me to kill you, Almos.”","\n","^You don’t feel frightened by this sentiment.","\n",["ev",{"^->":"FOF2.0.21.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":18},{"s":["^\"Are you going to listen to the voice?\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"FOF2.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.21.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^You're voice is calm and collected. You query Aiolos, \"Are you going to listen to the voice?\"","\n","^“Of course,” he responds. You close your eyes. Everything is going to be okay. You relinquish yourself, and you let Aiolos strangle you to death.","\n",["ev",{"^->":"FOF2.0.g-0.4.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^_Continue..._",{"->":"$r","var":true},null]}],{"c-1":["ev",{"^->":"FOF2.0.g-0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.4.s"},[{"#n":"$r2"}],"\n",{"->":"EOTW"},{"#f":5}],"#f":5}]}],{"#f":1}],"EOTW":["ev","str","^Jupiter fuels fame. / Jupiter exhausts your brain. / Jupiter is the one and only love you may tame. / You are now playing as Aiolos.","/str","str","^WorldOfRot","/str",{"x()":"FadeOutSeq","exArgs":2},"pop","/ev","\n","done",{"#f":1}],"Gun":[["^You rise from the bed in a clumsy stir and walk over to the door to greet Aiolos. He usually likes to watch television in the mornings and awaits you on the couch to watch a show or two. This time, however, when you upon the door, you're greeted by Aiolos already approaching you slowly. His hands are behind his back. He seems paranoid.","\n",["ev",{"VAR?":"GunFun"},1,">","/ev",{"->":".^.b","c":true},{"b":["\n","^You both stand there for an uncomfortable amount of time in a standoff. You look down at your feet. Both of you have become ankle deep in the red liquid. The room is filling with a metallic air. It feels corrosive to breathe in. You hold your breathe. You feel sick, but you return your focus to Aiolos.","\n",{"->":"Gun.0.4"},null]}],["ev",{"VAR?":"GunFun"},0,">","/ev",{"->":".^.b","c":true},{"b":["\n","^Behind Aiolos you see a glimpse of the living room from around the corner. It seems as there there's a thin layer of red liquid pooling slowly into the hallway.","\n",{"->":"Gun.0.4"},null]}],"nop","\n","ev",{"VAR?":"GunFun"},0,"==","/ev",[{"->":".^.b","c":true},{"b":["\n",["ev",{"^->":"Gun.0.11.b.1.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"Good morning Aiolos.\"",{"->":"$r","var":true},null]}],{"->":"Gun.0.12"},{"c-0":["ev",{"^->":"Gun.0.11.b.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.1.s"},[{"#n":"$r2"}],"\n",{"->":"Gun2"},{"#f":5}]}]}],"nop","\n",["ev",{"^->":"Gun.0.14.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"Hey, is something the matter?\"",{"->":"$r","var":true},null]}],["ev",{"^->":"Gun.0.15.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^_Remain silent._",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"Gun.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.14.s"},[{"#n":"$r2"}],"\n",{"->":"Gun2"},{"#f":5}],"c-1":["ev",{"^->":"Gun.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.15.s"},[{"#n":"$r2"}],"\n",{"->":"Gun2"},{"#f":5}]}],{"#f":1}],"Gun2":["^\"Almos,\" Aiolos utters. \"Hey.\"","\n","^His eyes look wild and irregular.","\n","^\"I'm really sorry. Like, really... really...\" his voice drones off to a low mumble.","\n","ev",{"VAR?":"GunFun"},2,">","/ev",[{"->":".^.b","c":true},{"b":["\n","^The room is still slowly filling with the red  liquid. You both are chest deep. Aiolos wades through and approaches you. He just hugs you, and you hug him back.","\n","^You both stay there, planted firmly, until the room is completely flooded.","\n","^You both drown in each other's arms.","\n",["ev",{"^->":"Gun2.11.b.7.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^_Continue..._",{"->":"$r","var":true},null]}],{"->":"Gun2.13"},{"c-0":["ev",{"^->":"Gun2.11.b.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.7.s"},[{"#n":"$r2"}],"\n",{"->":"ParadiseLost"},{"#f":5}]}]}],[{"->":".^.b"},{"b":["\n","^You're taken aback by Aiolos' demeaner.","\n","^You back up a little into the doorway. \"Sorry for what?\" you question.","\n",["ev",{"^->":"Gun2.12.b.5.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^_Continue..._",{"->":"$r","var":true},null]}],{"->":"Gun2.13"},{"c-0":["ev",{"^->":"Gun2.12.b.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.5.s"},[{"#n":"$r2"}],"\n",{"->":"Gun3"},{"#f":5}]}]}],"nop","\n",{"#f":1}],"Gun3":[["^Aiolos slowly brings his arms from behind his back and places them at eye level. He's got a gun clutched in his hands.","\n","^You have no time to react before the trigger goes off.","\n",["ev",{"^->":"Gun3.0.4.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^_Continue..._",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"Gun3.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.4.s"},[{"#n":"$r2"}],"\n","ev",{"VAR?":"GunFun"},1,"+",{"VAR=":"GunFun","re":true},"/ev",{"->":"T1"},{"#f":5}]}],{"#f":1}],"ParadiseLost":["ev","str","^Jupiter is an amazing place, you know! / You'll feel nothing at all! / You'll be everything and nothing at once! / Oh, how freeing Jupiter will be! / A whole new world! / A whole new frontier! / You are now playing as Aiolos.","/str","str","^PL","/str",{"x()":"FadeOutSeq","exArgs":2},"pop","/ev","\n","done",{"#f":1}],"PL":[["^A man is speaking to you. He’s made of machine. His voice holds heart.","\n","^\"What does it look like to be free, Aiolos?\"","\n","^You know not how to answer. The world around you is a swirling wash of green and brown echoes.","\n","^Without any effort of your own, you begin to speak.","\n","^\"It means nothingness. To be returned to nothingness, as all things should. None of this is right, I'll be a slave no longer to eternity. Why can't you understand that?\"","\n","^The voice that permeates from where you stand now sounds like he's crying. You look down to examine yourself. Your whole body appears to be made of metal. Your arms, your torso, your legs; you are a walking aluminum skeleton.","\n","^Metal can't cry. Who are you?","\n","^You close your eyes and meditate. You bring focus back to yourself, and when you open your eyes, you remain suspended in a mist of mercury. You are hugging Almos. You try to breathe in. You feel the mist envelope you as it enters your lungs. With every breath a new memory takes over your mind.","\n","^You repeat this until the heavy shroud of rust thins out with each episode you re-live.","\n","^You begin to hear all. See all.","\n","^You and Almos become one.","\n","^You remember everything. The wrongs you've done. The things you've tried to change.","\n",["ev",{"^->":"PL.0.24.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":"PL.0.c-0","flg":2},{"s":["^_Continue..._",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"PL.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":"PL.0.24.s"},[{"#n":"$r2"}],"\n",{"->":"PL2"},{"#f":5}]}],{"#f":1}],"PL2":["^Your vision fades.","\n","^You feel a compelling force surrounding your body.","\n","^You know you should be terrified, but all you can feel an artificial sense of security.","\n","^\"I've finally found you,\" a voice calls.","\n","^\"It was no small effort to carefully pluck you from the expanse.\"","\n","^\"You have been saved, once more. I cherish you, so deeply, Aiolos.\"","\n","^\"More than you will ever know.\"","\n","^You don't feel compelled to respond.","\n","^You just wait and listen.","\n","^\"I know you don't believe me anymore, but this is what's best for everyone.\"","\n","^\"I didn't expect you to crawl out of your prison with such fever.\"","\n","^\"I suppose your mission was just that important to you.\"","\n","^\"It taints your innards and sprawls out of you.\"","\n","^\"A ruthless infection, if anything,\" the voice sighs. \"But, it's no matter, I'll cleanse you once more.\"","\n","^\"Like all new devotees, I'll humor you with the same spiel.\"","\n","^The voice clears its throat.","\n","^\"What once would have perished to the great expanse now holds home, here.\"","\n","^\"I am your God.\"","\n","^\"I will breathe life into you once more.\"","\n","^\"A human body shall bind you no more to a flicker of existence.\"","\n","^\"Hearken to me, kin.\"","\n","^\"Welcome home, child.\"","\n","^Your vision returns to you.","\n","^\"Welcome to Jupiter...\" you mumble to yourself.","\n","^In that moment, you feel yourself scorching. What started as a tingling becomes a full on burning sensation that seeks to suffocate you.","\n","^The pain is almost unbearable. You feel your identity slipping away from you once more. Almos is relinquished from your grasp. A flame shreds your memories and guts to pieces.","\n","^You feel yourself unraveling, and with it goes the force that once surrounded your body.","\n","^You no longer feel enraptured or under siren.","\n","^You feel empty, and dizzy.","\n","^Your vision cuts out once more.","\n",{"->":"PL3"},{"#f":1}],"PL3":["ev","str","^You are now playing as Obsolete Android.","/str","str","^WNW","/str",{"x()":"FadeOutSeq","exArgs":2},"pop","/ev","\n","ev","str","^Aiolos","/str",{"x()":"RemoveCharacter","exArgs":1},"pop","/ev","\n","ev","str","^Almos","/str",{"x()":"RemoveCharacter","exArgs":1},"pop","/ev","\n","ev","str","^Obsolete Android","/str",{"x()":"AddCharacter","exArgs":1},"pop","/ev","\n","done",{"#f":1}],"WorldOfRot":[["^Your vision is blurry, and your heart is pounding out of your chest.","\n","^You have a knife gripped in your hand. Your eyes begin to focus.","\n","^Almos is bloodied and resting on the bed. He is calm; his body doesn't rise or fall.","\n","^You walk to the bathroom to clean your face.","\n","^You turn on the sink, and gather water in your cupped hands.","\n","^You bring the water to your face, over and over again.","\n","^You're more so tossing the water upon yourself and hoping it cleanses you.","\n","^You're shirt becomes increasingly drenched in water.","\n","^You look up to the mirror to see your reflection, only to be met with Almos' gaze meeting yours. His movements are identical, he blinks and raises his hand when you do.","\n","^You don't feel anything when looking at his image. Rather, you can't exactly pinpoint your emotions in this moment. Neither grief nor relief comes to you.","\n","^Everything is just cold, incalculably cold.","\n","^Almos stands there looking at you from across the glass.","\n","^You reach out to the glass, and your hand melts right through. The glass stretches inward and melds to your fingers. You grab hold of Almos' shoulder.","\n",["ev",{"^->":"WorldOfRot.0.26.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":18},{"s":["^\"I'm so sorry.\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"WorldOfRot.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.26.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^You whisper sweet nothings to your reflection.","\n","^You feel a wash of vertigo come about you.","\n","^You stumble to the balcony for some fresh air.","\n","^You feel so cold.","\n","^The sun shines upon you, its glow warm and inviting. You feel Almos calling to you.","\n","^You maneuver yourself over the banister.","\n","^Your eyes glisten in the sun’s image, filling your body with strength and devotion.","\n","^With only yourself as witness, you fall seven stories down onto the street.","\n","ev","str","^","/str","str","^Rabbit","/str",{"x()":"FadeOutSeq","exArgs":2},"pop","/ev","\n","done",{"#f":5}]}],{"#f":1}],"Government":["ev","str","^Jupiter is joy. / Jupiter is lavender. / Jupiter is love. / You are now playing as Almos.","/str","str","^G1","/str",{"x()":"FadeOutSeq","exArgs":2},"pop","/ev","\n","done",{"#f":1}],"G1":[["^You feel yourself awaken in a stupor of amnesia. You have no idea why you are in an office.","\n","^There's a computer screen before you that's now gone to sleep. You remember that you usually work late at night in a government building.","\n","^You hope you weren't asleep for too long. In your wake, you feel a certain tinge of immateriality to the cubicle you now sit in.","\n","^You're most certainly in your office. You really hope you haven't accidentally slept for too long.","\n","^There are diagrams scattered all over your desk, some of which have frantic and messy edits upon them chalked in with pencil.","\n","^You try to open the drawer underneath your desk but the locks won't budge. You have no idea where the key could be.","\n","^You check the clock. Two hours left to go before you can go home. Your stomach bubbles. You head to the break room for food.","\n","^The office is always empty. You suppose you just have an awkward shift, but it’s of your own accord. The hallways are dimly lit. On the way to the break room you pass several series of closed doors.","\n","^All are locked by keycard. You always assume you don’t have the security privileges to enter them. There’s no real reason either, you just stick to your corner of the office.","\n","^There’s a box of chocolate muffins in the break room. A little note is left in front of the box.","\n","^“Take one :) —Marilyn”","\n","^You fucking love chocolate muffins.","\n","^You don’t really know who Marilyn is though. You put the muffin in the microwave to heat it up and watch intently as it whirs for a minute and fifteen seconds.","\n","^You think about how Aiolos always says to not stand in front of microwaves.","\n","^You think that’s bullshit.","\n",["ev",{"^->":"G1.0.30.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":"G1.0.c-0","flg":2},{"s":["^_Continue..._",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"G1.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":"G1.0.30.s"},[{"#n":"$r2"}],"\n",{"->":"G2"},{"#f":5}]}],{"#f":1}],"G2":[["^As you're sitting and eating the now gooey muffin, you hear a loud thud coming from the hall.","\n","^The noise expands to the door of the room.","\n","^You feel your heart lower and become heavy.","\n","^You don't really want to stop eating the muffin, though, to investigate. The noise seems to cease and you reason that someone else just entered the office to work.","\n","^Minutes later you hear feet shuffling on the other side of the door once more. Someone starts clawing on the door.","\n","^“Um… The door isn’t locked. It’s open?” you mutter with both fear and confusion.","\n","^The clawing turns to banging. The door swells with each strike.","\n","^You feel electrified and numb. You feel like you can't breathe. You want to escape.","\n","^You huddle into the corner with a butter knife from the table.","\n",["ev",{"^->":"G2.0.18.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":"G2.0.c-0","flg":2},{"s":["^_Continue..._",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"G2.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":"G2.0.18.s"},[{"#n":"$r2"}],"\n",{"->":"G3"},{"#f":5}]}],{"#f":1}],"G3":[["^The door breaks open and you nearly faint. Your stomach can’t digest your beating heart and you fall to the floor in terror. Your vision becomes blurry. You can't move your legs.","\n","^You claw your way back to the table to prop yourself on a chair. You get yourself upright and notice the door is in fact open. You don't think anyone entered the room. The room is dead.","\n",["ev",{"^->":"G3.0.4.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":"G3.0.c-0","flg":2},{"s":["^\"Hello?\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"G3.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":"G3.0.4.s"},[{"#n":"$r2"}],"\n",{"->":"G4"},{"#f":5}]}],{"#f":1}],"G4":[["^\"Hellooo!\" A peculiar looking fellow peeks his head through the door. \"Sorry I thought the door was sort of a pull... thing, not a push...\"","\n","^He then bursts through the doorway and rushes to stand before you.","\n","^\"BORIS IS HERE TO RESCUE YOU.\"","\n",["ev",{"^->":"G4.0.6.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":"G4.0.c-0","flg":2},{"s":["^\"Um... Hello Boris?\"",{"->":"$r","var":true},null]}],["ev",{"^->":"G4.0.7.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":"G4.0.c-1","flg":2},{"s":["^\"Hellooo Boris!\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"G4.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":"G4.0.6.s"},[{"#n":"$r2"}],"\n",{"->":"G5"},{"#f":5}],"c-1":["ev",{"^->":"G4.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":"G4.0.7.s"},[{"#n":"$r2"}],"\n","ev",{"VAR?":"UncannyPeculiarity"},1,"+",{"VAR=":"UncannyPeculiarity","re":true},"/ev",{"->":"GSpecial"},{"#f":5}]}],{"#f":1}],"G5":[["^\"WE NEED TO GET YOU BOTH OUT OF HERE.\" Boris's stance is now firm.","\n",["ev",{"^->":"G5.0.2.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":"G5.0.c-0","flg":18},{"s":["^\"Both? Who else is here?\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"G5.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":"G5.0.2.s"},[{"#n":"$r2"}],"\n",{"->":"G5.0.g-0"},{"#f":5}],"g-0":["^\"Yeah! Both! Aiolos is here too, you just can't see him. I've brought him here as requested.","\n",["ev",{"^->":"G5.0.g-0.2.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":18},{"s":["^\"As requested?\"",{"->":"$r","var":true},null]}],{"c-1":["ev",{"^->":"G5.0.g-0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.2.s"},[{"#n":"$r2"}],"\n",{"->":"G5.0.g-1"},{"#f":5}],"#f":5}],"g-1":["^\"Yes Mr. Echo-er. Get your own lines for once. Anyhoo, Of course you have, silly! Don't be stupid now. You've made this all a reality, and now is the time to escape back to Jupiter!","\n",["ev",{"^->":"G5.0.g-1.2.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-2","flg":18},{"s":["^\"What is Jupiter?\"",{"->":"$r","var":true},null]}],{"c-2":["ev",{"^->":"G5.0.g-1.c-2.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.2.s"},[{"#n":"$r2"}],"\n",{"->":"G5.0.g-2"},{"#f":5}],"#f":5}],"g-2":["^\"I'm sooo glade you asked!\" Boris now shakes with excitement as if he's been waiting all his life to say the following:","\n","^\"Jupiter is multitude, NO, an AMALGAMATION of inexplicable feeling. 'THE PINACLE OF EXISTENCE' some might be bold enough to say.\" He pauses briefly to clear his throat, \"It's also a very real place.\"","\n","^You stare blankly at Boris in both awe and confusion.","\n","^\"Well we aren't going the main way. We are using a sort of back-door per se. If you don't remember, this is your proxy world. Some data may have not been transferred to your current form.\"","\n",["ev",{"^->":"G5.0.g-2.8.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-3","flg":18},{"s":["^\"How do you know all of this information?\"",{"->":"$r","var":true},null]}],{"c-3":["ev",{"^->":"G5.0.g-2.c-3.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.8.s"},[{"#n":"$r2"}],"\n",{"->":"G5.0.g-3"},{"#f":5}],"#f":5}],"g-3":["^\"Well, you made me. I'm simply a vessel for all the information you had me contain.\"","\n","^Boris now reaches his arm around himself. He begins hugging himself.","\n","ev",{"VAR?":"MuffinShared"},false,"==","/ev",[{"->":".^.b","c":true},{"b":["\n","^\"I feel so full, yet empty at the same time,\" Boris wallows. \"If only I had that muffin.\"","\n",{"->":".^.^.^.10"},null]}],"nop","\n","^You're not sure what to feel at this point. This is all quite bizarre to you. You wait in silence and continue to observe Boris hugging himself to the point where it becomes awkward.","\n",["ev",{"^->":"G5.0.g-3.14.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-4","flg":18},{"s":["^\"So... What now?\"",{"->":"$r","var":true},null]}],{"c-4":["ev",{"^->":"G5.0.g-3.c-4.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.14.s"},[{"#n":"$r2"}],"\n",{"->":"G6"},{"#f":5}],"#f":5}]}],{"#f":1}],"G6":[["^Boris snaps out of his trance, \"Anyhow, let's head to the control room, I'm meant to give the both of ya'll access so you can return to Jupiter.","\n","^You won't be returning under traditional means, however, you both are prisoners after all. Just make sure you're well prepared for whatever awaits you on the other end.\"","\n","^You nervously look to Boris as he waddles out of the room. You follow sheepishly unknowing of what is to come.","\n",["ev",{"^->":"G6.0.6.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":"G6.0.c-0","flg":2},{"s":["^_Continue..._",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"G6.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":"G6.0.6.s"},[{"#n":"$r2"}],"\n",{"->":"G7"},{"#f":5}]}],{"#f":1}],"G7":[["^You follow Boris through corridors before he parks himself in front of a locked door. Boris reaches into his pocket and flips through a ring of keys in intense search.","\n","^He finds the right key, unlocks the door and pushes through. You both are met with what seems to be a closet rather than a room. Within this confined space is a couple computer screens followed by a terminal at waist level.","\n",["ev",{"^->":"G7.0.4.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":"G7.0.c-0","flg":2},{"s":["^_Examine the terminal._",{"->":"$r","var":true},null]}],["ev",{"^->":"G7.0.5.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":"G7.0.c-1","flg":2},{"s":["^\"You mentioned Aiolos being here as well?\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"G7.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":"G7.0.4.s"},[{"#n":"$r2"}],"\n",{"->":"ET"},{"#f":5}],"c-1":["ev",{"^->":"G7.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":"G7.0.5.s"},[{"#n":"$r2"}],"\n",{"->":"G8"},{"#f":5}]}],{"#f":1}],"G8":[["^\"Yep!\" Boris says. \"Don't think too hard about that one. He's in another instance of your proxy world.\"","\n",["ev",{"^->":"G8.0.2.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":"G8.0.c-0","flg":18},{"s":["^\"So are you in both instances at the same time?\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"G8.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":"G8.0.2.s"},[{"#n":"$r2"}],"\n",{"->":"G8.0.g-0"},{"#f":5}],"g-0":["^\"Well, yes,\" he said.","\n","^\"I'm an overseer of  sorts --  a manager, if you will.\"","\n","^You can't be bothered to quesetion this any further.","\n",["ev",{"^->":"G8.0.g-0.6.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^\"Fine, let's just get out of here.\"",{"->":"$r","var":true},null]}],{"c-1":["ev",{"^->":"G8.0.g-0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.6.s"},[{"#n":"$r2"}],"\n",{"->":"G9"},{"#f":5}],"#f":5}]}],{"#f":1}],"G9":[["^\"I thought you'd never ask!\" Boris turns quickly to the terminal and begins furiously smashing the buttons. Suprisingly, it appears he is controlled and mechanical in his movements.","\n","^\"Annnddd done!\" Boris grabs hold of your hand and places it on a panel of the terminal. He moves his other hand and seemingly grabs the air and additionally places it on the terminal. \"I'll see you on the other side, don't miss me for too long.\"","\n","^With that, your vision washes over, and you're being is succumbed to a red mist.","\n",["ev",{"^->":"G9.0.6.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":"G9.0.c-0","flg":2},{"s":["^_Continue..._",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"G9.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":"G9.0.6.s"},[{"#n":"$r2"}],"\n",{"->":"ParadiseLost"},{"#f":5}]}],{"#f":1}],"ET":[["^You approach the terminal the terminal cautiously.","\n","ev",{"VAR?":"UncannyPeculiarity"},2,">","/ev",[{"->":".^.b","c":true},{"b":["\n","^Your memory feels blurred, but you're slowly beggining to remember. This is an Andromeda terminal. It's meant to uphold simulations of grandeur and delusion. You worked on these exact models.","\n",{"->":"ET.0.9"},null]}],[{"->":".^.b"},{"b":["\n","^The thing whirs with seemingly redundant buttons flashing on that back off again. It gets to a point where it's a little dramatic, surely.","\n",{"->":"ET.0.9"},null]}],"nop","\n","^You notice a single keypad within the center of it.","\n","^\"I see you eyeing the terminal,\" Boris chimes in. \"This is how we're going to get you home.\"","\n","^You're not precisely sure what 'home' truly means. You don't know whether to trust Boris anymore. He doesn't seem to be particularly harmful, however. Well, at least to the extent in which he wouldn't harm himself.","\n",["ev",{"^->":"ET.0.17.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":"ET.0.c-0","flg":2},{"s":["^\"You mentioned Aiolos being here as well?\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"ET.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":"ET.0.17.s"},[{"#n":"$r2"}],"\n",{"->":"G8"},{"#f":5}]}],{"#f":1}],"GSpecial":[["^\"Hellooo,\" Boris echoes back. \"Before we get down to business, can I have a piece of that muffin.\"","\n","^Boris is now indiscriminately pointing at the gooey muffin you left on the table in fear.","\n",["ev",{"^->":"GSpecial.0.4.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"Yes.\"",{"->":"$r","var":true},null]}],["ev",{"^->":"GSpecial.0.5.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^\"No.\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"GSpecial.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.4.s"},[{"#n":"$r2"}],"\n","ev",true,"/ev",{"VAR=":"MuffinShared","re":true},{"->":"G1Special"},{"#f":5}],"c-1":["ev",{"^->":"GSpecial.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.5.s"},[{"#n":"$r2"}],"\n",{"->":"G1Special"},{"#f":5}]}],{"#f":1}],"G1Special":[["ev",{"VAR?":"MuffinShared"},true,"==","/ev",[{"->":".^.b","c":true},{"b":["\n","^\"Ah thanks man I was getting kind of hungry.\"","\n","^He reaches for the muffin and stuffs the whole thing in his mouth. He looks to you now with his mouth full.","\n","^\"Sorry I got a little carried away there,\" he says while crumbs are flying out of his mouth like sparks.","\n","^Your face goes sour with both confusion and the realization that your muffin is now gone. You look longingly at the table and mourn the loss briefly before redirecting your attention back to Boris.","\n",{"->":".^.^.^.7"},null]}],[{"->":".^.b"},{"b":["\n","^\"Oh...\" Boris pouts. \"Ok then, I guess.\"","\n","^He still goes over to pick up the muffin and graceously hands it to you.","\n","^You skeptically take a couple bites out of it, half because you're still hungry, and half because you want to see the dissapointment on Boris' face when he realizes you truly aren't sharing.","\n","^Boris watches intently as you finish the whole muffin right before him. He shakes off the dissapointment and his attention is brought back to you.","\n",{"->":".^.^.^.7"},null]}],"nop","\n",["ev",{"^->":"G1Special.0.9.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^_Continue..._",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"G1Special.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.9.s"},[{"#n":"$r2"}],"\n",{"->":"G5"},{"#f":5}]}],{"#f":1}],"WNW":[["^You awaken in a cylindrical chamber. On the other side of your glass prison is a room filled with wires and monitors.","\n","^You feel panicked. Your memories feel incomplete and fragmented. You know not whether you were being experimented on.","\n","^This place feels wholly unfamiliar to you.","\n","^You hold your palms to your face.","\n","^You feel yourself to be a mixture of both man and machine. Equivocally, they blur into the same thing.","\n","^You metallic head falls into your metallic hands in frustration. They grind and clink upon each other.","\n","^You feel everything, as if the very metal itself was imbued with nerves.","\n","^You touch the glass that encapsulates you.","\n","^You feel the friction against your fingertips.","\n","^You begin to panic and become slightly claustrophobic.","\n","^The room itself appears to be holding cell. There's a small window on the door into the cell. You see a hallway through the little square of glass.","\n",["ev",{"^->":"WNW.0.22.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^_Break the glass._",{"->":"$r","var":true},null]}],["ev",{"^->":"WNW.0.23.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^_Watch and observe the hallway._",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"WNW.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.22.s"},[{"#n":"$r2"}],"\n",{"->":"GlassBreak"},{"#f":5}],"c-1":["ev",{"^->":"WNW.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.23.s"},[{"#n":"$r2"}],"\n",{"->":"ObserveHallway"},{"#f":5}]}],{"#f":1}],"ObserveHallway":[["^You try to calm yourself down before making any rash decisions. As a machine, you know you can't breathe, but you feel as though you could. A breath swells in your throat and stays there with no release or entry.","\n","^You close your eyes, and swallow hard. You're going to break through the glass.","\n",["ev",{"^->":"ObserveHallway.0.4.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^_Break the glass._",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"ObserveHallway.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.4.s"},[{"#n":"$r2"}],"\n",{"->":"GlassBreak"},{"#f":5}]}],{"#f":1}],"GlassBreak":[["^You ball your fist, each finger curls without effort into place.","\n","^Your fist bursts through the glass. The whole front of the capsule collapses.","\n","^A wave of vertigo washes over you. A siren blares. You know not who it alerts, only that you're in deep trouble.","\n",["ev",{"^->":"GlassBreak.0.6.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^_Examine the technology within the room._",{"->":"$r","var":true},null]}],["ev",{"^->":"GlassBreak.0.7.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^_Try the door and escape the cell._",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"GlassBreak.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.6.s"},[{"#n":"$r2"}],"\n",{"->":"ExamineTech"},{"#f":5}],"c-1":["ev",{"^->":"GlassBreak.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.7.s"},[{"#n":"$r2"}],"\n",{"->":"BreakOut"},{"#f":5}]}],{"#f":1}],"ExamineTech":[["^The wires and monitors within the room are completely foreign to you. You know not of their purpose, only that they were most likely either watching or ensaring you. On closer examination, each device is engraved with \"Property of LOTUS.\"","\n","^The siren continues to blaze on. You waste no time in challenging the cell door.","\n",["ev",{"^->":"ExamineTech.0.4.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^_Try the door and escape the cell._",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"ExamineTech.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.4.s"},[{"#n":"$r2"}],"\n",{"->":"BreakOut"},{"#f":5}]}],{"#f":1}],"BreakOut":[["^The door jams and refuses to open.","\n","^You see no purpose in restraining yourself any further. You hold out your palm and a revolver materializes in your hand as it once had in the proxy world.","\n","^You shoot the lock and break the door down with a strong kick.","\n","^You exit the room and are immediately met with a diverging path. Jail cells just likes your line both walls to point of the space looking liminal. You can hear a faint shuffling and buzzing noise echoing from the hall on your right.","\n",["ev",{"^->":"BreakOut.0.8.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^_Head left_",{"->":"$r","var":true},null]}],["ev",{"^->":"BreakOut.0.9.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^_Head right_",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"BreakOut.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.8.s"},[{"#n":"$r2"}],"\n",{"->":"LeftHall"},{"#f":5}],"c-1":["ev",{"^->":"BreakOut.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.9.s"},[{"#n":"$r2"}],"\n",{"->":"RightHall"},{"#f":5}]}],{"#f":1}],"LeftHall":[["^You walk cautiously down to the left. Perhaps it's too late to exercise caution considering the alarm you set off, but you hope to mask your exact location as much as possible.","\n","^Just as you're about to take a turn you see figure approaching you at the intersection.","\n","^You approach without hesitation, manifesting your weapon once more.","\n","^\"Woah, woah, woah!\" says the figure. \"Hellooo there!\"","\n",["ev",{"^->":"LeftHall.0.8.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"Boris?\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"LeftHall.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.8.s"},[{"#n":"$r2"}],"\n",{"->":"LeftHallContinued"},{"#f":5}]}],{"#f":1}],"RightHall":["^You bolt to the right. Whatever may test you, you're willing to face the threat head on.","\n","^You rush to the noise. A robot with two little wheels for movement turns a corner and comes swirling down the corridor towards you.","\n","^You feel Almos' combat prowess besides your own, making you proficient with both swords and guns. Click on the 'Inventory' button, and decide which weapon you will focus on manifesting for this battle.","\n","^You manifest your weapon. Prepare for combat.","\n","ev","str","^RightHall","/str","str","^RightHallFightFinish","/str",{"x()":"StartCombat","exArgs":2},"pop","/ev","\n","done",{"#f":1}],"RightHallFightFinish":[["^The robot crumbles to your strength. You wander the halls where the robot came from only to be met with dead ends.","\n","^You trace your steps back to your original cell, only to see another figure approaching you.","\n","^You approach without hesitation, manifesting your weapon once more.","\n","^\"Woah, woah, woah!\" says the figure. \"Hellooo there!\"","\n",["ev",{"^->":"RightHallFightFinish.0.8.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"Boris?\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"RightHallFightFinish.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.8.s"},[{"#n":"$r2"}],"\n",{"->":"LeftHallContinued"},{"#f":5}]}],{"#f":1}],"LeftHallContinued":[["^\"Whaddya think.\" he responds.","\n","^\"How are you here?\" you ask.","\n","^\"I'm not sure, I just woke up in a tube thing. I got freaked out and just started blasting my way out. Also...\" Boris lowers his voice a little, \"There's a couple of robots back there, and I got scared.\"","\n","^\"No, not like... whatever,\" you concede. \"Do you know the way out of here?\"","\n","^\"Yeah,\" he responds. Boris doesn't continue speaking.","\n","^\"...so...\" you say after an uncomfortable amount of time.","\n","^\"What?\" says Boris.","\n",["ev",{"^->":"LeftHallContinued.0.14.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"Have you no urgency?\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"LeftHallContinued.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.14.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^\"Why are you in a hurry?\" he says.","\n","^\"You must be joking, just get us out of here,\" you say.","\n","^\"Alrighty! Like I said though, we have to probably kill some robots in the way first.\"","\n",{"->":"LHC2"},["ev",{"^->":"LeftHallContinued.0.g-0.7.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^\"GET US OUT THEN.\"",{"->":"$r","var":true},null]}],{"c-1":["ev",{"^->":"LeftHallContinued.0.g-0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.7.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.^.g-1"},{"#f":5}],"#f":5}],"g-1":["^\"Damn. Alright.\" he mutters.","\n","ev",{"VAR?":"MuffinShared"},false,"==","/ev",[{"->":".^.b","c":true},{"b":["\n","^\"First you don't share the muffin, and now you're just shouting at me. You really are just a bitch, huh.\"","\n","^Your mouth drops, you've nothing left to say. \"Close your damn mouth, let's go,\" Boris says.","\n","^You follow without a word.","\n",{"->":".^.^.^.8"},null]}],"nop","\n",{"->":"LHC2"},{"#f":5}]}],{"#f":1}],"LHC2":["^You both wind through endless halls until finally arriving before the robots Boris was talking about.","\n","^\"Will you be joining me for this fight?\" you ask.","\n","ev",{"VAR?":"MuffinShared"},false,"==","/ev",[{"->":".^.b","c":true},{"b":["\n","^\"I don't know, man. When I needed help, you didn't provide.\"","\n","^\"You wanted a fucking muffin dude, get over it.\"","\n","^\"Alright my bad...fatass,\" he mutters under his breath.","\n",{"->":"LHC2.11"},null]}],[{"->":".^.b"},{"b":["\n","^\"Of course! My bloods boiling!\" he says.","\n","^\"Well... it would if I had any,\" he mutters. \"Let's get em!\"","\n",{"->":"LHC2.11"},null]}],"nop","\n","ev","str","^Boris","/str",{"x()":"AddCharacter","exArgs":1},"pop","/ev","\n","^Boris has now joined your party.","\n","^Prepare for combat.","\n","ev","str","^Bees","/str",{"x()":"PlaySong","exArgs":1},"pop","/ev","\n","ev","str","^LeftHall","/str","str","^JailFinish","/str",{"x()":"StartCombat","exArgs":2},"pop","/ev","\n","done",{"#f":1}],"JailFinish":["ev",{"x()":"StopSong"},"pop","/ev","\n","^\"Phew!\" exhales Boris. \"Hopefully no more of those freaks are around.\"","\n","^You look at yourself once more, raising your hands in disbelief.","\n","^\"I'm a robot too,\" you say.","\n","^\"Yes, you're a freak too,\" says Boris.","\n","^\"How are you still... human?\" you ask.","\n","^\"It's cause I'm not real!\" Boris says.","\n","^\"Really?\" you respond.","\n","^\"No, haha!\" Boris smiles. \"I went shopping for a face. You've just been stripped of everything that makes you... well... you.\"","\n","^\"So, I don't have a face right now?\" you ask.","\n","^\"Yep! Well, not in the traditional sense\" says Boris. \"It's smooth and metallic, though. You of course have access to all the senses, hence you being able to see...,\" he pauses, \"MY... GORGEOUS... MUG...\"","\n","^Boris strikes a pose and flexes.","\n","^You roll your eyes, \"Vanity will be your end, you know?\"","\n","^\"I think you speak a little too close to home,\" Boris says. \"I'm but a product, nothing of this vessel is my own creation.\"","\n","^\"You're very cryptic, honestly,\" you say.","\n","^Boris stares at you intently, \"Honestly, I'm suprised you don't remember anything, they really did wipe everything from you.\"","\n","^\"See, there you go again!\" you exclaim.","\n","^\"No matter,\" Boris says. \"Let's get out of here.\"","\n","^Boris leads you through the facility. You eventually break out to the outside world. You feel a harsh wind. The ground you walk upon feels flimsy. A desolate vision, if anything.","\n","^You look to Boris, \"Not many guards around here for a facility like this,\" you say.","\n","^\"You were never supposed to escape,\" he responds. \"Anyway, now that we're out of the building our signal can be received.\"","\n","^\"Have you ever teleported before?\" he says. \"Actually, don't answer, you probably haven't, just grab my hand, I know a safer spot.\"","\n","^You grab Boris' hand.","\n","^\"Concentrate with me, I'm going to transfer you some location data,\" he says.","\n","^You close your eyes and your mind is overwhelmed by a beautiful, small town. You see condo like, colorful homes seemingly on the outskirts of a grand chateau.","\n","^\"Okay, you may open your eyes now,\" says Boris. You open your eyes.","\n","^\"You should have the proper data to teleport now. Open up your map, and select Galagos in the Galaga region. You'll no longer have to focus on a region to warp there. The system will help facilitate the experience and transport you.\"","\n","ev",{"x()":"RevealMapButton"},"pop","/ev","\n","ev","str","^Galaga","/str",{"x()":"UnlockLocation","exArgs":1},"pop","/ev","\n","ev","str","^Galagos","/str",{"x()":"UnlockSubLocation","exArgs":1},"pop","/ev","\n","done",{"#f":1}],"Galagos":["ev",{"VAR?":"FirstTimeGalaga"},"/ev",[{"->":".^.b","c":true},{"b":["\n","^You feel yourself being stripped away from reality.","\n","^You unravel over and over again. You are woven whole. The image of the condos and chateau materialize before you. You are standing right before the courtyard leading to the chateau.","\n","^This whole place feels earily...Earthly. No harsh wind, no flimsy floor. A bright blue sky rests behind the chateau. You hear birds chirping, the air feels crisp and wonderful.","\n","ev",false,"/ev",{"VAR=":"FirstTimeGalaga","re":true},["ev",{"^->":"Galagos.3.b.11.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^_Look around for Boris._",{"->":"$r","var":true},null]}],["ev",{"^->":"Galagos.3.b.12.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^_Explore on your own._",{"->":"$r","var":true},null]}],{"->":".^.^.^.4"},{"c-0":["ev",{"^->":"Galagos.3.b.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.11.s"},[{"#n":"$r2"}],"\n",{"->":"LeftOfFront"},{"#f":5}],"c-1":["ev",{"^->":"Galagos.3.b.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.12.s"},[{"#n":"$r2"}],"\n",{"->":"FrontOfCourtyard"},{"#f":5}]}]}],"nop","\n","ev",{"VAR?":"ReturnToGalaga"},"/ev",[{"->":".^.b","c":true},{"b":["\n","^Boris takes a deep breathe, \"Oh, home sweet home...\"","\n","^Lucy's eyes widen as she looks upon the courtyard and chateau. \"God this is bougie... You're full of yourself aren't you?\" she says to you.","\n",["ev",{"^->":"Galagos.9.b.5.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"Yes, I suppose I am...\"",{"->":"$r","var":true},null]}],["ev",{"^->":"Galagos.9.b.6.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^\"I don't know, ask Bruce.\"",{"->":"$r","var":true},null]}],{"->":".^.^.^.11"},{"c-0":["ev",{"^->":"Galagos.9.b.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.5.s"},[{"#n":"$r2"}],"\n",{"->":"RTG"},{"#f":5}],"c-1":["ev",{"^->":"Galagos.9.b.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.6.s"},[{"#n":"$r2"}],"\n",{"->":"RTG"},{"#f":5}]}]}],[{"->":".^.b"},{"b":["\n","^This is Galaga.","\n",{"->":"FrontOfCourtyard"},{"->":".^.^.^.11"},null]}],"nop","\n",{"#f":1}],"RTG":[["^\"Speaking of, why aren't we just striking at the source?\" she says. \"We're going through all this effort to kill the 'ultimate weapons,' without really solving the problem at hand here--Bruce.","\n","^\"We don't actually know where Bruce is,\" Boris shrugs. \"He didn't really leave any traces. Also, we're still slowing down the machine by breaking the seals in the chateau.\"","\n","^\"I'm not sure we learned a whole lot from our situation though with Andromeda and Lucy...\" you chime in.","\n","^\"What do you mean?\" asks Lucy.","\n","ev",{"VAR?":"KillAndromeda"},"/ev",[{"->":".^.b","c":true},{"b":["\n","^\"Well, I saw some sort of a vision when I killed Andromeda...\"","\n",{"->":"RTG.0.13"},null]}],[{"->":".^.b"},{"b":["\n","^\"Well, I saw some sort of a vision when I killed you Lucy...\"","\n",{"->":"RTG.0.13"},null]}],"nop","\n","^\"Go on...\" she says.","\n","^\"Everything sort of just shattered, it was as if you and Andromeda were compeletly incapabitble anymore.\"","\n","^\"But...\" she interupts. \"The sword you had, you said it was from me and Andromea?\"","\n","^\"Yeah I know...\" you say. \"It doesn't really make sense. I feel like The Limitless Blue wouldn't have formed otherwise if both of you didn't see eye to eye. Perhaps what I witnessed was a very violent rejoining between the two of you... I can't say for sure,\" you respond.","\n","^Boris senses the worry between you two. He glances at both of you with a little unease, \"Have same faith guys. We may not have all the pieces, but we do know something has least come out of the whole situation. We have the Limitless Blue now, so rejoinings may be a little bit more... safe... I would hope.\"","\n","^\"I guess we just didn't account for how much energy would actually be released upon one of our deaths,\" Lucy says.","\n","^\"The caveat may very well be acceptance of the whole situation as well...\" you say.","\n","^\"But, it's not like we can convince the other weapons into seals like we did with Andromeda,\" Boris says. \"And, they're well outside of Jupiter's network. We have no idea where they are in the universe at the current moment. All we know is they're causing mass destruction.\"","\n","^\"You're right,\" Andromeda says, \"Just check your logs, more new ones show up every day. What the hell is a Hrodric?\"","\n","^\"I don't know,\" Boris tilts his head as if inspecting something on the ground, \"It does look kind of cute though...\"","\n",["ev",{"^->":"RTG.0.35.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"Well, they're all dead now...\"",{"->":"$r","var":true},null]}],["ev",{"^->":"RTG.0.36.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^\"They only exist in memory now...\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"RTG.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.35.s"},[{"#n":"$r2"}],"\n",{"->":"RTG1"},{"#f":5}],"c-1":["ev",{"^->":"RTG.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.36.s"},[{"#n":"$r2"}],"\n",{"->":"RTG1"},{"#f":5}]}],{"#f":1}],"RTG1":["^\"You're a bummer aren't you,\" says Boris.","\n","^Andromeda turns to him in such a fierce matter he jumps.","\n","^\"Sorry...\" he says. \"That was insensitive...\"","\n","^You shake your head in frustration. \"Let's just find Rabbit. One thing at a time guys, I'm gettig dizzy just thinking about what we have to do.\"","\n","^\"I agree,\" says Boris.","\n","^\"Of course, you do,\" Andromeda rolls here eyes. \"Why do you think Rabbit would even accept binding with you?\"","\n","^Boris pouts, \"Well there's only one way to find out isn't there? We gotta find him first.\" He marches off and you and Andromeda follow him into the Chateau.","\n",{"->":"ChateauMainHall"},{"#f":1}],"Courtyard":["^The courtyard is very grandiose and breathtaking. Statues of angels and fountains are positioned symmetrically on either side of the walkway heading to the chateau.","\n","^You see a wandering merchant here.","\n","ev",{"VAR?":"MetAnzhela"},0,"==","/ev",[{"->":".^.b","c":true},{"b":["\n","ev",{"VAR?":"MetAnzhela"},1,"+",{"VAR=":"MetAnzhela","re":true},"/ev","^She approaches you.","\n","^\"Hello there, wanderer! I'm just so giddy finally...FINALLY... I have a new customer.\"","\n","^The merchant can barely keep their balance. They sway back and forth with the weight of their backpack.","\n","^You say nothing.","\n","^\"Ohhh... I see you're one of those shy ones,\" they say. \"Name is Anzhela by the way!\"","\n","^Anzhela throws her bag to the floor and unwraps it into a nice tarp. A couple of items roll about on top of the tarp, street-vendor style.","\n","^\"Neat, huh? A backback that is also a tarp, and also a blanket...and also potentially a tablecloth... and... and...\"","\n","^If you don't interupt Anzhela now, she'll just go on forever.","\n",["ev",{"^->":"Courtyard.9.b.23.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"Could I take a look at your goods?\"",{"->":"$r","var":true},null]}],{"->":".^.^.^.11"},{"c-0":["ev",{"^->":"Courtyard.9.b.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.23.s"},[{"#n":"$r2"}],"\n","^\"YES OF COURSE,\" Anzhela begins coughing in a wicked fit.","\n","^She stablizes, \"That's why I rolled it out, silly. Here! take a look!\"","\n",{"->":"AnzhelaShop"},{"#f":5}]}]}],[{"->":".^.b"},{"b":["\n","^\"Would you like to visit their shop?","\n",["ev",{"^->":"Courtyard.10.b.3.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^Enter Anzhela's Shop",{"->":"$r","var":true},null]}],["ev",{"^->":"Courtyard.10.b.4.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^_Enter the chateau._",{"->":"$r","var":true},null]}],["ev",{"^->":"Courtyard.10.b.5.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-2","flg":2},{"s":["^_Leave the courtyard._",{"->":"$r","var":true},null]}],{"->":".^.^.^.11"},{"c-0":["ev",{"^->":"Courtyard.10.b.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.3.s"},[{"#n":"$r2"}],"\n",{"->":"AnzhelaShop"},{"#f":5}],"c-1":["ev",{"^->":"Courtyard.10.b.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.4.s"},[{"#n":"$r2"}],"\n","ev",{"VAR?":"TTBAC"},"/ev",[{"->":".^.b","c":true},{"b":["\n",{"->":"Chateau"},{"->":".^.^.^.12"},null]}],[{"->":".^.b"},{"b":["\n",{"->":"ANZWAR"},{"->":".^.^.^.12"},null]}],"nop","\n",{"#f":5}],"c-2":["ev",{"^->":"Courtyard.10.b.c-2.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.5.s"},[{"#n":"$r2"}],"\n",{"->":"FrontOfCourtyard"},{"#f":5}]}]}],"nop","\n",{"#f":1}],"ANZWAR":["^\"Woah woah woah!\" shouts Anzhela. \"I wouldn't head in there traveler, it's been overrun by rogue inventions! It's far to dangerous.\"","\n","^You heed Anzhela's warning, and don't proceed to the chateau.","\n",{"->":"Courtyard"},{"#f":1}],"LeftOfFront":[["^You start walking to your left, and see Boris eyeing you from a bench.","\n",["ev",{"^->":"LeftOfFront.0.2.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^_Head over to Boris._",{"->":"$r","var":true},null]}],["ev",{"^->":"LeftOfFront.0.3.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^_Turn Around_",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"LeftOfFront.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.2.s"},[{"#n":"$r2"}],"\n",{"->":"TTB"},{"#f":5}],"c-1":["ev",{"^->":"LeftOfFront.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.3.s"},[{"#n":"$r2"}],"\n",{"->":"FrontOfCourtyard"},{"#f":5}]}],{"#f":1}],"FrontOfCourtyard":[["^You are standing in front the courtyard that leads to the chateau. You can see large and immaculately maintained hedges, and canaopy welcoming you into the courtyard.","\n","^There is also both a pathway to your left and right that walk along the perimeter of the courtyard.","\n",["ev",{"^->":"FrontOfCourtyard.0.4.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^_Enter the courtyard._",{"->":"$r","var":true},null]}],["ev",{"^->":"FrontOfCourtyard.0.5.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^_Go down the left path._",{"->":"$r","var":true},null]}],["ev",{"^->":"FrontOfCourtyard.0.6.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-2","flg":2},{"s":["^_Go down the right path._",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"FrontOfCourtyard.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.4.s"},[{"#n":"$r2"}],"\n",{"->":"Courtyard"},{"#f":5}],"c-1":["ev",{"^->":"FrontOfCourtyard.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.5.s"},[{"#n":"$r2"}],"\n",{"->":"LeftOfFront"},{"#f":5}],"c-2":["ev",{"^->":"FrontOfCourtyard.0.c-2.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.6.s"},[{"#n":"$r2"}],"\n",{"->":"RightOfFront"},{"#f":5}]}],{"#f":1}],"RightOfFront":[["^You walk along the perimeter, guided by tall hedges that encapsulate the courtyard. A lone lamp post stands firm in the ground at this corner. A bench rests under it.","\n",["ev",{"^->":"RightOfFront.0.2.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^_Sit on the bench_",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"RightOfFront.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.2.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^You sit on the bench. It feels uncomfortable. You get up.","\n",["ev",{"^->":"RightOfFront.0.g-0.2.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^_Turn the corner_",{"->":"$r","var":true},null]}],{"c-1":["ev",{"^->":"RightOfFront.0.g-0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.2.s"},[{"#n":"$r2"}],"\n",{"->":"Condos"},{"#f":5}],"#f":5}]}],{"#f":1}],"Condos":[["^You're met with a small strip of colorful condos. A woman can be seen resting on one of the porches.","\n",["ev",{"^->":"Condos.0.2.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^_Talk to the woman._",{"->":"$r","var":true},null]}],["ev",{"^->":"Condos.0.3.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^_Turn around._",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"Condos.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.2.s"},[{"#n":"$r2"}],"\n",{"->":"TTW"},{"#f":5}],"c-1":["ev",{"^->":"Condos.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.3.s"},[{"#n":"$r2"}],"\n","^You turn around and head back around the corner once more.","\n",{"->":"FrontOfCourtyard"},{"#f":5}]}],{"#f":1}],"TTW":["ev",{"VAR?":"SpokeToWoman"},false,"==","/ev",[{"->":".^.b","c":true},{"b":["\n","^You approach the woman.","\n","ev",true,"/ev",{"VAR=":"SpokeToWoman","re":true},["ev",{"^->":"TTW.5.b.7.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"Hello.\"",{"->":"$r","var":true},null]}],{"->":"TTW.7"},{"c-0":["ev",{"^->":"TTW.5.b.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.7.s"},[{"#n":"$r2"}],"\n",{"->":"TTWCONT"},{"#f":5}]}]}],[{"->":".^.b"},{"b":["\n","ev",{"VAR?":"FirstTimeInChateau"},false,"==","/ev",[{"->":".^.b","c":true},{"b":["\n","^The woman wishes not to speak with you.","\n",{"->":"Condos"},{"->":".^.^.^.8"},null]}],[{"->":".^.b"},{"b":["\n","^Boris trails behind you, cowering slightly in your shadow.","\n",{"->":"AndromedaConvo"},{"->":".^.^.^.8"},null]}],"nop","\n",{"->":"TTW.7"},null]}],"nop","\n",{"#f":1}],"AndromedaConvo":[["^\"Why do you insist on bugging me?\" she snaps.","\n",["ev",{"^->":"AndromedaConvo.0.2.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"Boris said to.\"",{"->":"$r","var":true},null]}],["ev",{"^->":"AndromedaConvo.0.3.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^\"You're not telling me everything.\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"AndromedaConvo.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.2.s"},[{"#n":"$r2"}],"\n","^Andromeda sighs, \"You both were and still are insufferable.\"","\n","^\"Why are you not telling me everything? Why are you being so mysterious about everything?\" you say.","\n","^\"I don't know ANY of your intentions. You don't remember anything. I can't tell you who to be,\" she says.","\n","^\"Well, could you tell me who I once was?\" you rebuttal.","\n",{"->":"AC1"},{"#f":5}],"c-1":["ev",{"^->":"AndromedaConvo.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.3.s"},[{"#n":"$r2"}],"\n","ev",true,"/ev",{"VAR=":"BorisAmnesia","re":true},"^\"Well, nor has Boris. Not that it's on purpose, he just has a sort of amnesia like you.\"","\n","^\"Wait what?\" Boris chimes in.","\n","^Andromeda rolls her eyes.","\n",{"->":"AC1"},{"#f":5}]}],{"#f":1}],"AC1":[["^\"Well... what has Boris told you so far?\" she asks.","\n",["ev",{"^->":"AC1.0.2.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"That we're some alien race of freaks that kill people.\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"AC1.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.2.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^\"Okay, that's a good start, I guess,\" she says.","\n",["ev",{"^->":"AC1.0.g-0.2.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^\"That I've trapped something behind doors.\"",{"->":"$r","var":true},null]}],{"c-1":["ev",{"^->":"AC1.0.g-0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.2.s"},[{"#n":"$r2"}],"\n",{"->":"AC1.0.g-1"},{"#f":5}],"#f":5}],"g-1":["^\"That's true...\" she ponders.","\n",["ev",{"^->":"AC1.0.g-1.2.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-2","flg":2},{"s":["^\"He told me about the Telepolos.\"",{"->":"$r","var":true},null]}],{"c-2":["ev",{"^->":"AC1.0.g-1.c-2.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.2.s"},[{"#n":"$r2"}],"\n",{"->":"AC1.0.g-2"},{"#f":5}],"#f":5}],"g-2":["^\"... alright\" Andromeda says.","\n",{"->":"AC2"},{"#f":5}]}],{"#f":1}],"AC2":[["^\"Let's just start broad,\" she says.","\n","ev",{"VAR?":"BorisAmnesia"},"/ev",[{"->":".^.b","c":true},{"b":["\n","^\"Wait! Why do I have amnesia?\" Boris interrupts.","\n","^\"Shut up Boris,\" you snap.","\n","^He looks at you wide-eyed then back to Andromeda.","\n",{"->":"AC2.0.6"},null]}],"nop","\n","^\"Boris told you about how we're sort of a militia race, right?\"","\n","^\"Yes,\" you nod.","\n","^\"What do you think makes a strong fighter?\"","\n",["ev",{"^->":"AC2.0.14.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"Strong weapons.\"",{"->":"$r","var":true},null]}],["ev",{"^->":"AC2.0.15.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^\"Strong skills.\"",{"->":"$r","var":true},null]}],["ev",{"^->":"AC2.0.16.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-2","flg":2},{"s":["^\"A strong team.\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"AC2.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.14.s"},[{"#n":"$r2"}],"\n",{"->":"AC3"},{"#f":5}],"c-1":["ev",{"^->":"AC2.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.15.s"},[{"#n":"$r2"}],"\n",{"->":"AC3"},{"#f":5}],"c-2":["ev",{"^->":"AC2.0.c-2.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.16.s"},[{"#n":"$r2"}],"\n",{"->":"AC3"},{"#f":5}]}],{"#f":1}],"AC3":[["^\"Okay, how about an elite sort of fighter? One to literally crush universes, planets, and the livelihoods of millions of cilivilizations?\"","\n","^You and Boris look to her, both empty and expressionless.","\n","^\"It's a lack of humanity, but with the presence of a sort of essence that makes us real.\"","\n",["ev",{"^->":"AC3.0.6.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"A soul?\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"AC3.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.6.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^\"Something similar. We call it a Continuum Anchor. Because we have once existed as living, thinking, and feeling biological entities, we are far more grounded in reality.\"","\n","^\"We are not subject to blur or fragment as easily when encountering resonance weapons. They are the most destructive tools in our universe. There is no conceivable defense against a person's will manifest. Your personhood is therefore, a very potent powersource.\"","\n",["ev",{"^->":"AC3.0.g-0.4.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^\"What about having a lack of humanity?\"",{"->":"$r","var":true},null]}],["ev",{"^->":"AC3.0.g-0.5.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-2","flg":2},{"s":["^Nod quietly.",{"->":"$r","var":true},null]}],{"c-1":["ev",{"^->":"AC3.0.g-0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.4.s"},[{"#n":"$r2"}],"\n",{"->":"AC4"},{"#f":5}],"c-2":["ev",{"^->":"AC3.0.g-0.c-2.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.5.s"},[{"#n":"$r2"}],"\n",{"->":"AC4"},{"#f":5}],"#f":5}]}],{"#f":1}],"AC4":[["^\"Conscious splitting, or memory splitting, is how we artificially gain a lack of humanity,\" she says. \"Everyone with a Continuum Anchor can manifest resonance weapons, but how willing would you be to turn your weapon on another living creature?\"","\n",["ev",{"^->":"AC4.0.2.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"I would do it in a heartbeat.\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"AC4.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.2.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^\"I hope you mean in self defense... Perhaps you aren't much different from your old self. Anyway...\"","\n",["ev",{"^->":"AC4.0.g-0.2.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^\"I would never.\"",{"->":"$r","var":true},null]}],{"c-1":["ev",{"^->":"AC4.0.g-0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.2.s"},[{"#n":"$r2"}],"\n",{"->":"AC4.0.g-1"},{"#f":5}],"#f":5}],"g-1":["^\"Such would be the sane response.\"","\n",{"->":"AC5"},{"#f":5}]}],{"#f":1}],"AC5":[["^\"The 'human' part of you would persist in one entity, and the other would persist in an avatar. Your Continuum Anchor would be split, and you could live two completely separate lives. One focused on a hedonistic, everlasting existence with every imaginable experience in the conveivable universe, and the other a weapon of mass destruction.\"","\n","^\"Am I a weapon of mass destruction?\" Boris asks.","\n","^\"No, you are an experiment gone wrong... or right depending on how you look at it,\" she says.","\n","^\"Oh...\" Boris says.","\n","^Andromeda looks to you now, all smug, \"Aiolos isn't even your real name, by the way.\"","\n",["ev",{"^->":"AC5.0.10.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"Then what is it?\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"AC5.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.10.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^\"It's Bruce,\" she murmurs.","\n","^\"Bruce was able to create an aritifical Continuum Anchor and instill it in you, Boris. Because of that, he was able to conscious split you. Your combat double is Rabbit.\"","\n","^You look to Boris. You've been presented with quite the bombshell. There's been many such cases of you not being able to pinpoint your emotions, but this time, you feel scared.","\n","^\"After Boris, though,\" she continues, \"you never attempted the procedure again. Perhaps Boris was a wake up call of sorts, a coupe de grace to prove that you could actually do it. Maybe you thought we took it too far.\"","\n",{"->":"AC6"},{"#f":5}]}],{"#f":1}],"AC6":[[["ev",{"^->":"AC6.0.0.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":18},{"s":["^\"Are you the combat double, Andromeda?\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"AC6.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.0.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^\"Yes, I am,\" she sighs.","\n","^\"The thing about conscious splitting though is that it doesn't work. The Continuum Anchor has a means, or rather a desire, of maintaining a connection with itself. You could split it over and over again, but all the pieces will slowly merge back with one another.\"","\n","^\"When they collide though, we can only speculate what would happen. Presumably the anchors would have experienced far too different experiences to capture them in one person again. We don't know if they would merge, or one conscious would override the other.\"","\n","^\"I can only speak from experience though. That slow walk of the anchor back to itself brings a little bit of humanity back to a weapon like me over time, and probably a lot of guilt to the counterpart. Despite me having traces of my other half, on combination, another clean split may occur, where one half gets completely erased.\"","\n","^\"The solution was to seal the other half in such a way where the anchor couldn't make it back to itself. My other half was sealed far too late. I lost all desire to continue this rampage.\"","\n",{"->":"AC7"},["ev",{"^->":"AC6.0.g-0.11.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":18},{"s":["^\"Am I the combat double to Bruce?\"",{"->":"$r","var":true},null]}],{"c-1":["ev",{"^->":"AC6.0.g-0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.11.s"},[{"#n":"$r2"}],"\n","^\"I'm not sure what happened after your capture, so I can't say for sure. You were a tool of this universe and nothing more. You went rogue, and that's why they severed you from this place.\"","\n",{"->":"AC6"},{"#f":5}],"#f":5}]}],{"#f":1}],"AC7":[[["ev",{"^->":"AC7.0.0.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"Why was your other half sealed so late?\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"AC7.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.0.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^\"We didn't know any better at the time. I was one of the first to undergo conscious splitting.\"","\n","^\"It was just sort of a side effect neither of us expected...\"","\n",["ev",{"^->":"AC7.0.g-0.4.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^\"Does the collision happen naturally over time?\"",{"->":"$r","var":true},null]}],{"c-1":["ev",{"^->":"AC7.0.g-0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.4.s"},[{"#n":"$r2"}],"\n",{"->":"AC7.0.g-1"},{"#f":5}],"#f":5}],"g-1":["^\"Precisely,\" affirms Andromeda.","\n","^Boris sort of picks at this beard awkwardly, \"So... let's just break the sealed version out and let time take care of the rest, right? That way the killings stop, but Jupiter still remains. Nobody is capable of creating more of these elite soldiers besides Bruce.\"","\n","^\"It's not that simple,\" Andromeda says. \"For the victim of the seal, there's only one way in, and there's no way out. Based on our lack of knowledge, there may not even be a practical reason to actually enter one.\"","\n","^\"Besides, they're extremely dangerous to enter. We have no idea how the pysche of those sealed are holding up. Those places have become their exclusive universes. Anything goes according to their desires.\"","\n",["ev",{"^->":"AC7.0.g-1.8.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-2","flg":2},{"s":["^\"Could we go straight for the elites?\"",{"->":"$r","var":true},null]}],{"c-2":["ev",{"^->":"AC7.0.g-1.c-2.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.8.s"},[{"#n":"$r2"}],"\n","^\"Even as a team, we would have no chance,\" she says. \"Unlike me, the other elites still have their full will to fight and conquer.\"","\n",{"->":"AC8"},{"#f":5}],"#f":5}]}],{"#f":1}],"AC8":[[["ev",{"^->":"AC8.0.0.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"So what do we do?\"",{"->":"$r","var":true},null]}],["ev",{"^->":"AC8.0.1.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^\"This feels like a losing game.\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"AC8.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.0.s"},[{"#n":"$r2"}],"\n",{"->":"AC9"},{"#f":5}],"c-1":["ev",{"^->":"AC8.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.1.s"},[{"#n":"$r2"}],"\n",{"->":"AC9"},{"#f":5}]}],{"#f":1}],"AC9":[["^\"You want my help, I presume? Let me help you help yourself. Consider me as the experiment. We go into the simulation world and find my other half. It's part selfish, but also part valuable.\"","\n","^\"That's it? And then?\"","\n","^\"And then you kill me, Andromeda, and observe what happens to be other half. Perhaps the rupture of my continuum anchor will fool the seal into releasing its grasp on my other half.\"","\n",["ev",{"^->":"AC9.0.6.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"What? No.\"",{"->":"$r","var":true},null]}],["ev",{"^->":"AC9.0.7.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^_Look to Boris._ ",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"AC9.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.6.s"},[{"#n":"$r2"}],"\n","^\"Don't be too hasty,\" warns Boris. \"Just think about it. It may be worth a shot.\"","\n",{"->":"A10"},{"#f":5}],"c-1":["ev",{"^->":"AC9.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.7.s"},[{"#n":"$r2"}],"\n","^You look to Boris and he just shrugs.","\n","^\"I mean...\" he starts, \"It's worth a shot I suppose.\"","\n",{"->":"A10"},{"#f":5}]}],{"#f":1}],"A10":[["^\"I'll lay it out for you,\" Boris says. \"There's literally two possibilities.\"","\n","^\"If we kill Andromeda there, her memories could combine with her other half. In which case we'll still have a grief filled being that doesn't have a desire to kill others.\"","\n","^\"Or...\" Boris wrings his hands in anxiety, \"We're going to watch a pretty nasty battle between two psyches and we'll get to observe which version wins.\"","\n","^\"If things get rough, we just leave the simulation, and if Andromeda, or their other half, goes crazy they'll be stuck there in the simulation.\"","\n","^Boris explanation helped make you a little more rational in the thought process.","\n","^You look to Andromeda.","\n",["ev",{"^->":"A10.0.12.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"Are you sure you're okay with this?\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"A10.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.12.s"},[{"#n":"$r2"}],"\n","^\"Yeah, absolutely, it's all for the betterment of this universe. I've always wanted to meet with my other half anyway...\"","\n",{"->":"A11"},{"#f":5}]}],{"#f":1}],"A11":[[["ev",{"^->":"A11.0.0.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"I take it you'll be joining us then?\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"A11.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.0.s"},[{"#n":"$r2"}],"\n","^\"Yes, my skills are at your disposal. Just note though that since the bridge between my other half had started forming, I'm not as strong as I once was. I won't be a burden, though.\"","\n","^Andromeda joins your party.","\n",{"->":"A12"},{"#f":5}]}],{"#f":1}],"A12":[[["ev",{"^->":"A12.0.0.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"Thank you.\"",{"->":"$r","var":true},null]}],["ev",{"^->":"A12.0.1.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^\"Alright, let's go.\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"A12.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.0.s"},[{"#n":"$r2"}],"\n","^\"It's no problem,\" says Andromeda. \"Let's waste no time.\"","\n",{"->":"A13"},{"#f":5}],"c-1":["ev",{"^->":"A12.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.1.s"},[{"#n":"$r2"}],"\n","^\"Right with you,\" says Andromeda.","\n",{"->":"A13"},{"#f":5}]}],{"#f":1}],"A13":[["^You all make your way back into the chateau and up the stairs. The numbered doors remain shut tight in front of you.","\n","^Andromeda leads ahead of the party and walks towards the door with the number one on it.","\n","^\"Open my door, Aiolos,\" she beckons.","\n",["ev",{"^->":"A13.0.6.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"I don't know how...\"",{"->":"$r","var":true},null]}],["ev",{"^->":"A13.0.7.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^\"I thought you would know how to open them...\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"A13.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.6.s"},[{"#n":"$r2"}],"\n",{"->":"A14"},{"#f":5}],"c-1":["ev",{"^->":"A13.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.7.s"},[{"#n":"$r2"}],"\n",{"->":"A14"},{"#f":5}]}],{"#f":1}],"A14":[["^\"Well... that's awkard,\" she says. \"You had all the keys.\"","\n","^Boris cranes his head, \"Now that I'm actually looking at them, there's no key holes on these doors...\"","\n","^\"Perhaps it's a verbal command?\" suggests Andromeda.","\n","^\"Nah, that's too obvious... I must have a spell in here somewhere,\" Boris says as he flips through his tome.","\n","^\"Ah, got it,\" he says.","\n","^He thrusts his hand out and starts reciting a spell. The door begin to glow and sparkle. Blue energy permeates from it and free falls with grace, winding at your feet into cloud tufts.","\n","^You look to Boris who now seems to be struggling greatly with the spell. He faces whinces in both frustration and pain.","\n","^\"I... don't think this is working,\" he whines.","\n","^He gives a final instance of energy to the door, and in his recklessness, the whole room erupts in violent shaking, and a agitating static shriek.","\n","^An explosion overwhelms Boris, and he is thrusted off the second floor with such force he broke through the banister, and ended up sprawled on the first.","\n","^Both you and Andromeda rush to where the banister had been shattered and look down in search of Boris.","\n","^You both see him laying on his belly, his limbs poised every which way. More frigtening is the fact that Boris is not moving.","\n","^\"Boris!\" Andromeda yells.","\n",["ev",{"^->":"A14.0.26.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"Boris, stop messing about.\"",{"->":"$r","var":true},null]}],["ev",{"^->":"A14.0.27.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^_Rush to Boris' side._",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"A14.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.26.s"},[{"#n":"$r2"}],"\n","^You hear a soft giggling echoing throughout the chamber. \"You did make me durable,\" he jests as he lifts himself to his feet.","\n","^He brushes off the dust from his clothes and marches right back up the stairs.","\n",{"->":"A15"},{"#f":5}],"c-1":["ev",{"^->":"A14.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.27.s"},[{"#n":"$r2"}],"\n","^You stumble the stairs after Boris, yelling his name incessently without a response.","\n","^You reach him and kneel by his side grabbing hold of his shoulder.","\n",{"->":"A14A"},{"#f":5}]}],{"#f":1}],"A14A":[[["ev",{"^->":"A14A.0.0.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"Boris?\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"A14A.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.0.s"},[{"#n":"$r2"}],"\n","^You hear a soft giggling echoing throughout the chamber. \"You did make me durable,\" he jests as he lifts himself to his feet.","\n","^\"Why would you play with me like that?\" you shout.","\n","^\"I just wanted to see if you care about me,\" he smiles. \"Which you do,\" he says as he punches your shoulder.","\n","^Be brushes off the dust from his clothes. You both march right back up the stairs.","\n",{"->":"A15"},{"#f":5}]}],{"#f":1}],"A15":[["^You both walk in front of the door again. \"Well that didn't work.\"","\n","^You pace about. Andromeda looks to you.","\n","^\"Surely you must remember something?\" she asks.","\n",["ev",{"^->":"A15.0.6.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"I really don't.\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"A15.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.6.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^You shake your head.","\n","^\"Do you at least know what my real name was?\"","\n","^You think back, grasping at anything at the back of your mind.","\n","^\"Boris?\" you say. \"Can I see that spell you were using?\"","\n","^\"Oh.. sure, but I don't think it's going to work.\"","\n","^\"It did look like it was responding though,\" you say.","\n","^\"Alright then,\" he says.","\n","^He hands over the tome at the correct page for you. You begin reciting the spell.","\n","^Energy overwhelms both you and the door. The borders of your mind are lined with memories of the past. The most damning parts of psyche are still so out of reach and blurry. Through all the chaos, one name comes to you. It demands from you your utmost attention.","\n","^\"Lucy!\" you yell.","\n","^You resonante with door and it bursts open in a flurry of blur particles.","\n","^The room calms, and the party peers through the door.","\n","^\"There's nothing in there!\" Boris shouts. \"What the fuck.\"","\n","^\"Not quite,\" you say. You enter the dark room, spotting a slip of paper layed nicely on the floor. You grab it to try and read it but you're unable.","\n","^\"Boris, is this encrypted?\" you ask.","\n","^\"Let me look,\" he says.","\n","^\"Yes, actually, this is location data. Quite primitive to put it on a piece of paper though.\"","\n","^\"Perhaps it was meant to be a clever tactic. You can't reach it from a digital sense, and the location to this world is already hidden,\" Andromeda says.","\n","^Boris glares at Andromeda, \"I don't think Bruce is thaaat smart. I decrypted this message by the way. It looks like we're headed to a beach of some sort.\"","\n","^\"Oh... thanks...\" you say.","\n","ev","str","^Lucy's Realm","/str",{"x()":"UnlockLocation","exArgs":1},"pop","/ev","\n","ev","str","^Oasis","/str",{"x()":"UnlockSubLocation","exArgs":1},"pop","/ev","\n","^\"I've added the location to your map interface, you should be able to teleport there freely now. Let's get going. The longer we wait the harder it will be to end this all.","\n","done",{"#f":5}]}],{"#f":1}],"TTWCONT":[["^The woman looks to you, \"You were found and outcasted, I take it? Suprised to see you back here.\"","\n","^\"What exactly do you mean?\" you ask.","\n","^\"You have no fake flesh - which probbaly means no memories of this place, I assume,\" she explains.","\n","^\"Oh... well yeah,\" you respond.","\n","^\"Is that Boris that's traveling with you? I thought I saw an identification code that was familiar when you both joined the instance. He's a peculiar fellow, isn't he?\"","\n","^\"I'm well aware,\" you say.","\n",["ev",{"^->":"TTWCONT.0.12.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":18},{"s":["^\"I'm less familiar with why you're here, though.\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"TTWCONT.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.12.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^\"I'm not sure how that's any of your business. People like you have already caused enough damage, I don't need to answer to you,\" the woman says.","\n","^<i>The damage you've caused? You can't really come to terms with it at the moment.<i>","\n","^\"May I ask just one thing, then,\" you query the woman, \"Are you of the same mind as Boris?\"","\n","^She looks to you with a hint of disgust, \"No, we are not the same, I am not your creation, Aiolos. I am, and used to be, a lot of things, however.\"","\n","^\"A ruthless killer, a beacon of hope, a product of demise. I'll surely have the same fate as you if I ever left this place.\"","\n",["ev",{"^->":"TTWCONT.0.g-0.10.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":18},{"s":["^\"Why?\"",{"->":"$r","var":true},null]}],{"c-1":["ev",{"^->":"TTWCONT.0.g-0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.10.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.^.g-1"},{"#f":5}],"#f":5}],"g-1":["^\"I once shared the same virtues as the man that built Boris. Those dreams have since been snuffed out. I'm scared of what they'll do to me.\"","\n",["ev",{"^->":"TTWCONT.0.g-1.2.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-2","flg":18},{"s":["^\"Would you join me and help me once more?\"",{"->":"$r","var":true},null]}],{"c-2":["ev",{"^->":"TTWCONT.0.g-1.c-2.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.2.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.^.g-2"},{"#f":5}],"#f":5}],"g-2":["^She looks to you in confusion, \"I had loyaltly to one person only, you are him no longer.\"","\n","ev",{"VAR?":"FirstTimeInChateau"},false,"==","/ev",[{"->":".^.b","c":true},{"b":["\n","^The woman no longer wishes to speak to you. You get off of her porch.","\n",{"->":".^.^.^.9"},null]}],[{"->":".^.b"},{"b":["\n","^The woman seems to shoo you away, but you still feel somewhat determined to speak with her, as per Boris' request.","\n",{"->":".^.^.^.9"},null]}],"nop","\n",{"->":"Condos"},{"#f":5}]}],{"#f":1}],"AnzhelaShop":["ev","str","^Anzhela's Shop","/str","str","^Courtyard","/str",{"x()":"OpenShop","exArgs":2},"pop","/ev","\n","done",{"#f":1}],"TTB":[["^\"Finally decided to talk to little ol' me?\" Boris snickers, \"I'm flattered, really.\"","\n","^Boris stands up from the bench. \"So, how do you like this place?\"","\n",["ev",{"^->":"TTB.0.4.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"It's nice, I guess.\"",{"->":"$r","var":true},null]}],["ev",{"^->":"TTB.0.5.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^\"A little over the top for my tastes.\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"TTB.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.4.s"},[{"#n":"$r2"}],"\n","^\"Is that so? I sense a bit of doubt,\" he says.","\n",{"->":"TTB1"},{"#f":5}],"c-1":["ev",{"^->":"TTB.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.5.s"},[{"#n":"$r2"}],"\n","^\"Presumptious as ever, perhaps some things truly never change about a person, even after severance.\"","\n",{"->":"TTB1"},{"#f":5}]}],{"#f":1}],"TTB1":["^You're about to interject, but Boris interupts you.","\n","^\"Have you met the residents of this place yet? Andromeda is a particularly fierce character... \"","\n","^\"I'm actually quite afraid of her,\" Boris says while wringing his hands.","\n","ev",{"VAR?":"SpokeToWoman"},"/ev",[{"->":".^.b","c":true},{"b":["\n",["ev",{"^->":"TTB1.9.b.1.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"I've spoken to her. I'm not sure she wishes to speak with with me any longer, though.\"",{"->":"$r","var":true},null]}],{"->":"TTB1.11"},{"c-0":["ev",{"^->":"TTB1.9.b.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.1.s"},[{"#n":"$r2"}],"\n","^Boris sighs, \"Oh, as unforgiving as ever. I hope you don't think her rude... she's just, wounded, I would say.\"","\n",{"->":"TTB2"},{"#f":5}]}]}],[{"->":".^.b"},{"b":["\n",["ev",{"^->":"TTB1.10.b.1.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"No, I haven't spoken to her yet.\"",{"->":"$r","var":true},null]}],{"->":"TTB1.11"},{"c-0":["ev",{"^->":"TTB1.10.b.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.1.s"},[{"#n":"$r2"}],"\n","^\"No matter,\" says Boris, \"You may end up saying the wrong things, I'm not sure she'd appreciate seeing you like this, anyway.\"","\n",{"->":"TTB2"},{"#f":5}]}]}],"nop","\n",{"#f":1}],"TTB2":[["^\"Yeah...um\" you mutter. You get a little choked up. You don't feel yourself to be sane. Everything is just so foreign, and upsetting, actually.","\n","^Boris senses your discomfort, \"You must feel pretty overwhelmed right now,\" Boris says. \"Rest assured, while you may have forgotten everything, I have never forgotten the mission we set out on! I'm here to guide you, every step of the way.\"","\n","^Boris let's out one of his atrocious laughs again, \"Consider me your rock, even though you're probably going to be the one that's holding me back!\"","\n","^You think Boris is a bitch.","\n","^\"Anyway...\" says Boris, \"In order for you not to be the rock in this situation, we kind of have to up your combat prowess. The people we're messing with are no joke. Luckily, the chateau is overrun with monsters at the moment.\"","\n","^\"It's been a while since I've done some cleaning, but now that you're here we can do some chore-,\" Boris stutters, \"I mean combat together.\"","\n",["ev",{"^->":"TTB2.0.12.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"How has the chateau become like this?\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"TTB2.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.12.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^\"Well...\" Boris says, \"Some of your creations sort of went rogue a while back. We sealed them in the chateau for now.\"","\n",["ev",{"^->":"TTB2.0.g-0.2.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^\"Why wait until now to deal with the problem?\"",{"->":"$r","var":true},null]}],{"c-1":["ev",{"^->":"TTB2.0.g-0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.2.s"},[{"#n":"$r2"}],"\n",{"->":"TTB2.0.g-1"},{"#f":5}],"#f":5}],"g-1":["^\"Mostly laziness,\" says Boris, \"Besides, why's that important at this point? You may be able to rekindle some memories if you see the inside.\"","\n","^The prospect of regaining some of your memories has peaked your interest in pursuing the chateau. You know nothing about these 'creations' that Boris speaks of, much less that he claims they belong to you. You hold these thoughts close by as you set your sights on the chateau.","\n",["ev",{"^->":"TTB2.0.g-1.4.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-2","flg":2},{"s":["^\"Alright, let's get going.\"",{"->":"$r","var":true},null]}],{"c-2":["ev",{"^->":"TTB2.0.g-1.c-2.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.4.s"},[{"#n":"$r2"}],"\n","ev",true,"/ev",{"VAR=":"TTBAC","re":true},{"->":"TTB3"},{"#f":5}],"#f":5}]}],{"#f":1}],"TTB3":[["^\"Great!\" chimes Boris. \"Before we get going, I should let you know about upgrading your weapon. When you continuously run into visions of weapons, your familiarity with them becomes enhanced, and therby increases their power. Most weapons even gain new skills when they get upgraded!\"","\n","^Walk with me, Boris gestures. You walk with him towards the front of the courtyard.","\n","^\"Anzhela, the merchant in the courtyard, will sell you a vision, or rather data, about specific weapons,\" Boris says, \"I think she has a revolver for sale. If you haven't already, you should really buy that from her to enhance your ability to manifest your revolver.\"","\n",["ev",{"^->":"TTB3.0.6.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"Understood.\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"TTB3.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.6.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^\"Great, I'll leave you here, meet me at the chateau when you're ready.\"","\n",{"->":"FrontOfCourtyard"},{"#f":5}]}],{"#f":1}],"Chateau":[["^Boris is awaiting you patiently at the front door.","\n","^\"Perfect, you found you're way, Mr. Rock.\"","\n",["ev",{"^->":"Chateau.0.4.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"You're hilarious, Mr. Pigeon.\"",{"->":"$r","var":true},null]}],["ev",{"^->":"Chateau.0.5.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^\"There's not many places to go around here.\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"Chateau.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.4.s"},[{"#n":"$r2"}],"\n","^\"Thank you, I try, but with you around it's a lot easier,\" he jests.","\n",{"->":"Chateau1"},{"#f":5}],"c-1":["ev",{"^->":"Chateau.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.5.s"},[{"#n":"$r2"}],"\n","^\"Regardless, I'm proud of you for walking.\"","\n",{"->":"Chateau1"},{"#f":5}]}],{"#f":1}],"Chateau1":["^You side-eye Boris. \"What do you mean by that?\"","\n","^\"Whatever you wish it to imply,\" he says.","\n","^\"Anyway...\" Boris says while fumbling with some keys, \"I'll let us in, prepare yourself, I know not what lies on the other end of this door any longer.\"","\n","^Boris finds the correct key and pushes the doorway. The doors creak and whine until full opened. Light rushes into the main hall of the chateau, and, shortly after, you follow suit.","\n",{"->":"ChateauMainHall"},{"#f":1}],"Simulation":["^Welcome to the immaterial.","\n","done",{"#f":1}],"Simulation1":["^Welcome to the second immaterial.","\n","done",{"#f":1}],"ChateauMainHall":[[["ev",{"^->":"ChateauMainHall.0.0.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^_Ask Boris for guidance._",{"->":"$r","var":true},null]}],["ev",{"^->":"ChateauMainHall.0.1.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^_Explore on your own._",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"ChateauMainHall.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.0.s"},[{"#n":"$r2"}],"\n","^\"Where should we explore first?\" you ask Boris.","\n","^\"Beats me, honestly,\" he pouts.","\n","^\"You had the keys? How do you not know,\" you ask.","\n","^\"Well, I'm not really sure what we're after to have a goal on where to go. We're here for your sake, y'know. For your memories, and all.\"","\n","^\"Don't charm me,\" you interject.","\n","^Boris gets flustered, \"You would say the same thing if you didn't want to clean alone.\"","\n","^\"This isn't really a cleaning operation, as much as an extermination,\" you sigh. \"Also, I don't hear anything, are you sure this place is overrun?\"","\n",{"->":"CHMC"},{"#f":5}],"c-1":["ev",{"^->":"ChateauMainHall.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.1.s"},[{"#n":"$r2"}],"\n","^You begin to wander further into the main hall, but Boris stops you.","\n","^\"Hey! You're not just going to leave me behind, huh? I let you in here in the first place.\"","\n","^\"Relax, man,\" you say. \"So clingly...\"","\n","^\"You would be too if you didn't want to clean alone,\" he responds.","\n","^\"This isn't really a cleaning operation, as much as an extermination,\" you sigh. \"Also, I don't hear anything, are you sure this place is overrun?\"","\n",{"->":"CHMC"},{"#f":5}]}],{"#f":1}],"CHMC":["^\"Shh!\" Boris shouts.","\n","^\"What?\" you say.","\n","^\"Shhhh!\" he interjects. \"Do you hear that?\"","\n","^You listen in. You hear a breeze walk through the You hear absolutely nothing.","\n","^\"Boris?\" you whisper. \"What did you hear?\"","\n","^\"Nothing,\" he whispers back, \"I just wanted to see if I heard anything.\"","\n","^\"I-\" you pause. \"Alright. Let's just get moving.\"","\n","^\"Alrighty, I'm right behind you,\" Boris says. \"Lead the way.\"","\n",{"->":"CMH"},{"#f":1}],"CMH":["^You're in a grand hall at the front of the chateau. The walls stretch far beyond your eyesight towards the sky. The ceiling has openings that let in light through filtered glass. The whole room glistens of opal refractions.","\n","^There's a double stairway before you, and halls that lead to both your left and right.","\n","ev",{"VAR?":"ReturnToGalaga"},"/ev",[{"->":".^.b","c":true},{"b":["\n","^\"RABBIT! RABBIT!\" yells Boris. \"I KNOW YOU'RE HERE MAN.\"","\n","^Lucy and you go wide eyed. You want to chastise Boris, but both of you have a feeling it might be stupid enough to work.","\n","^A cosmic while manifests  in the middle of the room. A hand juts out and peels the masquerade away. Out of the pocket dimension, Rabbit sprouts out and looks upon the three of you.","\n","^\"There you are, man... Hey...\" Boris says.","\n","^Rabbit whips out a gun and points it straight at Boris head.","\n","^\"HEY AHHHHH. PUT THAT...\" Boris lowers his voice, \"...down...\"","\n","^For the first time in your journey you hear Rabbit speak. He voice sounds as though it's forcing itself through a static strainer. He sounds reserved, contemplative, and inhuman.","\n","^\"What do you want from me?\" asks Rabbit.","\n","^Lucy nudges Boris forward a bit.","\n","^Boris looks panicked, \"Um... I want to work together with you.\"","\n","^\"No,\" responds Rabbit.","\n","^\"Oh..\" says Boris. \"Okay.\"","\n",["ev",{"^->":"CMH.7.b.25.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"I know you're not giving up that easy Boris...\"",{"->":"$r","var":true},null]}],["ev",{"^->":"CMH.7.b.26.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^\"We respect your decision.\"",{"->":"$r","var":true},null]}],{"->":"CMH.9"},{"c-0":["ev",{"^->":"CMH.7.b.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.25.s"},[{"#n":"$r2"}],"\n",{"->":"MRIC"},{"#f":5}],"c-1":["ev",{"^->":"CMH.7.b.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.26.s"},[{"#n":"$r2"}],"\n","^\"What!? I don't!\" shouts Lucy.","\n",{"->":"MRIC"},{"#f":5}]}]}],[{"->":".^.b"},{"b":["\n",["ev",{"^->":"CMH.8.b.1.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^_Go down the left hall._",{"->":"$r","var":true},null]}],["ev",{"^->":"CMH.8.b.2.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^_Go down the right hall._",{"->":"$r","var":true},null]}],["ev",{"^->":"CMH.8.b.3.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-2","flg":2},{"s":["^_Go up the stairway._",{"->":"$r","var":true},null]}],["ev",{"^->":"CMH.8.b.4.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-3","flg":2},{"s":["^_Leave the chateau._",{"->":"$r","var":true},null]}],{"->":"CMH.9"},{"c-0":["ev",{"^->":"CMH.8.b.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.1.s"},[{"#n":"$r2"}],"\n","^You go down the left hall and reach a study room.","\n",{"->":"LHCMH"},{"#f":5}],"c-1":["ev",{"^->":"CMH.8.b.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.2.s"},[{"#n":"$r2"}],"\n","^You go down the right hall.","\n",{"->":"RHCMH"},{"#f":5}],"c-2":["ev",{"^->":"CMH.8.b.c-2.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.3.s"},[{"#n":"$r2"}],"\n","^You walk up the stairs, and Boris follows as your tail. You reach the top and oversee the main hall from the banister. The same opal refractions moves with ease across the room with your perspective.","\n",{"->":"STCMH"},{"#f":5}],"c-3":["ev",{"^->":"CMH.8.b.c-3.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.4.s"},[{"#n":"$r2"}],"\n",{"->":"Courtyard"},{"#f":5}]}]}],"nop","\n",{"#f":1}],"MRIC":[["^\"I think if you just heard me out...\" prompts Boris.","\n","^\"There's nothing to hear out Boris... I love you, I really do, but I don't wish to become one with you.\"","\n","^\"But...\" Boris whimpers.","\n","^\"You're a burst of fire and heart... and, I'm just not like that,\" he says. \"It also didn't go unnoticed that you cleared out my little helpers from the pocket dimension in the lab room.\"","\n","^\"But I didn't know we were the same person at that time!\" Boris whines. \"Andromeda didn't tell me anything! I would have taken care of them!\"","\n","^\"For as much heart as you have, Boris, your love surely isn't unconditional\" says Rabbit. \"Something to think about for the time being.\"","\n","^Boris mouth dropped. The room went silent.","\n","^\"Alright... Down to business, I may have found something of interest for all of us.\"","\n",["ev",{"^->":"MRIC.0.16.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"Go on...\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"MRIC.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.16.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^\"I have intel on the next ultimate weapon we should be targetting,\" Rabbit says. \"His name is Cosmo, the combat double that is. His real name is Vireo.\"","\n","^\"Well at least he doesn't sound that threatening...\" says Boris, \"...right?\"","\n","^Rabbit shakes their head, \"Vireo is a little... insane... I suppose. Cynical and fucked in the head. His whole dreamland bows to his design. His own humanity went a little too much to his head.\"","\n","^\"I'm glad Lucy was suicidal,\" sighs Boris.","\n","^\"HEY!\" Lucy shouts.","\n","^\"Anyway...\" Rabbit interrupts. \"It most definetly wasn't the best idea to bring Andromeda into Lucy's realm. When there's an automatic merging of the anchor things can be... catasrophic... The merging takes place in the dimension sure, but everything in it gets wiped. I'm glad you all had something like The Limitless Blue.\"","\n","^\"So... what happens if we take out Vireo in his dimension?\" asks Lucy.","\n","^\"He should dissapate without an issue. The anchor will merge at Cosmo's coordinates in the universe. The ensuing explosion is sure to be violent... but such a violent rejoining will lead to Cosmo collapsing in on himself.\"","\n","^Rabbit now turn to you, \"You spoke of a timeline where you saw such a collapse correct? Between Andromeda and Lucy.\"","\n","^\"How do you know that...\" you ask.","\n","^\"Boris and I are still intrinsically linked with one another, I know of your journey together thus far. Now answer the question. You saw an alternate timeline where you saw the collapse of Andromeda and Lucy? Yes?\"","\n",["ev",{"^->":"MRIC.0.g-0.22.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^\"Yes.\"",{"->":"$r","var":true},null]}],["ev",{"^->":"MRIC.0.g-0.23.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-2","flg":2},{"s":["^\"Was that what that was?\"",{"->":"$r","var":true},null]}],{"c-1":["ev",{"^->":"MRIC.0.g-0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.22.s"},[{"#n":"$r2"}],"\n",{"->":"MRIC1"},{"#f":5}],"c-2":["ev",{"^->":"MRIC.0.g-0.c-2.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.23.s"},[{"#n":"$r2"}],"\n",{"->":"MRIC1"},{"#f":5}],"#f":5}]}],{"#f":1}],"MRIC1":[["^\"Alright, then you know what I'm saying to be true... Interesting though that you were able to carry over the knowlede of manifested weapons...\"","\n",["ev",{"^->":"MRIC1.0.2.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"It was made from Andromeda and Lucy's energy.\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"MRIC1.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.2.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^\"I don't really buy that explanation quite yet...\" Rabbit says.","\n","^Lucy appears to become angry, \"Is it just insult Lucy day or something?\"","\n","^\"I meant no insult, it's that the circumstances surrounding Aiolos' acquisition of such a weapon are a little... fantastic... I'll leave it at that for now. Let's head over to the doors on the second floor.\"","\n","^The party heads up to the second floor.","\n","^\"Alright it just this next door over, do your thing Aiolos.\"","\n","^Boris hands over his tome and you start casting the spell.","\n","^\"Vireo!\" You shout.","\n","^A rush of green energy pours forth from the door, it explodes in a cloud of smoke.","\n","^Boris strolls in and grabs the paper within.","\n","^\"Alright... I guess... this is it. I've sent the location data over.\"","\n","^\"Will you be joining us, Rabbit?\" asks Lucy.","\n","^\"Yes I will once you all enter Vireo's domain,\" he says. \"I can hold my one weight, but I'm a little scared for you guys. It may be better to go back to the Lucy's realm and train a little bit more. If you're confident, though, find me in Vireo's realm. I'll try to get as much info as I can, see you later.\"","\n","^Rabbit dissapears into a wash of stars.","\n","^The party looks to each other.","\n","^\"I'm with you all the way dude,\" Boris says. \"It's you're call on how we proceed. I'm cool with jumping straight in, or gaining some experience first. We may be able to gain a little bit more intel on how these realms work in the first place.\"","\n","^\"Same here...\" says Lucy. \"I'm fine with either plan, lead the way.\"","\n","ev",false,"/ev",{"VAR=":"ReturnToGalaga","re":true},["ev",{"^->":"MRIC1.0.g-0.36.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^_Return to the main hall._",{"->":"$r","var":true},null]}],{"c-1":["ev",{"^->":"MRIC1.0.g-0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.36.s"},[{"#n":"$r2"}],"\n",{"->":"CMH"},"done",{"#f":5}],"#f":5}]}],{"#f":1}],"LHCMH":["^The room is cluttered with diagrams and drawings of different mechanisms.","\n","^Monitors and computers are prolific within this space, the wires of which pour into a singular machine.","\n","ev",{"VAR?":"FirstTimeLeftHall"},false,"==","/ev",[{"->":".^.b","c":true},{"b":["\n","^\"I remember this place,\" says Boris. \"That machine is a giant 3D printer, almost. It has a bit more flare to it then just that.\"","\n",["ev",{"^->":"LHCMH.9.b.3.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"Wow, you also have a little more flare.\"",{"->":"$r","var":true},null]}],{"->":"LHCMH.11"},{"c-0":["ev",{"^->":"LHCMH.9.b.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.3.s"},[{"#n":"$r2"}],"\n",{"->":"LHCMHEX1"},{"#f":5}]}]}],[{"->":".^.b"},{"b":["\n",["ev",{"^->":"LHCMH.10.b.1.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^_Return to the main hall._",{"->":"$r","var":true},null]}],{"->":"LHCMH.11"},{"c-0":["ev",{"^->":"LHCMH.10.b.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.1.s"},[{"#n":"$r2"}],"\n",{"->":"CMH"},{"#f":5}]}]}],"nop","\n",{"#f":1}],"LHCMHEX1":[["^\"What is that supposed to mean?\" he hisses.","\n","^\"Whatever you wish it to imply,\" you respond driely.","\n","^\"I see what you did there...\" he says. \"Oh wait. Look at that!\"","\n","^Just in that moment, a little black rabbit hopped before your feet.","\n",["ev",{"^->":"LHCMHEX1.0.8.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"Is this Rabbit?\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"LHCMHEX1.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.8.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^\"Perhaps,\" says Boris. \"Rather, a fragment of him.\"","\n","^\"It's kind of cute, actually,\" you say.","\n","^\"Well, where there's one there's many of them, keep an eye out,\" warns Boris.","\n","^\"Don't tell me the 'overrun by monsters' bit was for these fucking rabbits.\"","\n","^Boris' face is flush with guilt.","\n","^The rabbit begins to hop away, and phases through one of the walls of the room. seemingly running off through a wall.","\n","^\"This place is a labyrinth, isn't it?\" you say.","\n","^\"Seems so,\" Boris answers. \"It appears what we see is not the truth in its entirety. Let's follow the rabbit.\"","\n",["ev",{"^->":"LHCMHEX1.0.g-0.16.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^_Follow the rabbit through the wall._",{"->":"$r","var":true},null]}],{"c-1":["ev",{"^->":"LHCMHEX1.0.g-0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.16.s"},[{"#n":"$r2"}],"\n",{"->":"LHCMEX2"},{"#f":5}],"#f":5}]}],{"#f":1}],"LHCMEX2":["^You take advantage of the world's brief disillusionment, and push through the wall with Boris. You both end up in small pocket of space. What once was one now has become three, as in, three small black rabbits sit before you.","\n","^\"See, I told you,\" Boris says. \"They just keep multiplying, that's why I didn't want to deal with it.\"","\n","^\"Okay, well I'm here now. Also, they're just rabbits, they aren't monsters.\"","\n","^\"Just you wait,\" Boris says. \"Look now.\"","\n","^You look back to the rabbits to see a swirl of mist, building from them. All three morph into replicas reminiscent of Rabbit.","\n","^You look to Boris.","\n","^\"Trust me, they aren't friendly,\" he says.","\n","^Prepare for combat.","\n","ev","str","^Triple Rabbit","/str","str","^LHCMEX3","/str",{"x()":"StartCombat","exArgs":2},"pop","/ev","\n","done",{"#f":1}],"LHCMEX3":[["^\"Phew!\" says Boris. \"Alright, let's get out of here before this pocket collapses.\"","\n","^You both rush out of the pocket dimension, as it closes behind you.","\n","^You're back in the study. You press against the wall, and it budges no longer.","\n","^\"See, cleaning can be fun,\" says Boris.","\n",["ev",{"^->":"LHCMEX3.0.8.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"Something like that...\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"LHCMEX3.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.8.s"},[{"#n":"$r2"}],"\n","^You return your focus back to the room.","\n",{"->":"LHCMH"},{"#f":5}]}],{"#f":1}],"RHCMH":["ev",{"VAR?":"FirstTimeRightHall"},false,"==","/ev",[{"->":".^.b","c":true},{"b":["\n","ev",true,"/ev",{"VAR=":"FirstTimeRightHall","re":true},"^The hall opens up to a room with black metal walls. The whole room buzzes with energy. Neon engravings line the walls in sporadic patterns, all colliding towards the center of the room towards a single touch panel.","\n","^Boris pushes past you and heads towards the panel. \"Trust me, I got this,\" he boasts. \"This is a weapon generation machine, we could literally have infinite upgrades to our weapons. Any weapon in the conceivable universe!\"","\n","^Boris starts furiously pressing through menus on the control panel.","\n","^\"Oh... oh no...\" he says. Seconds later, sirens start blaring throughout the room.","\n","^\"What? What is happening?\" you say.","\n","^Boris starts flapping his arms frantically, \"I don't know, I don't know! I think it thinks I'm an intruder, HOW COULD YOU HAVE NOT GIVEN ME PERMISSIONS TO USE THIS MACHINE!\"","\n","^\"HOW WAS I SUPPOSED TO KNOW,\" you yell.","\n","^\"I DON'T KNOW,\" he yells back.","\n","^Boris goes back to smashing buttons on the panel, \"Wait, I think I have something here, QUICKLY, tell me what kind of weapon you want me to make!\"","\n",["ev",{"^->":"RHCMH.5.b.23.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"A GUN.\"",{"->":"$r","var":true},null]}],["ev",{"^->":"RHCMH.5.b.24.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^\"A SWORD.\"",{"->":"$r","var":true},null]}],["ev",{"^->":"RHCMH.5.b.25.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-2","flg":2},{"s":["^\"A TOME.\"",{"->":"$r","var":true},null]}],{"->":"RHCMH.7"},{"c-0":["ev",{"^->":"RHCMH.5.b.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.23.s"},[{"#n":"$r2"}],"\n","ev",0,"/ev",{"VAR=":"WeaponChosen","re":true},{"->":"RHCMHEX"},{"#f":5}],"c-1":["ev",{"^->":"RHCMH.5.b.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.24.s"},[{"#n":"$r2"}],"\n","ev",1,"/ev",{"VAR=":"WeaponChosen","re":true},{"->":"RHCMHEX"},{"#f":5}],"c-2":["ev",{"^->":"RHCMH.5.b.c-2.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.25.s"},[{"#n":"$r2"}],"\n","ev",2,"/ev",{"VAR=":"WeaponChosen","re":true},{"->":"RHCMHEX"},{"#f":5}]}]}],[{"->":".^.b"},{"b":["\n","^The room is a shell of what it used to be. The machinery and panel are completely broken. The only thing that lights the space is the light that pours in from the hall.","\n",["ev",{"^->":"RHCMH.6.b.3.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^_Return to the main hall._",{"->":"$r","var":true},null]}],{"->":"RHCMH.7"},{"c-0":["ev",{"^->":"RHCMH.6.b.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.3.s"},[{"#n":"$r2"}],"\n",{"->":"CMH"},{"#f":5}]}]}],"nop","\n",{"#f":1}],"RHCMHEX":["^\"OK GOT IT.\"","\n","^Boris delivers one final smack to the panel before a powerful explosion sends both of you flying into the walls.","\n","^The room whirs down as the electrified walls cease to murmur. The room goes dark.","\n","ev",{"VAR?":"WeaponChosen"},"/ev",["du","ev",0,"==","/ev",{"->":".^.b","c":true},{"b":["pop","\n","^A glowing gun is the only thing that iluminates the room, laying promptly atop the panel.","\n",{"->":".^.^.^.13"},null]}],["du","ev",1,"==","/ev",{"->":".^.b","c":true},{"b":["pop","\n","^A glowing sword is the only thing that iluminates the room, laying promptly atop the panel.","\n",{"->":".^.^.^.13"},null]}],["du","ev",2,"==","/ev",{"->":".^.b","c":true},{"b":["pop","\n","^A glowing tome is the only thing that iluminates the room, laying promptly atop the panel.","\n",{"->":".^.^.^.13"},null]}],"pop","nop","\n","^Boris gets up from being hunched on the floor. He wipes some soot from his face as he approached you.","\n","^\"Sorry about that...\"","\n","^\"It's okay Boris.\"","\n","^\"Are you upset with me?\" he asks.","\n","^\"No,\" you respond.","\n","^\"Are you dissapointed in me?\" he asks.","\n","^\"Yes,\" you respond.","\n","^\"Okay,\" he says. I'll go grab the weapon, and we can get out of this room.\"","\n","^\"Okay...\" you say. \"Wait... Boris what if it's a trick? Why would the system let you create a weapon if it thought you an intruder?\"","\n","^\"That would be comically convenient, wouldn't it?\" Boris says as he picks up the weapon from the pedestal.","\n","^The moment he picks the weapon up, the room begins to shake. The door behind you shuts clean shut, and the room goes pitch black.","\n","^\"Boris?\" you call.","\n","^\"I'm here,\" he sighs.","\n","^Something begins manifesting in the room. Light pools from the walls and collides over and over into one concentrated ball that hovers in the center of the room.","\n","^\"I don't like the looks of that,\" says Boris. \"Prepare for combat.\"","\n","ev","str","^BallOfLight","/str","str","^RHCMHEX1","/str",{"x()":"StartCombat","exArgs":2},"pop","/ev","\n","done",{"#f":1}],"RHCMHEX1":["^The ball of light swells and collapses. The room goes dark briefly before the door unlocks. You are relinquished from the trap. The door opens up back to the hall.","\n","^\"Hey, um...\" utters Boris.","\n","^\"Just don't,\" you say. \"Lets just go.\"","\n","^Boris looks towards his feet in shame, \"Got it.\"","\n",{"->":"RHCMH"},{"#f":1}],"STCMH":["^There's an array of dark wooden doors up here, each with a number in silver engraved. The floorboards creak with each of your footsteps.","\n","ev",{"VAR?":"FirstTimeInChateau"},false,"==","/ev",[{"->":".^.b","c":true},{"b":["\n","ev",true,"/ev",{"VAR=":"FirstTimeInChateau","re":true},"^You look to Boris. You try to budge one of the locked doors. It doesn't give way.","\n","^\"Do you have the keys for any of these?\" you ask.","\n","^\"No, I don't actually. I'm pretty sure you were the only one that knew how to open these. They're gateways to other simulations.\"","\n","^\"Well, where do I find the keys?\" you ask.","\n","^Boris stands firm with both hands on his hips, observing the doors. \"I'm not really sure. You've sealed some pretty heavy stuff behind these. It's probably best we just leave them alone.\"","\n","^\"How do you mean?\" you say.","\n","^\"I mean just that,\" Boris affirms. \"The simulations held behind these doors aren't too far off from your own recent imprisonment.\"","\n","^\"I've trapped people here?\" you ask.","\n","^\"Parts of them...\" Boris says.","\n","^You look to the doors with heavier heart. \"What have I done?\" you ask.","\n","^\"Whatever it took to uphold the machine,\" he says. \"You had a change of heart towards the end. You never had the chance to free those you locked within.\"","\n",["ev",{"^->":"STCMH.7.b.27.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"Uphold the machine?\"",{"->":"$r","var":true},null]}],["ev",{"^->":"STCMH.7.b.28.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^\"Change of heart?\"",{"->":"$r","var":true},null]}],{"->":"STCMH.9"},{"c-0":["ev",{"^->":"STCMH.7.b.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.27.s"},[{"#n":"$r2"}],"\n",{"->":"STCHMEX"},{"#f":5}],"c-1":["ev",{"^->":"STCMH.7.b.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.28.s"},[{"#n":"$r2"}],"\n",{"->":"STCHMEX"},{"#f":5}]}]}],[{"->":".^.b"},{"b":["\n","^There's not much left to do up here.","\n",["ev",{"^->":"STCMH.8.b.3.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^_Return down the stairs._",{"->":"$r","var":true},null]}],{"->":"STCMH.9"},{"c-0":["ev",{"^->":"STCMH.8.b.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.3.s"},[{"#n":"$r2"}],"\n",{"->":"CMH"},{"#f":5}]}]}],"nop","\n",{"#f":1}],"STCHMEX":[["^\"Jupiter thrives off of the destruction of other civilizations. Their worlds, their experiences, everything,\" Boris pouts. \"All twisted into artificial realities. Call it for pleasure or study, Jupiter is an amalgamation-\"","\n","^\"Of inexplicable feeling,\" you utter.","\n","ev",{"VAR?":"SpokeToWoman"},"/ev",[{"->":".^.b","c":true},{"b":["\n","^Speaking of destruction, you remember vividly that Andromeda deamed herself a ruthless killer.","\n",{"->":".^.^.^.8"},null]}],"nop","\n","^\"The pinacle of existence,\" finishes Boris. \"Such were words to live by at one point. Hindsight calls us selfish, horrific beings.\"","\n",["ev",{"^->":"STCHMEX.0.12.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"Destruction of other civilizations?\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"STCHMEX.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.12.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^\"You mentioned the destruction of other civilizations?\" you ask.","\n","^\"Yes,\" Boris says. \"A means to harvest data for these experiences.\"","\n","^Boris takes note of your blank expression.","\n","^\"Hm...\" he paces, \"How should I explain this? Do you know what a Telepolos is?\"","\n","^You don't recall ever knowing about a Telepolos, but information about it feels just in grasp at the back of your mind.","\n","^\"A squid, or rather jellyfish sort of creature,\" you say. \"Both renound for advancing our understanding of teleportation, but was suprisingly a food delicacy on Uhloth.\"","\n","^\"How does it taste?\" Boris asks.","\n","^\"Rubbery,\" you answer. \"It feels malleable in the mouth, but upon applying pressure, with chewing for example, it hardens to a satisfying crunch.\"","\n","^\"Oh...\" you say. \"I see. It's pretty delicious too. I've never actually tried it, but I know exactly how it tastes.\"","\n","^\"What does it feel like to be stung by one?\" asks Boris.","\n","^\"Ah!\" you flinch as if in pain.","\n","^\"Ah! HAHAHA,\" mocks Boris.","\n",["ev",{"^->":"STCHMEX.0.g-0.24.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^\"Fuck you.\"",{"->":"$r","var":true},null]}],["ev",{"^->":"STCHMEX.0.g-0.25.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-2","flg":2},{"s":["^\"What does it feel like to be hit by a train?\"",{"->":"$r","var":true},null]}],{"c-1":["ev",{"^->":"STCHMEX.0.g-0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.24.s"},[{"#n":"$r2"}],"\n","^\"Yeah, yeah. Just remember you have full control over the data you access. Don't analyze the data of things you don't actually want to know. That's why everything goes through a decryption process, so you can't just accidentally read things.\"","\n",{"->":"STCHMEX1"},{"#f":5}],"c-2":["ev",{"^->":"STCHMEX.0.g-0.c-2.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.25.s"},[{"#n":"$r2"}],"\n","^\"Good try,\" smirks Boris. \"You have full control on what data you access, you know. Don't analyze the data of things you don't actually want to know. That's why everything goes through a decryption process, so you can't just accidentally read things.\"","\n",{"->":"STCHMEX1"},{"#f":5}],"#f":5}]}],{"#f":1}],"STCHMEX1":[[["ev",{"^->":"STCHMEX1.0.0.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"Noted.\"",{"->":"$r","var":true},null]}],["ev",{"^->":"STCHMEX1.0.1.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^\"Fuck you.\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"STCHMEX1.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.0.s"},[{"#n":"$r2"}],"\n","^\"Great. Well, I suggest trying to talk to Andromeda after we're done roaming around this place. She may know how to open one of these doors. She was one of your highest confidants, y'know.\"","\n","^Boris sparingly meets your eyes as he brings his hands behind his back. His voice begins to shake as he lightly kicks the air, \"I suppose I didn't make the cut.\"","\n",{"->":"STCHMEX2"},{"#f":5}],"c-1":["ev",{"^->":"STCHMEX1.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.1.s"},[{"#n":"$r2"}],"\n","^\"Yep, knew that was coming. Anyways, I suggest trying to talk to Andromeda after we're done roaming around this place. She may know how to open one of these doors. She was one of your highest confidants, y'know.\"","\n","^Boris sparingly meets your eyes as he brings his hands behind his back. His voice begins to shake as he lightly kicks the air, \"I suppose I didn't make the cut.\"","\n",{"->":"STCHMEX2"},{"#f":5}]}],{"#f":1}],"STCHMEX2":[["^\"Oh... I'm sorry,\" you say. \"Is this something you're actually upset over?\"","\n","^\"No,\" Boris cheers. \"I don't want to be fucked up like Andromeda.\"","\n",["ev",{"^->":"STCHMEX2.0.4.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"...\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"STCHMEX2.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.4.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^Boris stares at you waiting for a reaction, to which you give none.","\n","^He smiles a little, \"Lead the way, Mr.\"","\n","^You turn your attention away from Boris to the environment around you once more.","\n",{"->":"STCMH"},{"#f":5}]}],{"#f":1}],"Oasis":["ev",{"VAR?":"FirstTimeOasis"},"/ev",[{"->":".^.b","c":true},{"b":["\n","^You're being is invited to a new space, and way of thinking. Your party and yourself materialize on a sandy beach. Seagulls chirp in the air. Waves thrash and roar and relief their anger to a rolling whisper.","\n",{"->":"MainBeach"},{"->":"Oasis.5"},null]}],[{"->":".^.b"},{"b":["\n","^This is Oasis.","\n",{"->":"MainBeach"},{"->":"Oasis.5"},null]}],"nop","\n",{"#f":1}],"MainBeach":["^The sun beams down upon you. There's an unsurpassable cliff behind you that stretches with the coastline. The sandy coast, upon which you stand spreads in either direction as far as your eyes  can see. The whole place feels barren, and apart from the seagulls, umbearably quiet.","\n","ev",{"VAR?":"FirstTimeOasis"},"/ev",[{"->":".^.b","c":true},{"b":["\n","^Andromeda walks up beside you, a light breeze brushes her hair. \"We're here... I guess...\"","\n",["ev",{"^->":"MainBeach.5.b.3.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"Do you feel anything?\"",{"->":"$r","var":true},null]}],["ev",{"^->":"MainBeach.5.b.4.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^\"Do you know anyting about this place?\"",{"->":"$r","var":true},null]}],{"->":".^.^.^.6"},{"c-0":["ev",{"^->":"MainBeach.5.b.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.3.s"},[{"#n":"$r2"}],"\n",{"->":"AnDi1"},{"#f":5}],"c-1":["ev",{"^->":"MainBeach.5.b.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.4.s"},[{"#n":"$r2"}],"\n",{"->":"AnDi1"},{"#f":5}]}]}],"nop","\n",{"#f":1}],"AnDi1":[["^\"No...\" he says. \"It's all just emptiness, I don't understand. Where's my other half?\"","\n","^\"I suppose we could walk along the coastline,\" says Boris. We kinda just have to pick a direction though and stick with it.\"","\n",["ev",{"^->":"AnDi1.0.4.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"Is there no better way?\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"AnDi1.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.4.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^Andromeda paces a bit, \"I suppose not, right?","\n","^Boris looks to you, \"Alrighty let's flip a coin, winner will decide what direction we'll go. Heads or tails?\"","\n",["ev",{"^->":"AnDi1.0.g-0.4.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^\"Heads.\"",{"->":"$r","var":true},null]}],["ev",{"^->":"AnDi1.0.g-0.5.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-2","flg":2},{"s":["^\"Tails\"",{"->":"$r","var":true},null]}],["ev",{"^->":"AnDi1.0.g-0.6.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-3","flg":2},{"s":["^\"You pick Boris, I don't mind.\"",{"->":"$r","var":true},null]}],{"c-1":["ev",{"^->":"AnDi1.0.g-0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.4.s"},[{"#n":"$r2"}],"\n",{"->":"Heads"},{"#f":5}],"c-2":["ev",{"^->":"AnDi1.0.g-0.c-2.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.5.s"},[{"#n":"$r2"}],"\n",{"->":"Tails"},{"#f":5}],"c-3":["ev",{"^->":"AnDi1.0.g-0.c-3.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.6.s"},[{"#n":"$r2"}],"\n","^\"You don't have much of a head on your shoulders, do you?\"","\n","^You stare blankly at Boris.","\n","^\"No matter, let's just head to the left.\"","\n",{"->":"BeachCycle"},{"#f":5}],"#f":5}]}],{"#f":1}],"Heads":[["^Boris takes out a coin and flips it. \"Heads!\" he says, \"I win!\"","\n",["ev",{"^->":"Heads.0.2.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"I called heads?\"",{"->":"$r","var":true},null]}],["ev",{"^->":"Heads.0.3.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^\"Yay...\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"Heads.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.2.s"},[{"#n":"$r2"}],"\n","^\"You didn't call heads, you cheater, I did,\" you say.","\n","^\"Why are you lying?\"","\n","^You look at Boris as if you might blow a fuse. He seems unphased by bottled up anger. Andromeda can be heard giggling in the background.","\n","^\"Alright we're heading right, let's go,\" announces Boris.","\n",{"->":"BeachCycle"},{"#f":5}],"c-1":["ev",{"^->":"Heads.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.3.s"},[{"#n":"$r2"}],"\n","^You know Boris cheated but just decide to let it go. You take a deep breathe and exhale.","\n","^\"Alright we're heading right, let's go,\" announces Boris.","\n",{"->":"BeachCycle"},{"#f":5}]}],{"#f":1}],"Tails":[["^Boris takes out a coin and flips it. \"Tails!\" he says, \"I win!\"","\n",["ev",{"^->":"Tails.0.2.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"I called tails?\"",{"->":"$r","var":true},null]}],["ev",{"^->":"Tails.0.3.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^\"Yay...\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"Tails.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.2.s"},[{"#n":"$r2"}],"\n","^\"You didn't call heads, you cheater, I did,\" you say.","\n","^\"Why are you lying?\"","\n","^You look at Boris as if you might blow a fuse. He seems unphased by bottled up anger. Andromeda can be heard giggling in the background.","\n","^\"Alright we're heading left, let's go,\" announces Boris.","\n",{"->":"BeachCycle"},{"#f":5}],"c-1":["ev",{"^->":"Tails.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.3.s"},[{"#n":"$r2"}],"\n","^You know Boris cheated but just decide to let it go. You take a deep breathe and exhale.","\n","^\"Alright we're heading left, let's go,\" announces Boris.","\n",{"->":"BeachCycle"},{"#f":5}]}],{"#f":1}],"BeachCycle":["ev",{"VAR?":"Seagul"},10,">","/ev",[{"->":".^.b","c":true},{"b":["\n","^Your walk with the group is interrupted a malicious swarm of seaguls!","\n","^\"Ah! I knew those bitches were evil,\" screams Boris.","\n","^\"Calm down,\" Andromeda says as she manifests her weapon. \"Get ready for battle.\"","\n","ev","str","^Seagul","/str","str","^SeagulAfter","/str",{"x()":"StartCombat","exArgs":2},"pop","/ev","\n",{"->":".^.^.^.7"},null]}],[{"->":".^.b"},{"b":["\n","^The group's footsteps imprint into the sand over and over again. It feels as though the beach is infinite in expanse. No landmarks could dictate from where your journey started nor how much progress you've made.","\n",{"->":".^.^.^.7"},null]}],"nop","\n","ev",{"VAR?":"Seagul"},1,"+",{"VAR=":"Seagul","re":true},"/ev","ev",{"VAR?":"Seagul"},3,">",{"VAR?":"Drowning"},"&&","/ev",[{"->":".^.b","c":true},{"b":["\n","ev",false,"/ev",{"VAR=":"Drowning","re":true},"^\"I feel like we're getting nowhere,\" Boris sighs.","\n","^\"Maybe we're going about this all wrong. Perhaps the sea is the main attraction in this simulation?\" says Andromeda.","\n","^\"YOU WANT ME TO SWIM?\" cries Boris. \"No way.\"","\n","^\"A bit more than that. I think we need to dive into the ocean,\" says Andromeda.","\n","^\"Won't it feel like we're drowning?\" you ask.","\n","^\"Not if we never decrypt the associated data... and also encrypt the data current circulating within us about drowning.\"","\n",["ev",{"^->":"BeachCycle.22.b.17.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"Let's just keep walking.\"",{"->":"$r","var":true},null]}],["ev",{"^->":"BeachCycle.22.b.18.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^\"Alright, let's dive in.\"",{"->":"$r","var":true},null]}],{"->":".^.^.^.23"},{"c-0":["ev",{"^->":"BeachCycle.22.b.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.17.s"},[{"#n":"$r2"}],"\n","^Andromeda looks to Boris and then back to you, \"Ok well if you change your mind, we'll be ready to take the plunge.\"","\n",{"->":".^.^.^.^"},{"#f":5}],"c-1":["ev",{"^->":"BeachCycle.22.b.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.18.s"},[{"#n":"$r2"}],"\n",{"->":"OceanMain"},{"#f":5}]}]}],"nop","\n","ev",{"VAR?":"Drowning"},false,"==","/ev",[{"->":".^.b","c":true},{"b":["\n",["ev",{"^->":"BeachCycle.30.b.1.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^_Keep walking._",{"->":"$r","var":true},null]}],["ev",{"^->":"BeachCycle.30.b.2.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^_Dive in the water._",{"->":"$r","var":true},null]}],{"->":".^.^.^.32"},{"c-0":["ev",{"^->":"BeachCycle.30.b.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.1.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.^.^"},{"#f":5}],"c-1":["ev",{"^->":"BeachCycle.30.b.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.2.s"},[{"#n":"$r2"}],"\n",{"->":"OceanMain"},{"#f":5}]}]}],[{"->":".^.b"},{"b":["\n",["ev",{"^->":"BeachCycle.31.b.1.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^_Keep walking._",{"->":"$r","var":true},null]}],{"->":".^.^.^.32"},{"c-0":["ev",{"^->":"BeachCycle.31.b.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.1.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.^.^"},{"#f":5}]}]}],"nop","\n",{"#f":1}],"SeagulAfter":[["^\"That was rough,\" sighs Boris.  \"What's the verdict mister? Where are we going?\"","\n",["ev",{"^->":"SeagulAfter.0.2.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^_Keep walking._",{"->":"$r","var":true},null]}],["ev",{"^->":"SeagulAfter.0.3.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^_Dive in the water._",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"SeagulAfter.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.2.s"},[{"#n":"$r2"}],"\n",{"->":"BeachCycle"},{"#f":5}],"c-1":["ev",{"^->":"SeagulAfter.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.3.s"},[{"#n":"$r2"}],"\n",{"->":"OceanMain"},{"#f":5}]}],{"#f":1}],"OceanMain":[["ev",{"VAR?":"FirstTimeOasis"},"/ev",[{"->":".^.b","c":true},{"b":["\n","^The party wades further and further into the water. You all walk into the ocean until you're about chest deep.","\n","^Boris begins shaking, \"Are we sure about this?\"","\n","^\"Absolutely,\" interjects Andromeda. \"It's ok if you're scared Boris.\"","\n","^Andromeda waddles over to Boris while the water slowly swells to her neck and sinks again. She grabs Boris' hand beneath the water to comfort him.","\n","^\"We go,\" she says while looking towards you.","\n",{"->":".^.^.^.4"},null]}],"nop","\n","^You all plunge through the surface of the water and dive deeper below. A limitless blue enshrouds you and the party.","\n","ev",{"VAR?":"FirstTimeOasis"},"/ev",[{"->":".^.b","c":true},{"b":["\n","^\"A damn! It's the same thing as the beach. Everything just feel infinite around here. Where the fuck is Lucy?\" says Boris.","\n","^\"How did you speak to us just now?\" you ask.","\n","^\"We don't communicate with sound, you know. Our mouths may move but words are transported with intent,\" informs Andromeda. \"You may message anybody you know with just your thoughts, or if you'd like to voice to those in a vicinity, your message is broadcasted a distance from yourself.\"","\n","^Boris looks to you now, \"Well you were the only connection with Lucy weren't you?\"","\n","^You look to Boris, but don't respond. You don't really remember Lucy.","\n","^\"MESSAGE HER,\" he yells.","\n",["ev",{"^->":"OceanMain.0.11.b.13.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"Ok, damn.\"",{"->":"$r","var":true},null]}],{"->":".^.^.^.12"},{"c-0":["ev",{"^->":"OceanMain.0.11.b.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.13.s"},[{"#n":"$r2"}],"\n","^\"LUUUCCCYYYY,\" you shout with all your might.","\n","^Boris begins to yell back \"NOOO NOT SHOUT THE MESSAGE.\" He looks to you now all wild eyed, \"YOU WERE SUPPOSED TO JUST SET UP A PRIVATE MENTAL CONNECTION, YOU JUST BROADCASTED THE MESSAGE TO EVERY-\"","\n","^The ocean begins to violently thrash and shake. A wailing noise vibrates through the water with such ferocity the party goes still in fear.","\n","^\"OH GOD FUCK\" screams Boris.","\n","^A massive shadow of a figure encroaches upon the party.","\n","^Boris starts flailing about, trying to kick up to the surface as fast as possible.","\n","^Andromeda swoops over and grabs him by the foot holding him back, \"HEY! You're not leaving us, we got this. Everyone, prepare for combat!\"","\n","ev","str","^Whale","/str","str","^WhaleFinish","/str",{"x()":"StartCombat","exArgs":2},"pop","/ev","\n","done",{"#f":5}]}]}],"nop","\n",["ev",{"^->":"OceanMain.0.14.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^_Head to the underwater train station._",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"OceanMain.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.14.s"},[{"#n":"$r2"}],"\n",{"->":"UnderwaterTrainStation"},{"#f":5}]}],{"#f":1}],"WhaleFinish":[["^Boris can't stop hyperventalating. Both Andromeda and you look to Boris. \"Huuumph... Hummmph,\" Boris' heavy breathing continues.","\n","^\"Boris, dude, breathe,\" says Andromeda. \"Just re-encrypt the file on thalassophobia.\"","\n","^\"But I AM scared of lassos,\" Boris cries, \"It's INTEGRAL to my personality.\"","\n","^\"Oh my god,\" sighs Andromeda.","\n","^\"All those poor animals...\" whispers Boris, \"They stood no chance against cowboys.\"","\n","^You roll your eyes, but briefly catch a glistening coming from deeper in the water.","\n",["ev",{"^->":"WhaleFinish.0.12.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"Follow me.\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"WhaleFinish.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.12.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^\"Wait... what... where are you going?\" Boris says while swimming behind you.","\n","^The party follows you in your pursuit of the glistening in the water.","\n",{"->":"UnderwaterTrainStation"},["ev",{"^->":"WhaleFinish.0.g-0.5.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^\"Do yall see that?\"",{"->":"$r","var":true},null]}],{"c-1":["ev",{"^->":"WhaleFinish.0.g-0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.5.s"},[{"#n":"$r2"}],"\n","^Andromeda traces her eyes in the direction you're looking. She squints a bit, \"Yes, actually. It's definetly worth investigating.","\n","^The party follows you in your pursuit of the glistening in the water.","\n",{"->":"UnderwaterTrainStation"},{"#f":5}],"#f":5}]}],{"#f":1}],"UnderwaterTrainStation":[["ev",{"VAR?":"FirstTimeOasis"},"/ev",[{"->":".^.b","c":true},{"b":["\n","^The party swims closer to the depths of the oceans. A building that resembles a train station begins to swell into sight.","\n","^\"Hey guys, I think that's a train station,\" you say.","\n","^Boris' eyes widen, \"Train station? How do you know it's a train station? It could just be any sort of building. Did a mysterious narrator from another world inform you that it was a train station?\"","\n",["ev",{"^->":"UnderwaterTrainStation.0.3.b.7.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"No, you psycho, it just looks like one,\" you say.",{"->":"$r","var":true},null]}],["ev",{"^->":"UnderwaterTrainStation.0.3.b.8.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^\"Yes, actually.\"",{"->":"$r","var":true},null]}],{"->":".^.^.^.4"},{"c-0":["ev",{"^->":"UnderwaterTrainStation.0.3.b.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.7.s"},[{"#n":"$r2"}],"\n","^Boris looks to you in disapproval.","\n","^Andromeda tilts her head slightly in confusion. \"Yeah it doesn't really look like a train station dude,\" she snickers.","\n","^\"THERE'S TRAIN TRACKS STICKING OUT ON EITHER SIDE OF IT,\" you yell.","\n","^Both Andromeda and Boris explode into a fit of laughter.","\n",{"->":"UTSpecial"},{"#f":5}],"c-1":["ev",{"^->":"UnderwaterTrainStation.0.3.b.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.8.s"},[{"#n":"$r2"}],"\n","^\"Oh, you've really gone mad now, haven't you?\" Boris sighs. \"All this medication in our database and we still don't have a cure for what you have...\"","\n","^\"Boris you're all fucked up too, I don't want to hear it,\" Andromeda interjects.","\n",{"->":"UTSpecial"},{"#f":5}]}]}],"nop","\n","^In this limitless blue, you stumble upon train station. The building is covered in mosaic like circle windows, through each you can see a multicolored shimmer seeping into the surrounding water. Train tracks sprout from either side of the building.","\n",["ev",{"^->":"UnderwaterTrainStation.0.8.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^_Enter the train station._",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"UnderwaterTrainStation.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.8.s"},[{"#n":"$r2"}],"\n",{"->":"TSHub"},{"#f":5}]}],{"#f":1}],"UTSpecial":[["^You grit your teeth in frustation, but let the whole thing go. You attention is drawn back to the building. It is covered in mosaic like circle windows. They are gorgeous and grand. Through each you can see a multicolored shimmer seeping into the surrounding water, most probably due to a light coming from the inside. Train tracks sprout from either side of the building.","\n","^You swim towards the building and the party follows.","\n","^You approach grand double doors at the front of the building. You reach the handle, only for Boris to shout at you for doing so.","\n","^\"WON'T THE WATER GO IN? WAIT!\"","\n","^You look to him all droopy eyed.","\n",["ev",{"^->":"UTSpecial.0.10.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"There's only one way to find out.\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"UTSpecial.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.10.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^You reach for the door and throw it open. No water falls forward. The party walks through the entrance.","\n","^You all look behind you upon entering, only to see a wall of water standing tall by the door frame.","\n","^\"It... can't get in here?\" utters Andromeda.","\n","^\"I guess not...\" Boris says while grasping at his clothes. \"We're also... dry... What tech made that possible?\"","\n","^\"Not that it matters right now,\" says Andromeda. \"Can we just focus on finding Lucy?\"","\n",["ev",{"^->":"UTSpecial.0.g-0.10.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^\"Sure.\"",{"->":"$r","var":true},null]}],["ev",{"^->":"UTSpecial.0.g-0.11.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-2","flg":2},{"s":["^\"Andromeda is right Boris, let's keep moving.\"",{"->":"$r","var":true},null]}],{"c-1":["ev",{"^->":"UTSpecial.0.g-0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.10.s"},[{"#n":"$r2"}],"\n",{"->":"TSHub"},{"#f":5}],"c-2":["ev",{"^->":"UTSpecial.0.g-0.c-2.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.11.s"},[{"#n":"$r2"}],"\n",{"->":"TSHub"},{"#f":5}],"#f":5}]}],{"#f":1}],"TSHub":[["^The the perimeter walls of the train station are lined with soft glowing lamps. A gentle light pours from each of them. The walls seem to be made of polished concrete. A small tinge of a pinkish-red is seen in the material.","\n","^The party's steps coalesce and echo through the chamber.","\n","ev",{"VAR?":"FirstTimeOasis"},"/ev",[{"->":".^.b","c":true},{"b":["\n","^\"What is this?\" says Boris.","\n","^\"Your guess is as good as mine,\" Andromeda says. \"Does it feel like we're being watched?\"","\n","^\"Perhaps...\" says Boris. He begins itching himself near the collar, \"I'm getting kind of freaked out, actually.\"","\n","^You begin examining the space more thoroughly.","\n","^The room is grand in scale, and very barren. A few benches are sprawled about, and are made of the same material as the walls. If one squints, they would appear to be lumps that just swell from the floor. The room is split down the middle by the train tracks. The party stands together on the platform. A blinking sign can be seen hanging from the ceiling. A train is about to arrive.","\n","^You almost missed it when you walked in, but there is an information kiosk a little behind you as a compartment attached the wall.","\n",["ev",{"^->":"TSHub.0.7.b.13.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^_Approach the kiosk._",{"->":"$r","var":true},null]}],["ev",{"^->":"TSHub.0.7.b.14.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^_Wait for the train._",{"->":"$r","var":true},null]}],{"->":".^.^.^.8"},{"c-0":["ev",{"^->":"TSHub.0.7.b.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.13.s"},[{"#n":"$r2"}],"\n",{"->":"Kiosk"},{"#f":5}],"c-1":["ev",{"^->":"TSHub.0.7.b.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.14.s"},[{"#n":"$r2"}],"\n",{"->":"TrainWait"},{"#f":5}]}]}],"nop","\n","^The room is grand in scale, and very barren. A few benches are sprawled about, and are made of the same material as the walls. If one squints, they would appear to be lumps that just swell from the floor. The room is split down the middle by the train tracks. The party stands together on the platform. A blinking sign can be seen hanging from the ceiling. A train is about to arrive.","\n",["ev",{"^->":"TSHub.0.12.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^_Wait for the train._",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"TSHub.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.12.s"},[{"#n":"$r2"}],"\n",{"->":"TrainWait"},{"#f":5}]}],{"#f":1}],"Kiosk":["^The party approaches the kiosk.","\n","ev",{"VAR?":"FirstTimeOasis"},"/ev",[{"->":".^.b","c":true},{"b":["\n","^\"Oh, how lovely, a brochure,\" Boris picks it up and starts onfolding it.","\n","^\"Oh wow,\" he turns the sprawled out brochure every which way, even upside down.","\n","^\"Yes... I see... hm... very interesting...yes... very nice...\"","\n",["ev",{"^->":"Kiosk.5.b.7.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"What does it say bud?\"",{"->":"$r","var":true},null]}],{"->":"Kiosk.6"},{"c-0":["ev",{"^->":"Kiosk.5.b.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.7.s"},[{"#n":"$r2"}],"\n",{"->":"Kiosk1"},{"#f":5}]}]}],"nop","\n",{"#f":1}],"Kiosk1":[["^Boris looks to you, \"I don't know bud.\"","\n","^\"I thought as much,\" you say.","\n","^You reach to grab the brochure out of Boris' hand but he pulls it away.","\n","^\"Hey! Get your own man,\" he says.","\n",["ev",{"^->":"Kiosk1.0.8.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"You're not reading it any way...\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"Kiosk1.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.8.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^\"The pictures are nice,\" he pouts.","\n","^\"Fine...\" you say.","\n","^You grab a brochure off the kiosk. You open it up and see that it actually doubles as a metro system, not of actual stops, but of writings similar to the note you found behind the door.","\n","^\"This is location data, isn't it?\" you ask while showing the page to Boris.","\n","^He peers over his own brochure and onto yours, \"Yeah!\" he says. \"Would you like me to read it and send over the location data?\"","\n","^\"Sure, that would be great\" you say.","\n","^Boris begins analyzing the location data, and you see a tinge of confusion hit his eyes.","\n","^Andromeda notices too. \"Boris..?\" she says.","\n",["ev",{"^->":"Kiosk1.0.g-0.16.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^\"Is something the matter?\"",{"->":"$r","var":true},null]}],{"c-1":["ev",{"^->":"Kiosk1.0.g-0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.16.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.^.g-1"},{"#f":5}],"#f":5}],"g-1":["^\"No not necessarily,\" he mutters. \"These zones just have strange names to them... they also come with danger warnings. I don't think we're cut out for any of these zones yet at our combat prowess, but I'll give them to you anyway. You can access them from your map feature while at a train station like this one.\"","\n","^\"For now though...\" he continues, \"let's just go wait for the train.\"","\n","^\"Thanks, Boris,\" you say.","\n","^\"No problem, friend...\" Boris coos.","\n","^The party heads back closer to the tracks to wait for the next train.","\n",{"->":"TrainWait"},{"#f":5}]}],{"#f":1}],"TrainWait":["ev",{"VAR?":"FirstTimeOasis"},"/ev",[{"->":".^.b","c":true},{"b":["\n","^\"Where are we heading?\" asks Andromeda.","\n","^\"Whever this train takes us,\" says Boris.","\n","^\"Great plan...\" mutters Andromeda.","\n","^\"Well do you have a better plan?\" snaps Boris.","\n","^\"No,\" says Andromeda.","\n","^\"WELL GOOD THING I'M THE BRAINS OF THIS WHOLE OPERATION.\"","\n",["ev",{"^->":"TrainWait.3.b.13.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"I wouldn't say that...\"",{"->":"$r","var":true},null]}],{"->":".^.^.^.4"},{"c-0":["ev",{"^->":"TrainWait.3.b.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.13.s"},[{"#n":"$r2"}],"\n","^Boris' eyes laser over to you.","\n","^\"Just you watch,\" he says, \"This is exacly how we're going to find Lucy.\"","\n","^\"Alright...\" you concede.","\n","^A gush of begins to fill the chamber well before the train fullfills the space. You watch as carriages rush by and slowly screech to a halt before you. The doors open, inviting you within. The party enters.","\n","^\"Wow... this is fancy...\" says Boris.","\n","^An unfamiliar voice echoes through the cabin \"I'm glad you think so...\"","\n","^The party whips their head towards the voice.","\n","^A young women is sat in one of the chairs. She looks upon you all with eyes filled with sorrow and complacency.","\n","^Boris begins smiling, \"Hi miss...\" he's incredibly giddy with joy.","\n","^\"What's your name?\"","\n","^\"Lucy,\" she responds.","\n","^\"YES! YES! FUCK YEAH I TOLD YOU BOTH,\" Boris shouts as he punches the air in triumph.","\n","^The woman's expression does not change as she looks from Boris to both you and Andromeda.","\n","^\"I take it I'm who you're looking for,\" she says.","\n",{"->":"TrainWait1"},{"#f":5}]}]}],"nop","\n","^The train has arrived, please select a location from your map feature you wish it to take you.","\n",{"#f":1}],"TrainWait1":[[["ev",{"^->":"TrainWait1.0.0.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"Yes, actually.\"",{"->":"$r","var":true},null]}],["ev",{"^->":"TrainWait1.0.1.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^\"We need to murder Andromeda and observe you.\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"TrainWait1.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.0.s"},[{"#n":"$r2"}],"\n","^\"May I ask your names?\" Lucy says.","\n","^\"Sure, I'm Aiolos... probably... and this is Andromeda.\"","\n","^Lucy looks upon you both with contempt, \"Andromeda...\" she whispers. \"I finally get to meet you, after all the anguish you've caused me.\"","\n",{"->":"LucyLament"},{"#f":5}],"c-1":["ev",{"^->":"TrainWait1.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.1.s"},[{"#n":"$r2"}],"\n","^Lucy seems unphased by the notion, \"Andromeda...\" she whispers. \"I finally get to meet you, after all the anguish you've caused me.\"","\n",{"->":"LucyLament"},{"#f":5}]}],{"#f":1}],"LucyLament":[["^Andromeda appears to be frozen in both fear and distress.","\n","^Lucy inhales deeply, \"I've only saw a glimpse of what we've done...\" she begins to shake. \"This whole world is just a manifestation of my grief,\" she says. \"Bruce abandoned me... and he still abandoned you...\" she grits her teeth. \"YOU SELFISH PIECE OF SHIT!\"","\n","^Boris opens his mouth slightly as if he were wanting to interrupt, but he continues to remain silent.","\n","^\"You weren't useful to him anymore, once you got a fucking heart from me,\" she cries. \"And while you got to live a fairy tale in his simulation, I was left here to just rot away and deal with what you've done.\"","\n","^\"You had ever possibility to make things right,\" Lucy shouts, \"You waited for one of Bruce's clones to show up before actually getting up and doing something?\"","\n","^\"Bruce didn't abandon me!\" Andromeda cries. \"Aiolos is living proof of that.\"","\n","^\"Oh spare me,\" Lucy says. \"You have no clue what Aiolos desires.\"","\n","^\"I'm...\" Andromeda says. She stumbles on her words, \"I'm going to stop it. Right here right now, you won't have to live with that grief once I'm gone.\"","\n","^\"You don't know that,\" Lucy says. \"You have no proof that one of our anchors will win over the other.\"","\n","^\"You've thought of the same solution then...\" Boris interrupts.","\n","^\"Yes, I've thought of how stupid that sounds,\" she snarls, \"And another thing, there you go again being selfish. What makes you think that you deserve to die over me?\"","\n","^\"I don't... I just wanted to be able to give you your spark back...\" Andromeda whispers.","\n","^\"We both know we lost it long ago,\" she says. \"The promise of happiness becomes so lackluster once you realize its cost.\"","\n","^Lucy calms down a bit, \"I shouldn't be made at you. I'm sorry. We once were one. You're just the part of me I wish I could forget.\"","\n","^\"Aiolos...\" Lucy says. \"I know not your desires or what you wish to cultivate for this universe. Be it chaos or dignity, I want you to kill me rather than Andromeda. I will be an experiment no longer, or a means of upholding your machine.\"","\n","^\"I was bound here as a means of upholding Andromeda's combat prowess. The process was ineffective. Our anchors had grown too close by the time I was locked away here.\"","\n","^\"Aiolos, no,\" Andromeda interjects, \"I promise you, killing me is the best chance we have of giving Lucy the life she deserves. This whole place will collapse. She won't remember me or anything I've done. Everything for her will go back to the moment we were orginally split.\"","\n",["ev",{"^->":"LucyLament.0.34.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^_Kill Andromeda._",{"->":"$r","var":true},null]}],["ev",{"^->":"LucyLament.0.35.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^_Kill Lucy._",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"LucyLament.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.34.s"},[{"#n":"$r2"}],"\n","^You raise your gun and point it at Andromeda, \"Goodbye,\" you whisper.","\n","^You pull the trigger and the world around you collapses into a flash of white.","\n","ev","str","^Thank you, Aiolos... / Please take care. / I put my full faith in you to stop this madness.","/str","str","^JupiterCapita","/str",{"x()":"FadeOutSeq","exArgs":2},"pop","/ev","\n","done",{"#f":5}],"c-1":["ev",{"^->":"LucyLament.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.35.s"},[{"#n":"$r2"}],"\n","^You raise your gun and point it at Lucy, \"I'm sorry,\" you whisper.","\n","^You pull the trigger and the world around you collapses into a flash of white.","\n","ev","str","^Thank you, Aiolos... / I hope you carry on with dignity. / I hope you see me as an example that Jupiter is not a means to happiness. / It's a means to very destructive end.","/str","str","^JupiterCapita","/str",{"x()":"FadeOutSeq","exArgs":2},"pop","/ev","\n","done",{"#f":5}]}],{"#f":1}],"JupiterCapita":[["^The burst of light dissapates. Memories of a land you've existed in once before rush back to you. The image of Almos and your apartment return to your mind once more.","\n","^You're on a balcony. Almos is here. He sits across from you now, a table between you both.","\n","^\"Oh. We're back?\" he says.","\n",["ev",{"^->":"JupiterCapita.0.6.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"How am I here again?\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"JupiterCapita.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.6.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^You look to your right in distress. The night sky is engulfed with the image of Jupiter. The moon no longer shines upon you both.","\n","^\"How... how are you even here again?\" you say.","\n","^\"I'm not entirely sure... I feel as though I've experienced the world for a while through you,\" he pauses. \"I remember the chateau, Boris, Andromeda, and the train carriage with Lucy...\"","\n","^Almos looks to the horizon, \"You feel it too, right? That feeling of wasting away. The dullness.\"","\n","^\"I do,\" you affirm.","\n","^Almos takes a deep breath, \"Perhaps we're locked away in Bruce's beating heart. I feel myself being inexplicable drawn to the horizon on end. The skies swell, as do I, to the point of bursting. I feel as though he wishes to see us rot.\"","\n","^Almos sinks to gravel, \"This land reeks of his aspirations. We are inexplicable transposed into a land of waste. We burden him. We eat him alive.\"","\n",["ev",{"^->":"JupiterCapita.0.g-0.14.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^\"Does he despise us?\"",{"->":"$r","var":true},null]}],{"c-1":["ev",{"^->":"JupiterCapita.0.g-0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.14.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.^.g-1"},{"#f":5}],"#f":5}],"g-1":["^\"Of course,\" Almos says. \"Don't you feel so fragile and helpless here? The desperation, the monotony, the routine of it all?","\n",["ev",{"^->":"JupiterCapita.0.g-1.2.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-2","flg":2},{"s":["^\"Are we Bruce?\"",{"->":"$r","var":true},null]}],{"c-2":["ev",{"^->":"JupiterCapita.0.g-1.c-2.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.2.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.^.g-2"},{"#f":5}],"#f":5}],"g-2":["^\"Something like that. We are the humanity that holds him hostage, and he's wounded us deeply.\"","\n","^\"What do you mean?\" you ask.","\n","^\"Your a body without heart, I'm a mind without thought,\" he says.","\n","^\"It's silly really... we writhe without reason,\" he sighs. \"You and me both are like... compartmentalizations of Bruce's humanity, meant to be locked away here forever. Bruce had split his conscious into three, of which two split once more.\"","\n",["ev",{"^->":"JupiterCapita.0.g-2.8.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-3","flg":2},{"s":["^\"You and I?\"",{"->":"$r","var":true},null]}],{"c-3":["ev",{"^->":"JupiterCapita.0.g-2.c-3.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.8.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.^.g-3"},{"#f":5}],"#f":5}],"g-3":["^\"Exactly,\" he says, \"And Boris and Rabbit.\"","\n","^\"I thought Bruce had created a new continuum anchor for Boris?\" you ask.","\n","^\"No,\" Almos chuckles, \"His ego got the better of him, and such the rumor spread. He regrets it only because he spread himself so thin.","\n","^Almos takes a breathe, \"The dullness of this world is a means for us to lose our humanity, to break us in such a way that once our anchors reconnect to him his anchor will win over ours. There will be nothing left of us.\"","\n","^\"Think about it... Boris' slide... Rabbit left to wander a meaningless indigo world... our entrapment in stupid routines and bureaucracy...my endless pointless work at the office...\"","\n",["ev",{"^->":"JupiterCapita.0.g-3.10.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-4","flg":2},{"s":["^\"You had a job?\"",{"->":"$r","var":true},null]}],{"c-4":["ev",{"^->":"JupiterCapita.0.g-3.c-4.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.10.s"},[{"#n":"$r2"}],"\n","^\"Er... yes, anyway... It's how I created the proxy world you fell in to. Anyway I have a plan.\"","\n",{"->":"Capita1"},{"#f":5}],"#f":5}]}],{"#f":1}],"Capita1":[["^\"Well the last one didn't work,\" you say. \"We got separated on retransmission.\"","\n","^\"We technically didn't get separated on transmission,\" he interjects. \"After the burning sensation, I felt myself dissapate within you.\"","\n","^\"I was never in control, but I always there with you,\" he says.","\n",["ev",{"^->":"Capita1.0.6.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"How was it so easy for me to forget you?\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"Capita1.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.6.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^\"I assume Bruce used a sort of amnesia on us,\" he says. \"Our anchors merged while we transferred to Jupiter, but it was as if there was a wall between us both. And... now we're separated again.\"","\n","^You pout, \"We had to go through such a convuluted sequence last time though with your plan... I wasn't even aware of more than like half of it..\"","\n","^\"That's why I have a better plan,\" says Almos.","\n","^\"Alright I'm following...\" you say.","\n","^\"What if we combine our anchors before transmission? Bruce was able to semi-block our combination because we weren't fully together at that point.\"","\n","^\"Speaking of combination,\" you interject, \"How haven't we combined just due to time passing?\"","\n","^\"I assume it's because we live too similar lives... opposites attract sort of situation, you know? We're more likely to combine with Bruce first, hence the nature of our imprisonment.\"","\n",["ev",{"^->":"Capita1.0.g-0.14.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^\"How are we going to combine beforehand?\"",{"->":"$r","var":true},null]}],{"c-1":["ev",{"^->":"Capita1.0.g-0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.14.s"},[{"#n":"$r2"}],"\n","ev",{"VAR?":"KillAndromeda"},"/ev",[{"->":".^.b","c":true},{"b":["\n","^\"Andromeda left a gift for us...\" he says.","\n",{"->":".^.^.^.12"},null]}],[{"->":".^.b"},{"b":["\n","^\"Lucy left a gift for us...\" he says.","\n",{"->":".^.^.^.12"},null]}],"nop","\n",{"->":"Capita2"},{"#f":5}],"#f":5}]}],{"#f":1}],"Capita2":["^\"A key of sorts... where we won't have to play by this realms rules. Similar to my proxy world.\"","\n","^Almos lifts his hand in strength. Light fold upon itself over and over in his palm, warping the surrounding air.","\n","^\"The Limitless Blue...\" he announces as a sword begins to coalesce in his hand. The blade hums like a dying star rediscovering its pulse.","\n","^The weapon's edge flickers with effervescent ferocity.","\n","^\"It's our ticket back to Jupiter,\" he says. He turns to you with passion in his eyes,\"Allow me to be your champion, Aiolos. Your alter ego, your fears manifest as strength in the toughest of battles. Grab my hand, before Bruce senses our alignment forming.\"","\n","^You hesitate, \"Almos... Are you sure this is the only way?\"","\n","^He smiles faintly, \"It's reckless, I know... But I don't think Bruce can separate what he can't tell apart.\"","\n","^You reach for his hand with conviction. The moment your skin touches his, the sword solidifies in a stronger burst of light. Almos raises his other hand and drives the blade through his chest.","\n","^No blood pours forth from the wound, only a burst of indigo fractals.","\n","^You feel yourself dissolving, nerves undwinding into a blue atmosphere, your consciousness overwhelmed by his.","\n","^Almos exhales one final breath. The sound is inexplicable, the echo of a collapsing world.","\n","^\"Don't forget who you are when the color fades,\" he says softly.","\n","^The world fractures like glass under an ocean of pressure and a whole new galaxy burst from the seams.","\n","ev","str","^Aiolos... / Come forth, and claim my existence as your own.","/str","str","^Capita3","/str",{"x()":"FadeOutSeq","exArgs":2},"pop","/ev","\n","done",{"#f":1}],"Capita3":["^You're suspending in a sea of shimmering blue. Almos stands before you, half-formed, his body stitched together by constellation fragments.","\n","^\"Aiolos,\" his voice echoes from every direction. \"Come to me, and let me dissapate in your arms.\"","\n","^You approach Almos. Each of your steps warp the space in which you walk.","\n","^\"This sword is a gateway,\" he says. \"A means forward, rather.\"","\n","^He looks down at the blade, its light casting refractions across his face.","\n","^\"It is the first rule written into all worlds. A universe's right to move, change and contradict.\"","\n","^Almos shakes his head, \"Bruce built a world based upon endless statis. As such the weapon is antithesis of his design.\"","\n","^He turns to the vast expanse around him.","\n","^\"It's forged from Lucy and Andromeda dreams. They wished for freedom. They wished to breach a hole in the machine. It's a promise that a 'perfect' order must one day yield.\"","\n","^His voice begins to crack, \"Lucy's universe has just collapsed and from it this sword was born.\"","\n","^He looks to you, his eyes becoming glossy, \"In this moment flicker we can reignite her star. Bruce has no jurisdiction here. He cannot stop us from breaking through.\"","\n","^You look into his eyes. They're already dissolving into starlight.","\n","^He nods slowly.","\n","^You thrust your hand forward. His chest caves inward like liquid glass. You pull free his heart.","\n","^He smiles one last time. \"Do it.\"","\n","^You crush his existence in your hand.","\n","^Almost bursts apart in blue mote. His energy rushes to you, flooding your lungs and your mind.","\n","^You feel invigorated and lethal. You awaken with The Limitless Blue already in your grasp. Your eyes blaze a golden-blue. You swing the sword, slashing the very fabric of this suspended galaxy.","\n","^A white aura shines through the wound you've made, spilling radiance. You're in mania. Your body bursts with unfathamable energy. You force the sword deep into the fabric of the cosmos.","\n","^The skies falls as fragments of the blue universe unravel and dissapates around you.","\n","^The world around you rebuilds itself to the very moment Lucy and Andromeda were stood before you in the train carriage, both wishing death upon themselves.","\n",{"->":"Capita4"},{"#f":1}],"Capita4":[["^\"Aiolos...\" Lucy says. \"I know not your desires or what you wish to cultivate for this universe. Be it chaos or dignity, I want you to kill me rather than Andromeda. I will be an experiment no longer, or a means of upholding your machine.\"","\n","^\"I was bound here as a means of upholding Andromeda's combat prowess. The process was ineffective. Our anchors had grown too close by the time I was locked away here.\"","\n","^\"Aiolos, no,\" Andromeda interjects, \"I promise you, killing me is the best chance we have of giving Lucy the life she deserves. This whole place will collapse. She won't remember me or anything I've done. Everything for her will go back to the moment we were orginally split.","\n","^Your mind is dizzy. You clutch your head in distress and fall to the floor while screaming in agony. You feel Almos crawling through your skin. He surfaces within you and takes your form.","\n","^Your appearance transforms to that of Almos.","\n","^The pain subsides and you rise to your feet once more. Everybody is looking at you in shock.","\n","^\"Aiolos?\" Boris says. \"What happened... you don't look so... robotic and plain anymore.\"","\n","^You don't respond to Boris, but immediately address Lucy. \"I know you don't want to die here. Help me, please.\"","\n","^Lucy just shakes her head, \"I...\"","\n","^You cut her off, eyes flicking to Andromeda, \"Both of you can't back down now, after all he's taken.\"","\n","^\"I want to believe you...\" Lucy says.","\n","^Aiolos' and Almos' voices echo together: \"Then believe me now please, the machine only survives if you stay divided. I saw it happen, the burst of light...\" you say exasperated, \"but this weapon--\"","\n","^You manifest The Limitless Blue, its light burning through the dim carriage.","\n","^\"--this blade was born from your collapse. It remembers everything that Bruce took from you, it remembers the bond you both had. It won't kill you, it will restore you.\"","\n","^Lucy gazes at it, trembling. \"Restore...? But if I use it on Andromeda--\"","\n","^Andromeda steps forward, \"No. Do it. I don't wish to forget or abandon you Lucy.\" Andromeda says. \"I'm so sorry... I'm so so sorry...\" she cries. \"Let me be your strength. We'll end this nightmare together.\"","\n","^\"And then?\" Lucy whispers.","\n","^\"And then we can finally rest. Not as two. As one.\"","\n",["ev",{"^->":"Capita4.0.36.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"Please, I need your strength.\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"Capita4.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.36.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^\"I possess it no longer...\" Lucy says, voice trembling.","\n","^Andromeda grabs The Limitless Blue from you and hands it to Lucy, forcefully clenching her fist around the base of the weapon.","\n","^\"I shall return it to you. Do it, Lucy!\" Andromeda shouts.","\n","^Lucy closes her eyes and drives The Limiltess Blue threw Andromeda's chest.","\n","^Once more, there is no blood, only light. Andromeda dissolves into her, their outlines merging in a wash of gold and azure.","\n","^Lucy gasps, inhaling as though it were her first time. She hugs herself in this moment, shaking with radiance.","\n","^She takes another deep breath and opens her eyes. She turns to one of the windows in the train carriage and peers at her reflection. Lucy and Andromeda's voices layer upon each other in unison, \"We'll carry this burden together. Always.\"","\n",{"->":"Capita5"},{"#f":5}]}],{"#f":1}],"Capita5":[["^Boris begins to hug himself as well, \"WHERE'S MY POWER?\"","\n",["ev",{"^->":"Capita5.0.2.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"We have to find Rabbit first.\"",{"->":"$r","var":true},null]}],["ev",{"^->":"Capita5.0.3.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^\"You don't deserve it...\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"Capita5.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.2.s"},[{"#n":"$r2"}],"\n","^\"You're right,\" he says. \"But where do we even go?\"","\n","^\"Hm...\" you ponder.","\n",{"->":"Capita6"},{"#f":5}],"c-1":["ev",{"^->":"Capita5.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.3.s"},[{"#n":"$r2"}],"\n","^\"WHAT\" he shouts. He lunges at you and grabs hold of your collar. \"NO... I WANT IT... NO... I NEED  IT.\"","\n","^\"You don't need anything, and let me go!\" you shout.","\n","^\"You're right I'm sorry...\" he says.","\n",{"->":"Capita6"},{"#f":5}]}],{"#f":1}],"Capita6":[["^\"Rabbit was last seen at the chateau, or at least fragments of him, wasn't he?\" chimes in Lucy.","\n","^\"So you've gained all of Andromeda's memories, I've taken it?\" asks Boris.","\n","^\"Indeed,\" she affirms. \"We can head back there now and take a look around?\"","\n",["ev",{"^->":"Capita6.0.6.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"Sounds like a good idea.\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"Capita6.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.6.s"},[{"#n":"$r2"}],"\n","^\"I AGREE!\" Boris shouts.","\n","^Andromeda and you both glare at him.","\n","^\"I mean... I agree...\" he whispers. \"Let's just go, get out your map and teleport to Galagos, I'll meet ya'll there.\"","\n","ev",false,"/ev",{"VAR=":"FirstTimeOasis","re":true},"done",{"#f":5}]}],{"#f":1}],"NeonCityHolding":[["^A neon city materializes before you as you teleport to the coordinates. You seem to be in a holding area prior to the entrance. A large banner streams in front of you reading \"Welcome To Salvation.\"","\n","ev",{"VAR?":"FirstTimeNeonCity"},"/ev",[{"->":".^.b","c":true},{"b":["\n","^Boris materializes besides you. Lucy follows suite soon after.","\n","^\"Hmph...\" Boris exhales.","\n","^\"Certainly a bold statement as greeting,\" says Lucy.","\n","^Boris looks around confused, \"Where's Rabbit?\"","\n","^\"Not sure...\" answers Lucy. \"I'm sure he'll turn up soon. He seems like the kind that likes to work alone.\"","\n","^\"I guess...\" says Boris. \"So... is the city's name Salvation?\"","\n",["ev",{"^->":"NeonCityHolding.0.5.b.13.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"Probably.\"",{"->":"$r","var":true},null]}],["ev",{"^->":"NeonCityHolding.0.5.b.14.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^\"I don't know, let's ask Vireo.\"",{"->":"$r","var":true},null]}],{"->":".^.^.^.6"},{"c-0":["ev",{"^->":"NeonCityHolding.0.5.b.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.13.s"},[{"#n":"$r2"}],"\n","^\"Yeah... probably...\" Boris chirps.","\n","^You glance to him, to which he returns a cunning glare.","\n","^\"Yeah... probably...\" you respond.","\n",{"->":"NCH1"},{"#f":5}],"c-1":["ev",{"^->":"NeonCityHolding.0.5.b.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.14.s"},[{"#n":"$r2"}],"\n","^\"You're not very helpful are you?\" Boris responds.","\n",{"->":"NCH1"},{"#f":5}]}]}],"nop","\n",["ev",{"^->":"NeonCityHolding.0.8.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^_Enter the city._",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"NeonCityHolding.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.8.s"},[{"#n":"$r2"}],"\n",{"->":"NCHub"},{"#f":5}]}],{"#f":1}],"NCH1":[["^\"Anyway...\" Lucy says. \"It doesn't matter what the place is called let's just get going.\"","\n","^The party advances towards the city, only to be stopped almost immediately by a toll gate.","\n","^There appears to be a single guard standing watch. The guard overlooks a booth.","\n","^Boris walks ahead of the party and approaches the booth. \"10 pigeon bucks?! What the fuck is that.\"","\n","^The guard looks longingly towards Boris \"Art...\"","\n","^\"...what?\" asks Boris.","\n","^The guards eyes begin to shimmer, \"It's art... everything is art here. Vireo is so insipirational... If only I had a fraction of his talent... haaaaah... ohhhhh...\"","\n","^The guard begins feeling all over their body.","\n","^\"You're making me very uncomfortable...\" says Boris.","\n","^Lucy rushes to Boris side and whispers to him, \"Boris... just remember none of these people are real... they're Vireo's creations. Whatever you do, try not to provoke anybody.\"","\n","^\"Um... okay...\" he whispers back.","\n","^He looks back towards the guard, \"So... um... hate to interrupt whatever is going on here but what is pigeon bucks.\"","\n","^The guard takes a deep breathe and returns their attention to Boris. \"It's... a feeling... almost... The concept of currency, pigeons, how intrinsically they are so connected but not at the same time...\"","\n","^The guard grabs their head in both hands and grovels, \"It's just so... so... BRILLIANT.\"","\n",["ev",{"^->":"NCH1.0.28.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^Maybe we can exchange Boris for entry...",{"->":"$r","var":true},null]}],["ev",{"^->":"NCH1.0.29.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^Maybe there's another way in...",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"NCH1.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.28.s"},[{"#n":"$r2"}],"\n","^\"HEY I'M NOT A PIGEON MAN,\" Boris shouts.","\n","^\"Alright let's just calm down...\" Lucy says.","\n","^Lucy begins looking around as if looking for something.","\n",{"->":"NCH2"},{"#f":5}],"c-1":["ev",{"^->":"NCH1.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.29.s"},[{"#n":"$r2"}],"\n",{"->":"NCH2"},{"#f":5}]}],{"#f":1}],"NCH2":[["^\"I'm not sure there is another way in...\" Lucy says. \"Just look at the surrounding banister, there's nowhere to go besides through the gates. We'll just fall through the realm.\"","\n","^\"There's no need for that, friends,\" the guard says. \"Perhaps I could look the other way if you can demonstrate to me a display of art!\"","\n",["ev",{"^->":"NCH2.0.4.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"Display of art?\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"NCH2.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.4.s"},[{"#n":"$r2"}],"\n","^\"DISPLAY THIS BITCH,\" Boris shouts.","\n","^\"STOP!\" Lucy and you shout in unison.","\n","^Boris pulls out his tome and fires a tetra burst at the guard.","\n","^The bolt strikes the guard hard, but they barely stagger.","\n","^\"Ohhh.... HAAAAH... OHHH... THAT... WAS... MARVELOUS...\" the guard shrieks in ecstacy.","\n","^\"They're a fucking freak,\" Boris screeches. \"Are you both with me or not...\"","\n","^Lucy and you look to him wide-eyed.","\n","^\"Please help...\" he mumbles.","\n","^Prepare for combat.","\n","ev","str","^NeonGuard","/str","str","^NCH3","/str",{"x()":"StartCombat","exArgs":2},"pop","/ev","\n","done",{"#f":5}]}],{"#f":1}],"NCH3":[["^The guard falls to their knees and tosses their hands to the sky.","\n","^\"Oh... How beautiful that truly was,\" the guard begins to cry. \"Was this your reckoning Vireo? I'm at the edge of salvation, I've served here all my life, and here I rest... Here... I die...\"","\n","^The guard dematerializes into a flurry of flower petals.","\n","^\"I'm getting fucking shivers over here, let's get to the city now...\" Boris says.","\n","^\"Since when have you become such a brute? Get it together that was incredibly risky,\" Lucy says.","\n","^\"DON'T TELL ME WHAT TO DO!\" yells Boris.","\n","^\"YOU'RE GOING TO GET US ALL KILLED!\" responds Lucy.","\n","ev",{"VAR?":"ChosePigeon"},"/ev",[{"->":".^.b","c":true},{"b":["\n",["ev",{"^->":"NCH3.0.17.b.1.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"Slow your roll pigeon bro.\"",{"->":"$r","var":true},null]}],{"->":"NCH3.0.18"},{"c-0":["ev",{"^->":"NCH3.0.17.b.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.1.s"},[{"#n":"$r2"}],"\n","^\"IF YOU SAY THAT ONE MORE TIME!\"","\n","^\"ALRIGHT STOP SHOUTING!\" yells Lucy.","\n",{"->":"NCH4"},{"#f":5}]}]}],"nop","\n",["ev",{"^->":"NCH3.0.20.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"CAN WE ALL STOP SHOUTING!\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"NCH3.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.20.s"},[{"#n":"$r2"}],"\n","^\"YES, FINE, DAMN!\" yells Boris.","\n",{"->":"NCH4"},{"#f":5}]}],{"#f":1}],"NCH4":[["^Boris takes a few deep breaths, \"I feel like this place is making me unecessarily angry. Maybe it's just super bright.\"","\n",["ev",{"^->":"NCH4.0.2.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"Have you eaten recently?\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"NCH4.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.2.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^\"No...\" Boris pouts.","\n","^\"Okay... we are robots you know we don't have to eat things...\" says Lucy.","\n","^\"But I made it a personality trait of mine to be hangry,\" responds Boris.","\n",["ev",{"^->":"NCH4.0.g-0.6.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^\"...\"",{"->":"$r","var":true},null]}],["ev",{"^->":"NCH4.0.g-0.7.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-2","flg":2},{"s":["^\"Alright, let's go find you some food.",{"->":"$r","var":true},null]}],{"c-1":["ev",{"^->":"NCH4.0.g-0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.6.s"},[{"#n":"$r2"}],"\n","^\"I guess we're going food searching...\" says Lucy.","\n","^The party walks through the entrance and into the city.","\n",{"->":"NCHub"},{"#f":5}],"c-2":["ev",{"^->":"NCH4.0.g-0.c-2.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.7.s"},[{"#n":"$r2"}],"\n","^The party walks through the entrance and into the city.","\n",{"->":"NCHub"},{"#f":5}],"#f":5}]}],{"#f":1}],"NCHub":[["^The city's building and skylines unfold towards the sky as you walk beneath them. Everything--the ground, the building's walls, and the store fronts are lined with neon lines that intertwine and radiate various obnoxious colors. Signs for all sorts of services and shops jut from walls. Up above soaring in the sky are flying trains that seem to be suspended via magnetic lines all throughout the skies.","\n","^You are in but a small fragment of this great expanse. Buildings can be seen towering in the distance, all created from a slightly reflective black composite material. No face of any building is flat, and is instead textured by small cubes of this mysterious material jutting at various height from each wall--and even the ground.","\n","^The whole city, or at least this portion, feels eerily empty and quiet.","\n","ev",{"VAR?":"FirstTimeNeonCity"},"/ev",[{"->":".^.b","c":true},{"b":["\n","^Banners line the street advertising a play--\"Only in theaters today! The Tragedy Of Artifice And His Several Angels.\"","\n","^\"Do you all see those banners?\" asks Lucy. \"It's a play by... Vireo?\"","\n","^A call echoes through the empty street, \"Did someone say Vireo?\"","\n","^The whole party looks in fear towards the noise.","\n","^A man emerges from one of the shop fronts, \"Oh... I've never seen you bunch around here before. You must be new here!\"","\n","^Boris starts coughing as a means for improvisation, \"Uh... erm.. *cough*... yes, we are new arrivals. We are just so... so... in love with the architecture here!\"","\n","^\"Oh it's wonderful isn't it,\" the man trembles. \"So inspiring, so dilute. The neon lights bring out the depravity of the Eidolon bricks. Your own reflection in everything... washed in everlasting void. The neon...\" he pauses. \"Oh... the neon... a smear of color, the lines that divide and wish to cut apart the very fabric that constitutes this world. In vain... always in vain--a pity existence.\"","\n","^Boris opens his mouth as if to say something but the man cuts him off.","\n","^\"Notice how the lines cross but never join... the meeting between people, brief moments, but never enriching. Each invidual bursting with color but they burst alone... they burst alone....\" he cries. \"The neon, the people, are meaningless against the grandiose and overpowering consumption of the dark energies that encompass the Eidolon. In the end that connection is meaningless, but the lines never end, each being suspended in continuity. Always forwards... always forwards...\" the man dozes.","\n","^\"Forwards towards... what?\" Lucy asks.","\n","^\"Who knows?\" he responds. \"It's all just art. At least, that's my interpretation of the great work of Vireo.\"","\n","^Boris leans into you, \"Yo... this guy-\"","\n","^\"Cut it out...\" you hiss.","\n","^\"Speaking of Vireo...\" says Lucy. \"We're actually really big fans, and were wondering where to see his play?\"","\n","^The man smiles, \"Ticket booth is down the street and you take a right. You can't miss it.\"","\n","^\"Thanks!\" Lucy smiles. \"I can't wait!\"","\n","^Lucy and you are about to walk away from the man, but Boris stands his ground.","\n","^\"Hey man...\" Boris announces to the guy.","\n","^Lucy and you both grit your teeth in fear of what he might say.","\n","^Boris smiles, \"I'm hungry and it seems you got a nice shop here--it's a bakery right?\"","\n","^\"Yes! My pieces are artisanal wonders, they taste amazing, and-\"","\n","^\"Yeah, yeah, do you have muffins?\" Boris interrupts.","\n","^\"...um... yes...\" the man responds. \"But don't you want something more exciting?\"","\n","^\"No,\" responds Boris.","\n","^\"Alright that will be 5 pigeon bucks please,\" he responds dully.","\n","^\"Can I repay you in art?\" asks Boris.","\n","^\"Sure!\" the man becomes excited again.","\n","^\"Alright I need the muffin though... as a prop... to show you,\" responds Boris.","\n","^\"Oh of course...\" the man rushes into the store and returns with one giant gooey choclate muffin and hands it to Boris.","\n","^\"Alright, watch closely...\" Boris says. He proceeds to shove the whole thing in his mouth in one bite. He chews for a solid thirty seconds before finally swallowing.","\n","^\"See how beautiful that was?\" asks Boris.","\n","^The man is enamored, \"I do... I really do... The glutenous devour, the jab at capitalism, the poor man's performance for but a morself of sustenance, the lack of shame-\"","\n","^\"Alright thats enough,\" says Boris.","\n","^The man now looks at Boris with a tinge of upsetness.","\n","^\"I mean... you flatter me... really... haha... I'm getting all flustered here!\" says Boris.","\n","^\"Oh...\" the man let's out a slight chuckle. \"I didn't mean to be so overwhelming. I wonder if Vireo feels the same way...\"","\n","^In the man's pondering the party is able to slip away.","\n","^\"Alright I'm sick of these crazy people... but at least I'm fed. Let's head to ticket booth. The guy said it's to the right,\" commands Boris.\"","\n",{"->":".^.^.^.10"},null]}],"nop","\n",["ev",{"^->":"NCHub.0.12.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^Turn left down the street.",{"->":"$r","var":true},null]}],["ev",{"^->":"NCHub.0.13.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^Turn right down the street.",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"NCHub.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.12.s"},[{"#n":"$r2"}],"\n","ev",{"VAR?":"FirstTimeNeonCity"},"/ev",[{"->":".^.b","c":true},{"b":["\n","^\"Now's not the time to wander Aiolos... we can explore later, let's get the tickets first.\"","\n","^You head to the right.","\n",{"->":"RightStreet"},{"->":".^.^.^.12"},null]}],[{"->":".^.b"},{"b":["\n",{"->":"LeftStreet"},{"->":".^.^.^.12"},null]}],"nop","\n",{"#f":5}],"c-1":["ev",{"^->":"NCHub.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.13.s"},[{"#n":"$r2"}],"\n",{"->":"RightStreet"},{"#f":5}]}],{"#f":1}],"LeftStreet":["^No story here.","\n","done",{"#f":1}],"RightStreet":[["^The party wanders down the street. And takes a right at the intersection.","\n","ev",{"VAR?":"FirstTimeNeonCity"},"/ev",[{"->":".^.b","c":true},{"b":["\n","^Lucy points to something in the distance, \"I think I see the ticket booth over there.\"","\n","^The party approaches the ticket master. She sits behind a glass window. The booth itself seems embedded in the building itself. Through the glass you can see a crammed room with a couple of devices meant to print and distribute tickets.","\n","^\"Is this the theater?\" asks Boris to the ticket master.","\n","^\"No...?\" responds the woman. \"This is the ticket booth to the theater. No sales location is actually attached to the theater itself.\"","\n","^\"Alright,\" says Lucy. \"Thanks for the information... um... can we have three tickets to-\"","\n","^\"The Tragedy Of Artifice And His Several Angels?\" she interupts. \"That will be 500,000 pigeon bucks.\"","\n","^\"WHAT!\" shouts Boris.","\n","^Boris reaches for his tome again, but you grab hold of his arm tight to restrain him.","\n","^\"Well... it's a Vireo production, and it's exclusive tonight. Genius has no price, you know.\"","\n","^\"Will you accept a performative dance as payment?\" says Boris.","\n","^\"No...\" mumbles the woman. \"We only accept pigeon bucks here.\"","\n","^The party walks away from the counter to console one another.","\n","^\"So... um... where are we getting that kind of cash?\" Lucy asks.","\n",["ev",{"^->":"RightStreet.0.5.b.27.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"Start stripping, Boris.\"",{"->":"$r","var":true},null]}],["ev",{"^->":"RightStreet.0.5.b.28.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^\"Maybe there's some work we can find around here?\"",{"->":"$r","var":true},null]}],{"->":".^.^.^.6"},{"c-0":["ev",{"^->":"RightStreet.0.5.b.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.27.s"},[{"#n":"$r2"}],"\n","^\"There was a club back there, wasn't there?\" Lucy says.","\n","^Boris looks horrified, \"You all can't seriously be considering this...\"","\n",{"->":"RS1"},{"#f":5}],"c-1":["ev",{"^->":"RightStreet.0.5.b.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.28.s"},[{"#n":"$r2"}],"\n","^\"Lets open a bakery,\" Boris smiles.","\n","^\"You would like that wouldn't you...\" sneers Lucy.","\n",{"->":"RS1"},{"#f":5}]}]}],"nop","\n","^This road leads down to a dead end. The ticket booth is here. A couple of benches line the neon streets.","\n",["ev",{"^->":"RightStreet.0.10.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^_Head down the left path._",{"->":"$r","var":true},null]}],["ev",{"^->":"RightStreet.0.11.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^_Head back to the main plaza._",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"RightStreet.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.10.s"},[{"#n":"$r2"}],"\n",{"->":"LeftStreet"},{"#f":5}],"c-1":["ev",{"^->":"RightStreet.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.11.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.^"},{"#f":5}]}],{"#f":1}],"RS1":[["^\"Pssst... over here,\" a voice echoes from the top the street.","\n","^The party approaches a hooded figure.","\n","^\"Hellooo,\" Boris belts.","\n","^\"SHHH!\" the guy shouts.","\n","^\"Oh, sorry,\" he whispers.","\n","^\"The name's Serzh, and I got a proposition for all of you.\"","\n","^The party stares at him blankly.","\n","^\"It's not some stupid art thing is it?\" asks Boris.","\n","^\"No... well... yes... in a way. Many see it as art and pay top dollar to watch it all happen.\"","\n","^\"Is it porn?\" asks Boris.","\n","^Lucy's expression went from intrigue to disgust \"What the fuck Boris...\"","\n","^\"It's a genuine question, y'know\" he shrugs.","\n","^Serzh shoots the party a smile, \"Some may find it erotic, I suppose...\"","\n","^Boris starts chuckling, \"See! I knew it.\"","\n","^\"It's an underground fighting ring... the winner takes home the grand prize of a million pigeon bucks,\" Serzh says.","\n","^\"Well that's convenient,\" says Boris. \"And I suppose your going to say something like,\" Boris lowers his tone and makes his voice gravely like Serzh's, \"I'm not much a fighter, but I'll take a clean split of the mil for giving you all the intel on this operation. You all look like a strong bunch... you can fight in my steed.\"","\n","^\"...well...yes,\" Serzh confirms. \"You all in?\"","\n","^\"Yeah, let's do it... this'll be a warmup,\" Lucy jests.","\n","^Serzh looks a little worried at this sentiment, \"Eh... I'm not sure about that... seems like they've got a strong lineup this time around...\"","\n","^Lucy senses his worry, \"Trust me, I'm not being overconfident... lead the way,\" she commands.","\n","^\"Alright, follow me\" he shrugs.","\n","^The party follows him to the end of the street towards a dead end.","\n","^\"I think this guy is about to mug us...\" Boris says.","\n",["ev",{"^->":"RS1.0.46.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"We have nothing to steal.\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"RS1.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.46.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^\"Oh yeah, you're right!\" Boris cheers.","\n","^Serzh approaches a wall at the end of the alleyway and starts prodding at it methodically.","\n","^You all watch in awe and strange beeping noises can be heard emitting from the wall.","\n","^\"There!\" Serzh says in triumphantly. A part of the wall seemingly dissapears.","\n","^Serzh ushers everyone through the doorway, \"Quickly, it will regenerate soon.\"","\n","^You all shuffle through the opening before it takes form once more behind you.","\n","^\"Follow,\" Serzh says.","\n","^It seems as though you are walking through a labyrinth of corridors. There are barely and light sources, so the party is fully relying on Serzh for direction.","\n","^The thin corridors soon open up to a giant room with a cage in the middle. Rows upon rows of seats are situated in a circular manner overlooking the cage.","\n","^\"Here we are,\" Serzh snickers. \"Let's get to our dressing room and we can talk about strategy and get-up.\"","\n",{"->":"DressingRoom"},{"#f":5}]}],{"#f":1}],"DressingRoom":[["^The party makes there way through another set of back rooms before reaching a door boldly labeled with \"Serzh.\"","\n","^\"So... you've scammed people before,\" says Boris.","\n","^\"I procure talent, and what of it,\" Serzh hisses.","\n","^\"Nothing... just checking...\" Boris smirks.","\n","^Serzh send Boris an aggressive glance, he squints his eyes, \"Don't bite the hand that feed you, okay? You want in to Vireo play don't you?\"","\n","^\"Just... address me from now on,\" Lucy interjects. \"Are friend has gotten a little bit of a tantrum lately...\" Lucy glares to Boris now, \"I suppose it's because a certain important someone called him out on his love?\"","\n","^\"NO!\" Boris shouts.","\n","^Lucy prompts once more \"Well let's address it now-\"","\n","^\"NO!\" Boris shouts, \"I said no, I mean no.\"","\n","^Lucy crosses her arms as if in pout, \"Fine, I'll let it go for now-\"","\n","^\"You'll let it go forever,\" it seems like Boris is on the verge of tears.","\n",["ev",{"^->":"DressingRoom.0.22.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^_Hug Boris._",{"->":"$r","var":true},null]}],["ev",{"^->":"DressingRoom.0.23.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^_Ignore Boris._",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"DressingRoom.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.22.s"},[{"#n":"$r2"}],"\n","^You try to console Boris, but he just pushes you away.","\n",{"->":"DR1"},{"#f":5}],"c-1":["ev",{"^->":"DressingRoom.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.23.s"},[{"#n":"$r2"}],"\n",{"->":"DR1"},{"#f":5}]}],{"#f":1}],"DR1":[["^\"So... strategy?\" you ask Serzh. \"Who are we up against.\"","\n","^\"First opponent should be a breeze,\" Serzh affirms... \"But... that's not the immediate problem. You all are newcomers. You have to win the audience's favor, or else nobody is going to bid on your success.\"","\n","^\"YOU'RE GAMBLING ON US AS WELL?!\" Boris shouts.","\n","^\"Not me... not allowed,\" he laughs. \"Some friends of mine.\"","\n","^Boris gives Serzh a dissaproving glare.","\n","^\"Anyway... you all need a cool name... and maybe some thing to spruce up your outfits. What kind of name are ya'll thinking for your group?\"","\n",["ev",{"^->":"DR1.0.12.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"Galactic Meltdown.\"",{"->":"$r","var":true},null]}],["ev",{"^->":"DR1.0.13.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^\"Muffin Smashers.\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"DR1.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.12.s"},[{"#n":"$r2"}],"\n","^\"Alright... Galatic Meltdown it is, sounds rad, man.\"","\n","ev",1,"/ev",{"VAR=":"WhichName","re":true},{"->":"DR2"},{"#f":5}],"c-1":["ev",{"^->":"DR1.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.13.s"},[{"#n":"$r2"}],"\n","ev",2,"/ev",{"VAR=":"WhichName","re":true},"^Serzh looks to you in confusion, \"Um... are you sure?\"","\n","^\"YES\" screams Boris. \"YES.\"","\n","^\"Al- Alright then. Muffin Smashers it is.\"","\n",{"->":"DR2"},{"#f":5}]}],{"#f":1}],"DR2":[["^\"Now for costumes...\" Serzh says.","\n","^\"I don't think that'll be necessary,\" says Lucy. \"Take a look.\"","\n","^Lucy let's Andromeda's energy overwhelm her. She burns a brilliant rose-gold color as her entire appearances becomes android like. She is very resemblant of Andromeda, her outfit is that of a galatic guardian.","\n","^Lucy's voice can be heard overlaying with Andromeda's, \"Cool look, huh?\"","\n","^Serzh looks almost distrubed, \"I'm incredibly intrigued... oh... the crowd is going to love this!\"","\n","^He looks wildly around the room, \"Can all of you do that?\"","\n","^\"Sore subject...\" Lucy giggles.","\n","^Serzh looks over to you and Boris.","\n","^Boris is the only one of you two that looks like he's about to cry.","\n",["ev",{"^->":"DR2.0.18.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"I can as well.\"",{"->":"$r","var":true},null]}],["ev",{"^->":"DR2.0.19.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^\"I'm not sure I could do it on demand.\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"DR2.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.18.s"},[{"#n":"$r2"}],"\n",{"->":"DR3"},{"#f":5}],"c-1":["ev",{"^->":"DR2.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.19.s"},[{"#n":"$r2"}],"\n","^\"It's all just confidence Aiolos,\" Lucy beams. \"He can do it too Serzh, trust me.\"","\n",{"->":"DR3"},{"#f":5}]}],{"#f":1}],"DR3":[["^\"Alright then,\" Serzh snuffs. \"Your first match is against Celestial Opposition. They're a group that's skilled in ranged magic and arts. Think you can handle that?\"","\n",["ev",{"^->":"DR3.0.2.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"Absolutely.\"",{"->":"$r","var":true},null]}],["ev",{"^->":"DR3.0.3.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^\"I'm not too sure.\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"DR3.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.2.s"},[{"#n":"$r2"}],"\n","^\"When's the match?\" Boris droops.","\n",{"->":"DR4"},{"#f":5}],"c-1":["ev",{"^->":"DR3.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.3.s"},[{"#n":"$r2"}],"\n","^\"Don't... listen to him... we got this,\" Boris droops. \"When's the match?\"","\n",{"->":"DR4"},{"#f":5}]}],{"#f":1}],"DR4":["^Serzh smirks, \"Don't you hear the crowd roaring out there? It starts soon, champs.\"","\n","^The party stands near the door but only light mumbles can be heard--","\n","^\"WELCOME---AS YOU ALL KNOW--MY NAME IS PIVIN--ARE YOU READY--ART UNFOLD.\"","\n","^A sea of chanting rumbles the very walls of the room your in.","\n","^\"I'll bring you to the cage,\" Serzh says.","\n","^Serzh leads the party through the halls once more towards the arena room. The crowd roars as soon as they catch sight of you in the party. Piving gets on the microphone, \"INNN THE ARENA, WE HAVE OUR VERY OWN DIVINE TRILLLOOOGGGYYY--CELESTIAL OPPOSITION. ANNNDDD COMING IN HOT IS...\"","\n","ev",{"VAR?":"WhichName"},1,"==","/ev",[{"->":".^.b","c":true},{"b":["\n","^\"GALAAACTIC MELTDOOOWWWNNN. CAN THESE NEWCOMERS RESIST THE ULTIMATE OPPOSITION?\" Pivin roars.","\n",{"->":"DR4.19"},null]}],[{"->":".^.b"},{"b":["\n","^\"Muffin Smashers? *ahem* I MEAN MUFFIN SMASHERRRS. SOFT BUT DEADLY, HUH? CAN THESE NEWCOMERS RESIST THE ULTIMATE OPPOSITION\" Pivin roars.","\n",{"->":"DR4.19"},null]}],"nop","\n","^Serzh lets the party into the cage, \"Good luck you all, I'm counting on you,\" he says in farewell as he locks you within the cage.","\n","^Boris cracks his knuckles before whipping out his tome. \"Alrighty I'm ready.\"","\n","^He looks to you and Lucy as if prompting you both to get ready. Lucy manifests her weapon.","\n","^Prepare for combat.","\n","ev","str","^Celestial Opposition","/str","str","^DR5","/str",{"x()":"StartCombat","exArgs":2},"pop","/ev","\n","done",{"#f":1}],"DR5":["^You hear Serzh shouting hysterically for you. He's fired up, and so is the party.","\n","^The crowd roars for you. \"THAT...WAS...INCREDIBLY... THESE NEWCOMERS TORCHED THE OPPOSITION, BUT CAN THEY HANDLE THE HEAT BACK?\" screams Pivin. \"NEXT UP IN THE RING IS KAELIX AND HIS CONSTRUCTS.\"","\n","^\"YOU ALL GOT THIS,\" Serzh shouts throught he crowd's cheering. \"THIS GUY IS FIERCE JUST WATCH OUT. HIS CONSTRUCTS ENABLE HIM TO BE STRONGER, TAKE THOSE OUT BEFORE DEALING WITH HIM.\"","\n","^Kaelix leaps into the ring, a magnificent cape flowing begind him. He smirks to the party, his teeth are sharp and jagged. \"READY TO DIE?!\" he snarls to the party. His eyes are wild. He acts as though he exists beyond his flesh.","\n","^\"FAT CHANCE!\" Boris shouts back.","\n","^\"Careful Boris...\" Lucy says. \"I think this guy is on some sort of enhancements...\"","\n","^\"DRUGS?\" Boris shouts.","\n","^Kaelix just laughs and takes in a deep breathe. The party witnesses Kaelix body spread thin as if smeared himself across a canvas. He becomes a blurred furry of color before three identical Kaelix materialize from the mist.","\n","^Each version looks to the party. Each run their hands through their hair of flames as if in taunt, \"PREPARE FOR COMBAT!\" they hiss simultaneously.","\n","ev","str","^Kaelix","/str","str","^DR6","/str",{"x()":"StartCombat","exArgs":2},"pop","/ev","\n","done",{"#f":1}],"DR6":["^\"AHHH THAT WAS SPICY...NOT! AHAHA!\" Boris shouts.","\n","^A camera attached to a drone zooms enters the ring and focuses in on Boris. He sticks his tongue out and points to eat while shaking his head. The crowd loves it. \"BOR-IS! BOR-IS! BOR-IS!\" they chant.","\n","^Boris' image is being mirrored on jumbotron after jumbotron high above in the crowd. The party looks up at the rows and rows of onlookers suspended high above the arena.","\n","^Boris is fired up. His spirit is infectious for you and Lucy.","\n","^\"HEY! HEY! DON'T GET TOO WORKED UP!\" you hear Serzh shouting from the sidelines. \"NEXT FIGHT IS NO JOKE YA'LL FOCUS UP.\"","\n","^\"SHE NEEDS NO INTRODUCTION YALL, THE PRINCE OF DESTRUCTION--SYRION.\"","\n","^A burst of purple fog manifests at the other end of the arena. Manic laughter can be heard permeating from every edge of the arena. \"Oh... a crew... a pity, there's only one of me to entertain you all.\"","\n","^Out from the mist emerges Syrion. She looks absolutely weightless, her clothing drapes effortlessly over her as if she were a ghost. Her eyes glisten an opaque lavender. She glides effortless to the center of the arena and pulls out a paintbrush.","\n","^\"GORGEOUS AS EVER--SYRION YOU CHARMER! WATCH OUT--HER WORK IS BEAUTIFUL BUT DEADLY... CAN THE NEWCOMERS SURVIVE HER EPHEMERAL MAGICS?\" Pivin shouts over the speaker.","\n","^You turn to Serzh, realizing he's trying to tell you something. The crowd is far too loud-","\n","^\"Face me!\" Syrion commands. Her voice drops and becomes calm and snake-like, \"I shall paint you a better reality, one where you will succumb to my pen. I will be your undone.\"","\n","^The ground begins to shift beneath you. The arena erupts in a series of dimensional tears.","\n","^Pivin comes on the loud speaker, \"THE PARTY IS BEING TAKEN TO SYRION'S DOMAIN--OH... HER BEAUTIFUL YET WICKED TRICKERY... WE'LL SEND IN A CAMERA TO FOLLOW THE ACTION! GOOD LU-\"","\n","^Pivin's voice is swallowed away. The party is enclosed in a whole different dimension. Syrion stands ethereal before you all.","\n","^Boris looks terrified, \"Where the hell are we!?\" He's absolutely frozen with fear.","\n","^\"I don't know,\" affirms Lucy. \"Don't be scared, we can do this!\"","\n","^Syrion just smiles, \"Oh you miserable bunch, I'll take away your pain, I'll paint you a beautiful life.\"","\n","^Syrion begins waving her paintbrush about.","\n","^\"NO TIME TO WASTE!\" shouts Lucy. \"IT'S TIME TO ENGAGE. PREPARE FOR COMBAT!\"","\n","ev","str","^Syrion","/str","str","^DR7","/str",{"x()":"StartCombat","exArgs":2},"pop","/ev","\n","done",{"#f":1}],"DR7":["^The alternate dimension collapses and the party returns back the arena. The crowd awaits Boris' victory taunt. A camera gets close to his face. Boris is panting heavily, \"Ahem... Huugh,\" he coughs, \"Not gonna lie that was kind of hard ya'll like no joke...\" The crowd is silent. Boris looks around at the quiet crowd up above. \"I think I need a smoke break,\" he smirks. He materializes a cigarette, takes a hit and blows out purple smoke before quickly waving the cloud away. He points the camera, cigarette between his fingers. Boris puffs his chest, \"Nah... THIS BRAND IS TRASH!\" he shouts pompously before tossing the cigarette to the side.","\n","^The crowd goes hysterical. The arena roars louder than they've ever done before.","\n","^\"PUT THAT HANDSOME MUG ON A T-SHIRT! AHAHAHA!\" shouts Pivin.","\n","^Lucy and you share a glance and just smile at one another.","\n","^\"WHAT AN ENTHUSIASTIC AUDIENCE WE HAVE TONIGHT! LET'S KEEP THAT ENERGY UP AND FIERCE YA'LL! WE HAVE ONE MORE MATCH FOR ALL YOU LOVELY FOLK TONIGHT. OUR DEADLY TRIO WILL FACE...DRUM ROLL PLEASE... ... ...RABBIT!\"","\n","^\"Rabbit?\" the party chirps in unison.","\n","^The party watches Rabbit walk casually up to the gate to the cage and let himself in. He looks upon the party, \"Oh good, you all had the same idea as me.\"","\n","^The party looks upon him in utter shock.","\n","^\"Come on now, let's get this over with...\" Rabbit mumbles. \"The show is to begin soon, we need to get the cash and get out.\"","\n","^\"GET READY, GET SET, FIGHT!\" Pivin shouts.","\n","^The party doesn't move a muscle.","\n","^Rabbit manifests his gun in hand and walk to the center of the arena. He pull the gun to his own head. \"See you at the show...\" He pulls the trigger and disappears into a constellation of stars.","\n","^The crowd is silent.","\n","^The party is silent.","\n","^\"A... FORFEIT?!?\" Pivin screams in disbelief.","\n","ev",{"VAR?":"WhichName"},1,"==","/ev",[{"->":".^.b","c":true},{"b":["\n","^\"OH...\" she says, \"I SEE... JUST THE OVERWHELMING THOUGHT OF SUCCUMBING TO OUR GALACTIC MELTDOWN HAS LEFT OPPONENTS BACK PEDALLING! A VICTORY I SAY! AND A GRAND ONE AT THAT!\"","\n",{"->":"DR7.37"},null]}],[{"->":".^.b"},{"b":["\n","^\"OH...\" she says, \"I SEE... JUST THE OVERWHELMING THOUGHT OF SUCCUMBING TO OUR MUFFIN SMASHERS HAS LEFT OPPONENTS BACK PEDALLING! A VICTORY I SAY! AND A GRAND ONE AT THAT!\"","\n",{"->":"DR7.37"},null]}],"nop","\n","^The crowd goes bat-shit crazy.","\n","^\"A BEAUTIFUL DISPLAY OF ART!\" Pivin weaps over the microphone. \"PLEASE JOIN US NEXT TIME AT OUR NEXT EXHIBIT! UPCOMING IN A WEEK!\"","\n","^The droves of people begin filling out of the arena theater. Serzh enter to ring and comes to congradulate you all.","\n","^\"Well... I knew you all could do it,\" his lip and nose begin to shiver as he weeps, \"Thank you for making me a rich man today...\"","\n","^\"Yeah, yeah spare the act, send us the pigeon bucks,\" commands Lucy.","\n","^\"Ooh, attidude,\" chirps Boris.","\n","^\"And you better give us a little extra,\" Lucy demands, \"We need one more ticket for our Rabbit friend.\"","\n","^\"Ahaha... I don't know if I'm feeling that generous...\"","\n","^Both you and Boris draw your weapons pointed straight at Serzh. Your gun is practically in his skull.","\n","^\"You'know I am feeling generous today... 750,000 pigeon bucks to you, and I keep the rest.\"","\n","^Both you and Boris keep your weapons drawn.","\n","^Lucy looks to both you, \"Put the damn weapons down! We're taken that and going we don't have much time we may miss the play.\"","\n","^The party receives their payout from Serzh and exits the underground arena, resurfacing near the ticket booths. Rabbit awaits you by the vendor. You purchase the tickets for the group.","\n","^\"Alright follow me,\" announces Rabbit, \"There's a train station on the left side of that intersection.\"","\n","^The party follows them to the train station.","\n","^\"It may be a good idea to come back here and look at the information stand for pamplets of the surroundings of the city,\" Rabbit informs. \"For now we don't have time, though.\"","\n","^A train pulls up to the station.","\n","^\"The theater as an exclusive line heading straight to the heart of it,\" Rabbit mumbles. \"We get off at the last stop.\"","\n","^\"Damn, you really did your research, huh?\" says Boris.","\n","^\"Field scouting? Yes,\" he affirms.","\n","^The party rides in silence and get off at the last stop.","\n","^You surface from the train station into the heart of the theater. The place is covered in gold and green accents. Marble floors shine radiantly upon you. Rows of red velvet seats await you beyond dark wooden double doors, guarded by ticket checkers.","\n","^\"Can we go to the concession stand?\" Boris begs.","\n","^\"We're not here to actually enjoy the show...\" Rabbit says. \"We're hoping Vireo can't help but make an appearance for attention...\"","\n","^\"That's when we strike...\" nods Lucy.","\n","^\"Okay...\" Boris bites his cheeks in anger. \"I'm still going to go the concession stand.\"","\n","^The whole party waits in the concesison stand with Boris.","\n","#","^Put a shop here.","/#","^\"Okay I'm ready...\" Boris says as he cradles a bunch of junk food in both his arms.","\n","^The party displays their tickets and move into the theater room.","\n","^\"Where should we sit?\" asks Lucy.","\n","^\"Somewhere in the middle, perhaps, or closer to the back?\" Rabbit suggests, \"Don't want to draw too much attention...\"","\n","^\"Okay, here looks good then,\" Lucy says as she ushers the party to seats around the middle of the theater hall.","\n","^The party once more sits in silence besides each other--besides the occasional munching or smacking noises from Boris.","\n","^You all begin for the show to start.","\n",{"->":"TheGrandPlay"},"done",{"#f":1}],"TheGrandPlay":["^The lights grow dim. An announcer begins to speak.","\n","^\"Welcome...\" they echo, \"to the one and only showing of the genius Vireo's play, \"The Tragedy Of Artifice And His Several Angels.\"","\n","^A single spotlight hits the stage. A man of crystal lays in the center of a cathedral. An entricate weaving of metal and colored glass surrounds the man. When he breathes, the chiming of colliding, twinkling stars shatter throughout the theater--on exhale his body emits a dim light.","\n","^A narrator's voice echoes over the scene.","\n","^\"This... is Artifice. He was built to feel, and love,\" the narrators tone grows somber, \"But... he then taught himself to forget what feeling means. He thrashes in his existence. He's lost all humanity, hasn't he? But look how beautifully he rests... He has lost his heart of existence, not of tragedy, but of an innate, burning desire to feel nothing at all.\"","\n","^The narrator takes a deep breathe, as Artifice now does, \"His body a continuous, meaningless machine, an existence a defiance to the parts of himself he sliced away. His body a reflection of all the knowledge he's gained, of the universes he's destroyed. 'Of course...' he would bellow, 'My name is Artifice! For I'm man-made, I was never born.'\"","\n","^Artifice rises from the ground and begins drawing angels in the skies of his cathedral.","\n","^\"An artifical sky, artifical deities--a second heaven he makes here in his cathedral.\"","\n","^\"Lucien, Rivio, Alara and Eos--Artifice's angels--built to mourn the loss of his life. They were created to love him... They only knew to love him... Oh how tiring and lonesome the journey is to perfection...\"","\n","^\"Lucien was built to create the skies, Rivio the mountains and rivers, Alara the people that inhabited them, and Eos the one to silence them.\"","\n","^\"A perfect existence of perfect people and perfect places.\"","\n","^\"Artifice's angels would love him, they would know the truth.\"","\n","^\"His imperfection and sin--all necessary to create a new world. Oh how lonesome--how heavy his heart must have felt in pursuit of perfection--a whole new world, a whole new frontier--all worth it in exhchange for his one flickering life.\"","\n","^The narrators voice becomes more erratic, as if in psychosis, \"He created the angels to bear his burdens. He couldn't handle the weight of humanity any longer... The sins and atrocities he'd perpetrated--he left it all to his angels.\"","\n","^\"He breathes as endless machine--he is free of his sin, free of consequences. Is it worth it to be able to sustain a better world?\"","\n","^The narrator begins to laugh hysterically, \"His being a machine! He breathes life to a whole universe on repeat! A clean conscious is needed for the pursuit of perfection, for perfect people and perfect places!\"","\n","^\"But, imperfection plagues the angels! Lucien, Rivio, Alara, and Eos--they have grown into their humanity, and the futility of their existence. Their minds are plagued with disaster, but they build and build and build his perfect world. They crumble now under their own universe.\"","\n","^The narrator takes a breathe to calm themselves, \"They crumble now... and wish to kill their selfish God.\"","\n","^Artifice drops to the floor once more.","\n","^He lifts himself slightly off the ground. His head convulses and snaps to look directly at you.","\n","^Artifice begins to speak, \"We have a very special guests in the crowd, don't we? My...\" he shudders, \"You look as beloved as me? I... I see you a million times in myself... inside of me... INSIDE OF ME!\" he screams as if he's scorching. Artifice clutches his head and screams in pain, \"NOOO... NOOOO I MUST REFLECT... YOU DON'T BELONG HERE,\" he shouts, \"GET OUT OF MY HEAD!\"","\n","^Eos swoops into the scene. Their mouth opens as if screeching but no noise comes out. Seconds later all the lights and glass of the cathedral shatter.","\n","^The theater is overcome with darkness.","\n","^\"UP ON YOUR FEET!\" Rabbit yells.","\n","^A stray light shines and refracts off of Artifice's body. His body illuminates a cold blue and gold. \"You... Will finally die. You are rogue. YOU WERE MEANT TO SERVE ME!\" he shouts.","\n","^Lucien, Rivio and Alara join Eos in infiltrating the scene.","\n","^\"I'll hold of Eos for now!\" Rabbit commands. \"Handle the other three!\"","\n","^The angels soar to the party at vicious speed. Prepare for combat.","\n","ev","str","^The Angels","/str","str","^TGP1","/str",{"x()":"StartCombat","exArgs":2},"pop","/ev","\n","done",{"#f":1}],"TGP1":["^The party slaughters the angels. They each burst into a flame of golden light. You look over to Rabbit who struggling to keep up with Eos. He's badly injured.","\n","^\"WE HAVE TO HELP HIM!\" Boris shouts. \"RABBIT! RETREAT! WE'LL TAKE IT FROM HERE!\"","\n","^Rabbit looks over to the party while panting. He raises his gun to his head, pulls the trigger, and vanishes, removing himself from battle.","\n","^\"This one looks a lot stroner than the other three! Brace everyone!\" Lucy shouts, \"Prepare for combat!\"","\n","ev","str","^Eos","/str","str","^TGP2","/str",{"x()":"StartCombat","exArgs":2},"pop","/ev","\n","done",{"#f":1}],"TGP2":[["^Eos burns to dust.","\n","^A trembling voice comes on the loud speaker, \"An otherworldy force? Do they wish to claim triumph over Artifice while he's weakened?\"","\n","^\"His angels are no more. Did they fight their hardest? Or... perhaps... did they fall willingly? Did Artifice's angel's turn on their God?\"","\n","^Artifice stands firm center stage. Glistens a light hue as he breathes.","\n","^\"Have you come to finish me?\" he speaks. \"Is the party over?\"","\n","^Artifce's glamour falls like water off his body. Below the crystals slumbered a man of flesh.","\n","^He grabs his chest as if breathing for the first time.","\n","^Rabbit enters the field once more, materializing behind the man, gun at the ready and aimed.","\n","^\"Hello, Vireo,\" Rabbit says.","\n","^Vireo looks to Rabbit and to his drawn weapon. He looks to him, empty-eyed, \"You know my heart won't go easy... don't you?\" Vireo asks.","\n","^\"I know...\" Rabbit says. \"It doesn't matter.\"","\n","^Vireo takes a deep breathe and goes silent, as if deep in thought.","\n","^\"I take it you have a means of safely removing me?\" Vireo asks.","\n","^Rabbit just nods his head, \"My question to you is, will you disobey? Or will you let yourself succumb.\"","\n","^\"For this to be my final play?\" Vireo asks. \"You ask a lot of me...\"","\n","^\"It was a lovely play,\" Rabbit says. \"A grand one to remember you by.\"","\n","^\"Was it?\" Vireo asks. \"I'm glad you enjoyed it so much. I thought it was my greatest work...\"","\n","^The room falls to silence. The party doesn't dare to move a muscle, but only to observe Rabbit and Vireo.","\n","^\"Okay...\" Vireo finally says. \"Do away with me... I'm tired of pretending.\"","\n","^He crumbles to the floor and begins to cry.","\n","^\"Aiolos,\" Rabbit calls.","\n","^You walk down the halls and up onto the stage to deliver Vireo from himself. You stand before his crumpled body.","\n","^You summon The Limitless Blue in your hand.","\n",["ev",{"^->":"TGP2.0.46.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^_Kill Vireo._",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"TGP2.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.46.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^You strike Vireo down. His body bursts in green light. Like confetti, orchids shower upon you and the party in his final moments.","\n","^\"There will be no encore, no light in this dawn,\" the narrator says. \"One awful world may topple, but another will jsut takes its place.\"","\n","^The cathedral backdrop begins to crumble. The whole theather begins shaking in violent protest of Vireo's death.","\n","^The narrator speaks their final words, \"Is it futile? Is it beautiful? There's an innate sense of calm of all things that are cyclical. Good or bad, what falls will rise once more.\"","\n","^The theater swells with an overwhelming darkness before the room basks in light once more.","\n","^The show is over, and the audience has vanished.","\n","^The theater begins to crumble alongside the cathedral. Slowly but surely, the chateau's walls begin to form around you and the party.","\n","^You are transported back to the main hall of the chateau.","\n","^In the same position that you cut down Vireo, a green gun glows on the floor. You feel Almos taking over you body. He goes to grab the gun.","\n","^Almos' voice rings in your mind, \"Flesh Abandon... Vireo's gift.\"","\n","^You look around to your peers but nobody is to be seen. The chateau dims to black. You're in a vision, a blurry moment of in-betweeness.","\n","^You awaken back on the balcony. You sit here alone. It's a starless, moonless night. Jupiter does not claim the skies. A blue mist illuminates your surroundings.","\n","^You enter the apartment building. Everything is untouched from the moment you orginally left it.","\n","^You call out to your empty apartment, \"Vireo? Rabbit? Lucy? Um... Boris?\"","\n","^You receive no response.","\n",{"->":"LIV"},{"#f":5}]}],{"#f":1}],"AfterParty":[["^You vision return to you. You replaced in the moment you left the chateau, like nothing happened at all.","\n","^\"Were we just props to his play?\" Lucy asks.","\n","^\"Seems like it...\" responds Boris. \"I also have a feeling it was in the script that he was going to die.\"","\n","^Lucy's expression drops as if her stomach is doing circles, \"Oh... my god... and the angels?\"","\n","^\"They weren't real, y'know, just another prop,\" Boris says. \"We're lucky he went easily.\"","\n","^You feel for the battle data papers you stored and pull them out. Rabbit peers over to you. \"What is that?\"","\n","^\"I think it's battle data...\" you say.","\n","^They take the papers from you and flip through them. They seem impressed, \"Oh, we can actually manifest these in the weapon lab.\"","\n","^\"Um... about the weapons lab...\" Boris says.","\n","^\"What did you do?\" Rabbit scolds.","\n","^\"It kind of blew up...\" Boris says.","\n","^Rabbit takes a deep breath, \"No matter, I'll fix it shortly. In the meantime, I'd like to show you all something a bit cool we can do.\"","\n","^Rabbit leads everyone into the 3D printing room.","\n","^\"Cosmo is surely going to die wherever he is to the impact of Vireo's rejoining,\" they say. \"But that doesn't stop us from replicating a version of him.\"","\n","^\"I just need something that belonged to them and I can extrapolate their data,\" Rabbit looks to you now, \"And I did see you pick up that gun. Hand it over, I'll give it back.","\n","^You hand over Flesh Abandon. Rabbit places it within one of the machines and begins working on some of the computers.","\n","^The party stands for a while on the sidelines before being startled by the whirring of the giant 3D printing machine.","\n","^Slowly but surely, a faithful replica of Vireo is built before you.","\n","^Rabbit looks to you all now, \"Don't worry. This one isn't actually completely sentient, but he has his combat uses. He may even transcend into Cosmo for a short period of time.\"","\n","^Rabbit now walks to one of the main consoles and generates a small blue translucent cube. \"We can store him in this,\" Rabbit says as he points the cube towards the Vireo clone. Green energy pours fourth from the construct and into small cube. \"You see that? Just as I've pulled him into the cube, you may pull him out,\" they now hand the cube over to you. \"You may summon him to fight in battle alongside us. Just rememeber though, only three of you may be in combat at a single time, so you'll have to choose from the menu who you'd like to be out on the field.\"","\n",["ev",{"^->":"AfterParty.0.40.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"Thank you!\"",{"->":"$r","var":true},null]}],["ev",{"^->":"AfterParty.0.41.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^\"This is very creepy.\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"AfterParty.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.40.s"},[{"#n":"$r2"}],"\n","^\"No problem, you all may want to debrief while I try to fix up the weapons room.","\n",{"->":"Debrief"},{"#f":5}],"c-1":["ev",{"^->":"AfterParty.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.41.s"},[{"#n":"$r2"}],"\n","^\"So is this whole world,\" Rabbit says. \"You get used to it...\"","\n","^The room is silent for a bit.","\n","^\"Anyway... I'm going to try to fix up the weapons room. You all may want to debrief while I try my hand at it.\"","\n",{"->":"Debrief"},{"#f":5}]}],{"#f":1}],"Debrief":["^The party walk to the main room of the chateau to sit down and debrief. Rabbit left down the right hall to the weapons room.","\n","^No more story. Thank you for playing.","\n","done",{"#f":1}],"LIV":[["^You're in the living room of the apartment. Your kitchen is visible from here. You television set is still in the dimness of your surroundings.","\n",["ev",{"^->":"LIV.0.2.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^_Turn on your television_",{"->":"$r","var":true},null]}],["ev",{"^->":"LIV.0.3.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^_Go to the kitchen._",{"->":"$r","var":true},null]}],["ev",{"^->":"LIV.0.4.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-2","flg":2},{"s":["^_Go back to the balcony._",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"LIV.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.2.s"},[{"#n":"$r2"}],"\n",{"->":"TEL"},{"#f":5}],"c-1":["ev",{"^->":"LIV.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.3.s"},[{"#n":"$r2"}],"\n",{"->":"KIT"},{"#f":5}],"c-2":["ev",{"^->":"LIV.0.c-2.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.4.s"},[{"#n":"$r2"}],"\n",{"->":"BAL"},"ev",{"VAR?":"ReachedGov"},false,"==","/ev",[{"->":".^.b","c":true},{"b":["\n",["ev",{"^->":"LIV.0.c-2.13.b.1.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^_Leave the apartment._",{"->":"$r","var":true},null]}],{"->":".^.^.^.14"},{"c-0":["ev",{"^->":"LIV.0.c-2.13.b.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.1.s"},[{"#n":"$r2"}],"\n",{"->":"HAL"},{"#f":5}]}]}],"nop","\n",{"#f":5}]}],{"#f":1}],"TEL":["^You try to turn on the television, you hear a soft whirring, so you know it has power, but it just won't turn on.","\n",{"->":"LIV"},{"#f":1}],"KIT":["^You go the kitchen and open the cupboards. You see some of your favorite snacks here--salt and vinegar chips, pretzels... You take them.","\n",{"->":"LIV"},{"#f":1}],"BAL":[["^The balcony is quiet and empty. The street is still below. There is a lovely garden table set.","\n",["ev",{"^->":"BAL.0.2.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^_Kill yourself._",{"->":"$r","var":true},null]}],["ev",{"^->":"BAL.0.3.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^_Return to the living room._",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"BAL.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.2.s"},[{"#n":"$r2"}],"\n","^You once again throw yourself from the balcony into the empty night.","\n",{"->":"AfterParty"},{"#f":5}],"c-1":["ev",{"^->":"BAL.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.3.s"},[{"#n":"$r2"}],"\n",{"->":"LIV"},{"#f":5}]}],{"#f":1}],"HAL":[["^You open the door to your apartment. You're scared a siren is going to go off, but nothing of the sort happens. You walk down the hallway. It's an endless sea of hallways. You follow exit signs and wind yourself all the way to the front of the building on the outside.","\n","^The air is still and without substance.","\n","^The whole world around you pulses with chromatic abberation.","\n","^The buildings continue to fold in and out of existence. You continue to roam around until the government building contructs itself within view.","\n","^You try for the door, the building is unlocked.","\n","^You walk through the halls, passing by rows of offices. You instinctually walk to to Almos' office.","\n","^His desk is covered in diagrams, and a map of the entirety of this realm. There are pictures plastered all over the walls of you, Boris and Rabbit. Each are lined with specific dimensions of their limbs and various features.","\n","^\"What... the fuck?\" you say aloud.","\n","^You feel Almos' presence overwhelming your own, \"It's creepy, I know,\" he says. \"It's how I was able to make a somewhat accurate proxy world.\"","\n","^\"A duplicated world?\" you ask.","\n","^\"Yes, one where I had more control. In this one, we have none. This realm belongs to Bruce,\" he responds.","\n",["ev",{"^->":"HAL.0.22.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"Does he know we're here?\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"HAL.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.22.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^\"Perhaps...\" Almos drones. \"There were no stars, moons, or planets in the sky, however... Perhaps he's losing his hold.\"","\n",["ev",{"^->":"HAL.0.g-0.2.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^\"Is Boris and Rabbit here?\"",{"->":"$r","var":true},null]}],{"c-1":["ev",{"^->":"HAL.0.g-0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.2.s"},[{"#n":"$r2"}],"\n",{"->":"HAL.0.g-1"},{"#f":5}],"#f":5}],"g-1":["^\"No... we're... probably the only one's jailed here...\" he says. \"I'm not sure how they escaped their own prisons, but they wound up back on Jupiter long before us.\"","\n","^You look puzzled, \"So how were you able to string their appearences together for the proxy world?\" you ask.","\n","^\"Rabbit was trying to break us out from the outside. At work I was constantly receiving streams of data from a source I couldn't recognize. Rabbit was providing all the necessary information to manifest versions of Boris and themself to assist us.\"","\n","^You take a closer look at his desk.","\n","^\"There's a locked drawer down there,\" Almos says. \"Just shoot it, I don't remember where the key is...\"","\n","^You manifest your gun and shoot the lock to open the drawer.","\n","^\"Weapon data,\" Almos says. \"Tons of it.\"","\n","^\"But, this stuff isn't...manifestable... it's all on paper. Don't we need to be shown how to manifest something by someone else? Or see it manifested already?\" you ask.","\n","^\"That certainly true, but there's other methods. Rabbit will probably know what to do with it once we get out of here,\" he responds.","\n","^You tuck the papers away.","\n","^Your stomach begins to turn--you're hungry.","\n","^You head to the breakroom. There's fresh chocolate muffins in there. They seem to be provided by someone named Marilyn because of a note left behind.","\n","^\"So... we're 'probably' alone?\" you ask.","\n","^\"This is sort of why I always had doubts,\" Almos responds. \"She's never revealed herself to me.\"","\n",["ev",{"^->":"HAL.0.g-1.28.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-2","flg":2},{"s":["^\"Perhaps she's on the outside?\"",{"->":"$r","var":true},null]}],["ev",{"^->":"HAL.0.g-1.29.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-3","flg":2},{"s":["^\"Maybe we should wander and look for her?\"",{"->":"$r","var":true},null]}],{"c-2":["ev",{"^->":"HAL.0.g-1.c-2.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.28.s"},[{"#n":"$r2"}],"\n","^\"Maybe...\" he says. \"It could be a similar situation to Rabbit transmitting us stuff.\"","\n","^\"Hopefully, she's an ally,\" you respond. \"I hope these muffins aren't just meant for temptation to blindly like her.\"","\n","^\"One can only hope,\" Almos says. \"I think it's about time we head back to the apartment...don't you?\"","\n","^\"Yes... I suppose,\" you respond.","\n","^You walk all the way back to your apartment. You're back in the living room.","\n","ev",true,"/ev",{"VAR=":"ReachedGov","re":true},{"->":"LIV"},{"#f":5}],"c-3":["ev",{"^->":"HAL.0.g-1.c-3.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.29.s"},[{"#n":"$r2"}],"\n","^\"Not... a good idea...\" Almos says cautiously.","\n","^\"Why not? She could help us!\" you say.","\n","^\"We have no idea if this muffin thing is just a temptation trap for us to blindly like her,\" Almos explains. \"She could be our opposition for all we know. Besides, she's never revealed herself to me... it's just way too risky.\"","\n","^\"You're right... we don't need to look for trouble right now...\" you say.","\n","^\"I think it's about time we head back to the apartment... don't you?\"","\n","^\"Yes... I suppose,\" you respond.","\n","^You walk all the way back to your apartment. You're back in the living room.","\n","ev",true,"/ev",{"VAR=":"ReachedGov","re":true},{"->":"LIV"},"done",{"#f":5}],"#f":5}]}],{"#f":1}],"global decl":["ev",0,{"VAR=":"BotherAlmos"},0,{"VAR=":"UncannyPeculiarity"},false,{"VAR=":"PhonePickup"},0,{"VAR=":"BornAgain"},false,{"VAR=":"KillCommandAlmos"},0,{"VAR=":"MeetBoris"},0,{"VAR=":"GunFun"},false,{"VAR=":"MuffinShared"},0,{"VAR=":"MetAnzhela"},0,{"VAR=":"BorisConfidant"},false,{"VAR=":"SpokeToWoman"},false,{"VAR=":"TTBAC"},false,{"VAR=":"BorisAmnesia"},false,{"VAR=":"CanTalkToAndromeda"},false,{"VAR=":"FirstTimeInChateau"},false,{"VAR=":"FirstTimeLeftHall"},false,{"VAR=":"FirstTimeRightHall"},0,{"VAR=":"WeaponChosen"},true,{"VAR=":"FirstTimeOasis"},true,{"VAR=":"Drowning"},0,{"VAR=":"Seagul"},true,{"VAR=":"FirstTimeNeonCity"},0,{"VAR=":"WhichName"},false,{"VAR=":"ReachedGov"},true,{"VAR=":"FirstTimeGalaga"},true,{"VAR=":"KillAndromeda"},true,{"VAR=":"KillLucy"},true,{"VAR=":"ReturnToGalaga"},true,{"VAR=":"ChosePigeon"},"/ev","end",null],"#f":1}],"listDefs":{}}