{"inkVersion":21,"root":[["\n","\n","\n","\n","\n","\n","\n","\n","^The balcony surveys well above the street. The street is empty and quiet. Almos is quiet. He sits across from you now, a table between you both. He usually isn’t quiet on Saturdays. Perhaps you’ve gotten it all wrong. It may be Sunday now that you think about it. The days don’t seem to matter anymore, at least to you, anyway.","\n","ev","str","^Aiolos","/str",{"x()":"AddCharacter","exArgs":1},"pop","/ev","\n","ev","str","^Revolver","/str",{"x()":"AddWeapon","exArgs":1},"pop","/ev","\n","^You have a cigarette in hand. Smoke leaves your lips. Almos' face is briefly obstructed from your sight. You're worried he has just disappeared.","\n",["ev",{"^->":"0.28.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":"0.c-0","flg":2},{"s":["^\"Almos?\"",{"->":"$r","var":true},null]}],["ev",{"^->":"0.29.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":"0.c-1","flg":2},{"s":["^\"...\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":"0.28.s"},[{"#n":"$r2"}],"\n","ev",{"VAR?":"BotherAlmos"},1,"+",{"VAR=":"BotherAlmos","re":true},"/ev",{"->":"TB1"},{"->":"0.g-0"},{"#f":5}],"c-1":["ev",{"^->":"0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":"0.29.s"},[{"#n":"$r2"}],"\n",{"->":"TB1"},{"->":"0.g-0"},{"#f":5}],"g-0":["done",{"#f":5}]}],"done",{"TB1":[["ev",{"VAR?":"BotherAlmos"},0,">","/ev",[{"->":".^.b","c":true},{"b":["\n","^He doesn’t acknowledge you calling his name. You couldn’t help but feel he was gone in that moment. You remind yourself that the smoke just had to clear a little.","\n","^Everything is fine. You can see Almos now.","\n","^Almos is looking out from the balcony down to the street.","\n",{"->":"TB1.0.6"},null]}],"nop","\n","^Almos also has a cigarette in his hand. Two days ago, you poked holes through all of his cigarettes so he wouldn’t be able to smoke them. You’re not sure how either of you is smoking. The cigarettes should have been duds.","\n","^Your mind is a jumbled mess, trying to figure out all the details.","\n","^You ignore the thought for now in defeat.","\n","^The balcony is small. You and Almos are sitting upon an aluminum patio set. Just two chairs and a small circular table between you.","\n","^Three months ago, you both barely sat here. It has become something of a ritual for you both to sit here and watch the sunset.","\n","^The aluminum of the table seems to be falling apart. You don’t blame the furniture, really, for not holding up. Neither you nor Almos took any particular measures to care for it. It was a cheap set, anyway.","\n",["ev",{"^->":"TB1.0.20.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^_Kick the table leg in frustration._",{"->":"$r","var":true},null]}],["ev",{"^->":"TB1.0.21.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^_Examine the table more closely._",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"TB1.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.20.s"},[{"#n":"$r2"}],"\n","ev",{"VAR?":"UncannyPeculiarity"},1,"+",{"VAR=":"UncannyPeculiarity","re":true},"/ev",{"->":"TB2"},{"#f":5}],"c-1":["ev",{"^->":"TB1.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.21.s"},[{"#n":"$r2"}],"\n",{"->":"TB2"},{"#f":5}]}],{"#f":1}],"TB2":[["ev",{"VAR?":"UncannyPeculiarity"},0,">","/ev",[{"->":".^.b","c":true},{"b":["\n","^You kick the table leg and the whole thing rattles.","\n","^Almos jumps a little, and says nothing while giving you a sharp but brief stare.","\n","^You’re becoming angry, but you find it challenging to continue to be upset at metal. Perhaps your outburst has little to do with the table itself, and more to do with frustration of feeling ignored by Almos.","\n",{"->":"TB2.0.7"},null]}],[{"->":".^.b"},{"b":["\n","^You look closer at the table to see brownish specles forming near the legs. It's not really immediately noticeable, but the table itself feels like it's about to collapse at any second.","\n","^Only three legs of the four are ever touching the ground at once. You do wonder though if those brown spots you're seeing are actually rust.","\n",{"->":"TB2.0.7"},null]}],"nop","\n","ev",{"f()":"JMP1"},"out","/ev","\n",["ev",{"^->":"TB2.0.14.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^_Pull out your phone from your pocket and search for the answer._",{"->":"$r","var":true},null]}],["ev",{"^->":"TB2.0.15.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^_Try to grab Almos' attention again._",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"TB2.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.14.s"},[{"#n":"$r2"}],"\n",{"->":"TB3"},{"#f":5}],"c-1":["ev",{"^->":"TB2.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.15.s"},[{"#n":"$r2"}],"\n","ev",{"VAR?":"BotherAlmos"},1,"+",{"VAR=":"BotherAlmos","re":true},"/ev",{"->":"TB3"},{"#f":5}]}],{"#f":1}],"TB3":[["ev",{"VAR?":"PhonePickup"},true,"==","/ev",[{"->":".^.b","c":true},{"b":["\n","^Almos seems captivated in his thoughts. You shouldn’t bother him when you can just look up the answer. You just like hearing his voice, you guess. You pull out your phone.","\n","^No. Aluminum doesn’t rust, apparently. It corrodes. Interesting, you suppose. You leave the phone out on the table.","\n",{"->":"TB3.0.6"},null]}],"nop","\n","^You try getting Almos’ attention again by touching his hand, but he stays fixated on the street below. He gets enraptured like this sometimes. Perhaps he’s daydreaming. Maybe he isn’t even really here.","\n","^His body is before you, but it's as if his mind is on another planet, for all you know.","\n","^You sit in silence for a bit longer.","\n",["ev",{"^->":"TB3.0.14.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^_Daydream along Almos_",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"TB3.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.14.s"},[{"#n":"$r2"}],"\n",{"->":"Daydream"},{"#f":5}]}],{"#f":1}],"Daydream":[["^Your mind starts to wander admist the silence between you both.","\n","^Without constant stimulation, what are you if not just flesh and meat?","\n","^You close your eyes and envision this tableset belonging to a cafe in the middle of a garden.","\n","^Oh, you can see it now. You and Almos are at a lovely coffee shop, which also happens to be in a garden.","\n","^You feel upkept, bourgeois even, as a nice breeze sifts through your hair, and a coffee that's consumed your pocket money waits patiently in front of you.","\n","^You romanticize the scene more. You’re on a small bridge, just above a nice running stream of water, which also happens to be where a coffee shop has put some seating–in the middle of a garden, that is.","\n","^You think that would be nice. Almos doesn’t like coffee, though. You suppose he liked feeling tired. You think he’d like it just as much as cigarettes.","\n","^You wonder if the garden would have nice flowers. Although you hope there wouldn’t be any flowers close to where you and Almos would be sitting. You get scared of bees, among other things.","\n","^Speaking of gardens, you’ve never asked Almos what his favorite flowers are. You think he likes carnations. Maybe you should ask him.","\n",["ev",{"^->":"Daydream.0.18.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"Almos?\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"Daydream.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.18.s"},[{"#n":"$r2"}],"\n",{"->":"Daydream1"},{"#f":5}]}],{"#f":1}],"Daydream1":[["^“Hm,” he mutters.","\n","^The street is still holding his gaze. His side profile is the only thing greeting you. He looks frozen. His forearm is like a pillar managing the integrity of his skull. His cheek and chin rest nicely in his hand, serving nicely as a capital.","\n","^You don’t know if you’re bothered by the fact that he’s not looking at you. His eyes look sullen and droopy. You think he may be tired. He’s always tired, though. You’ve already forgotten what you were going to ask him.","\n","^An uncomfortable amount of time seems to have passed, marked by his pupils slowly orbiting over to you.","\n","^“What is your favorite flower?” you finally blurt as if your heart had jump-started your lungs.","\n","^He still doesn’t respond. His other hand is still occupied, placing a cigarette in his mouth. You feel like you’ve tried forever to get Almos to stop smoking, but he kind of ropes you in as well.","\n","^You don’t reckon you have much of a head over your shoulders.","\n","^You bought him gum a while back as a substitute, but you think he likes both gum and cigarettes now. He alternates. You’ve tried hiding his cigarettes, but Almos is really smart. He can always find where you’ve hidden them. Sometimes you’ve thought yourself as doing an incredible job.","\n","^Smoke shrouds Almos once again. For those few seconds, you feel like he’s vanished. He returns to you with the cigarette in his mouth again. He inhales and sighs cotton wisps.","\n","^Images of you poking holes through all his cigarettes resurface within your mind once more. You just realized, how are you both smoking? Did you miss a pack or something? You examine your cigarette, sure enough, no holes.","\n","^You can't quite pin your emotions, but you feel yourself becoming a very potent mixture of anger and sadness. You feel like purple. You feel like if lavender didn’t have a smell.","\n","^You direct your attention back to Almos.","\n",["ev",{"^->":"Daydream1.0.24.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"Almos, how are we smoking?\"",{"->":"$r","var":true},null]}],["ev",{"^->":"Daydream1.0.25.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^\"How do you even afford new cigarettes?\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"Daydream1.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.24.s"},[{"#n":"$r2"}],"\n",{"->":"TB5"},{"#f":5}],"c-1":["ev",{"^->":"Daydream1.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.25.s"},[{"#n":"$r2"}],"\n",{"->":"TB5"},{"#f":5}]}],{"#f":1}],"TB5":[["^“Orchids.” He interjects quietly while slowly turning towards you. His face grew heavy with shame as he dropped his gaze.","\n",["ev",{"^->":"TB5.0.2.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"What the hell are you talking about?\"",{"->":"$r","var":true},null]}],["ev",{"^->":"TB5.0.3.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^\"Stop trying to distract me! Just answer the question Almos!\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"TB5.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.2.s"},[{"#n":"$r2"}],"\n",{"->":"TB6"},{"#f":5}],"c-1":["ev",{"^->":"TB5.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.3.s"},[{"#n":"$r2"}],"\n",{"->":"TB6"},{"#f":5}]}],{"#f":1}],"TB6":[["^Almos remains silent.","\n","^You're about to blow a fuse.","\n","^He relinquishes his cigarette in the ashtray between you two. He once more stares back at the empty street down below.","\n","^Why were you so easily provoked at nothing? You hope you didn't make Almos feel sad. You feel the need to say something, but you're a little choked up at the moment.","\n","^You try grabbing his hand to comfort him, but he quickly retracted it to his lap. You give out a heavy sigh in response.","\n",["ev",{"^->":"TB6.0.10.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^_Look out into the street with Almos_",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"TB6.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.10.s"},[{"#n":"$r2"}],"\n",{"->":"TB7"},{"#f":5}]}],{"#f":1}],"TB7":[["^Can't beat 'em join 'em, you suppose. You join Almos in looking out in the empty street.","\n","^As the sun begins to set Almos resigns from looking out. You feel him staring at you now, but you don't meet his gaze. You stare on as he once was, not out of choice, but a feeling of necessity.","\n","^Something beyond starts to demand your attention. You find siren in the moon's image.","\n","^Were these the same forces acting upon Almos? He seemed so different today. Inexplicablly compelled to the horizon.","\n","^The moon shimmeres more dramtically than before, as if it were purposely dazzling you.","\n","^Light waves waft through the skies. They call to you.","\n","^An irresistible sensation akin to a rush of adrenaline overwhelms you. You feel compelled to melt away with the sky.","\n","^Almos’ attention is now entirely on you. It seems your and Almos’ demeanor have completely switched.","\n","^You get out of your seat to lean against the banister. You stand high above the charcoal-black ground. The white stripes of the road reminded you of stars.","\n","^Leaning over the banister isn't enough. You must greet the sky. Become one with the stars and nothingness between.","\n","^You maneuver yourself over the banister, one leg after the other.","\n","^You're in a moment of mania. You wish to feed into the euphoria, and get closer to the stars.","\n","^There is just enough space on the other end to hold your heels. You know not if you're shaking in fear or excitement.","\n","^Your eyes glisten with the moon’s image, filling your body with envy. For a moment, you wish you could shimmer in Almos' mind the very same way the moon has enthralled yours.","\n","^You lull and drift off into the moon’s ocean of light.","\n","^Almos’ eyes calmly chase you seven stories down into the street.","\n",["ev",{"^->":"TB7.0.32.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^_Continue..._",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"TB7.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.32.s"},[{"#n":"$r2"}],"\n",{"->":"EndOfAnEnd"},{"#f":5}]}],{"#f":1}],"EndOfAnEnd":["ev","str","^Jupiter is an empty street. / Jupiter is  relentless grief. / Jupiter is the tabacco between your teeth.","/str","str","^Rabbit","/str",{"x()":"FadeOutSeq","exArgs":2},"pop","/ev","\n","done",{"#f":1}],"JMP1":["^“Almos,” you’re not even sure you consciously expelled his name from your mouth. Can aluminum rust?”","\n","^You always seem to just say his name when you have a question. You think Almos is really smart. He knows a lot of things.","\n","^He doesn’t respond to you, however.","\n",{"#f":1}],"Rabbit":[["ev","str","^InBetween","/str",{"x()":"PlaySong","exArgs":1},"pop","/ev","\n","^You don’t know how long you’ve been sleeping, but you wake up with your face in some concrete.","\n","^You’re on an empty street. You manage the strength to lift yourself onto your knees.","\n","^Your vision is a little blurry, but your body is seemingly intact. You look behind you in search of the apartment from which you’ve thrown yourself.","\n","^There’s no such place behind you. You feel like you’re nowhere.","\n","^The world echoes blue and indigo all around you as if the colors were whispering in the air. You inhale, and the world around you swirls into your lungs.","\n","^There's a horrible beeping permeating all around you.","\n","^You slowly turn round again, only to be met with a slender figure placing their face uncomfortably close to yours.","\n","^They’re crouched on the floor before you. They sport a suit and are humanoid in figure. They're covering their face with a rabbit mask.","\n",["ev",{"^->":"Rabbit.0.24.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"Who are you?\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"Rabbit.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.24.s"},[{"#n":"$r2"}],"\n",{"->":"RabbitBrain"},{"#f":5}]}],{"#f":1}],"RabbitBrain":[["^\"Who are you?\" you ask, uncertainly. The figure looks at you with curiosity while lifting itself to a half squat.","\n","^“Rabbit,” it responds quietly.","\n",["ev",{"^->":"RabbitBrain.0.4.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"Rabbit?\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"RabbitBrain.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.4.s"},[{"#n":"$r2"}],"\n",{"->":"RabbitBrain1"},{"#f":5}]}],{"#f":1}],"RabbitBrain1":[["^“Rabbit, huh. I’m Aiolos,” you announce. You’re not sure whether to feel scared or not.","\n","^\"Can you do this?\" Rabbit asks. He holds out his palm, and within it, you see a revolver begin to materialize. It's radiating a brilliant light blue color.","\n","^\"Um.. No,\" you respond.","\n","^\"Soul weapon,\" Rabbit says. \"Think, and behold.\"","\n","^\"Think and behold,\" you echo.","\n","^Rabbit looks at you, confused. \"Do, don't say,\" they instruct.","\n","^You extend you arm out and look at your palm.","\n","^You focus, and think of a revolver in your mind--it's shape, feel, and power. You pull this image into your hand, attempting to will it into existence.","\n","^Sure enough a radiating blue gun materializes in your hand.","\n","^\"Bravo,\" Rabbit announces. You drop your focus, and the gun disappears.","\n","^Rabbit nods to you, gets up, and starts walking away. You feel compelled to follow Rabbit.","\n",["ev",{"^->":"RabbitBrain1.0.22.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^_Follow Rabbit_",{"->":"$r","var":true},null]}],["ev",{"^->":"RabbitBrain1.0.23.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^_Run away from Rabbit_",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"RabbitBrain1.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.22.s"},[{"#n":"$r2"}],"\n","ev",{"VAR?":"BornAgain"},0,">",{"VAR?":"KillCommandAlmos"},true,"==","&&","/ev",[{"->":".^.b","c":true},{"b":["\n",{"->":"DHR"},{"->":".^.^.^.18"},null]}],[{"->":".^.b"},{"b":["\n",{"->":"FollowRabbit"},{"->":".^.^.^.18"},null]}],"nop","\n",{"#f":5}],"c-1":["ev",{"^->":"RabbitBrain1.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.23.s"},[{"#n":"$r2"}],"\n","ev",{"VAR?":"BornAgain"},0,">",{"VAR?":"KillCommandAlmos"},true,"==","&&","/ev",[{"->":".^.b","c":true},{"b":["\n",{"->":"RotAway"},{"->":".^.^.^.18"},null]}],[{"->":".^.b"},{"b":["\n",{"->":"RunAway"},{"->":".^.^.^.18"},null]}],"nop","\n",{"#f":5}]}],{"#f":1}],"DHR":["^You approach Rabbit, but as soon as  you start following, they turn around and shake their head disapprovingly. You feel an overwhelming urge to run away from Rabbit.","\n",{"->":"RotAway"},{"#f":1}],"FollowRabbit":["^You cautiously follow Rabbit. Their footsteps sugar through the blue and indigo mist surrounding you. Their silhouette promenades at the edge of your vision.","\n","^You follow them for a while. Their footsteps ramp, faster and faster. To keep them in vision, you’re brought to a jog, and then burst into full-on sprinting.","\n","ev",{"VAR?":"BornAgain"},0,"==","/ev",[{"->":".^.b","c":true},{"b":["\n","^You lose Rabbit in the mist, you're utterly alone and swallowed in fog. A beeping noise continues to ring on in the distance. You hear yourself getting closer and closer to the source.","\n","^You're movements become a lot more deliberate and cautious.","\n","^You walk aimlessly in the genral direction of the noise until you stumble upon a figure in the distance.","\n","^\"Rabbit?\" you call out.","\n","^No response.","\n","^You approach thinking it's Rabbit, but you're greeted with a mechanical figure. They are faceless, and the metal rods and cogs that compose their body turn to you.","\n","^You feel the figure approach you with malicious content. You feel the need to protect yourself. You once more materialize a revolver in your hand.","\n","^The figure clanks towards you. Prepare for combat.","\n","ev",{"x()":"RevealInventoryButton"},"pop","/ev","\n","ev","str","^FacelessConstruct","/str",{"x()":"PlaySong","exArgs":1},"pop","/ev","\n","ev","str","^FacelessConstruct","/str","str","^FollowRabbit1","/str",{"x()":"StartCombat","exArgs":2},"pop","/ev","\n",{"->":".^.^.^.11"},null]}],[{"->":".^.b"},{"b":["\n","^You lose Rabbit in the mist, you're utterly alone and swallowed in fog. You begin to walk aimlessly and stumble upon a figure in the distance. You approach thinking it's Rabbit, but you're greeted with a balloon animal. You feel the most viscious of auras radiating off of it. It's most definetely dangerous. You tense yourself, and prepare to eliminate the balloon animal. You once more materialize a revolver in your hand.","\n","^The ballon animals waddles towards you, ready for a fight. Prepare for combat.","\n","ev","str","^BalloonAnimal","/str",{"x()":"PlaySong","exArgs":1},"pop","/ev","\n","ev","str","^BalloonAnimal","/str","str","^FollowRabbit1","/str",{"x()":"StartCombat","exArgs":2},"pop","/ev","\n",{"->":".^.^.^.11"},null]}],"nop","\n","done",{"#f":1}],"FollowRabbit1":["ev",{"x()":"StopSong"},"pop","/ev","\n","ev",{"CNT?":"BornOnceAgain"},0,"==","/ev",[{"->":".^.b","c":true},{"b":["\n","^The construct's gears sputter and grind to a halt.","\n","^Its final twitch echoes in the silence. You're still breathing, but barely.","\n",{"->":".^.^.^.12"},null]}],[{"->":".^.b"},{"b":["\n","^The balloon pops and deflates. The final bits of air that substantiated its being whir into the wash of colors that encompass this world.","\n",{"->":".^.^.^.12"},null]}],"nop","\n",{"->":"FollowRabbit2"},{"#f":1}],"FollowRabbit2":[["^You're not sure what's become of you or how you've just performed such feats. It felt as though something within you has awakened. You dread no longer on the topic, and continue your search to find Rabbit, and the source of the beeping noise.","\n","^You continue to follow the noise until its blaringly close by.","\n","^You're seemingly endless wander is interupted once more by another silhouette. When you approach, you realize it's Rabbit again. The figure stands next to a cubicle, and beeping, object sprouting from the floor. On further inspection, you realize it's a phone box.","\n","^\"Call,\" beckons Rabbit. You only know your own number.","\n",["ev",{"^->":"FollowRabbit2.0.8.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^_Call yourself._",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"FollowRabbit2.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.8.s"},[{"#n":"$r2"}],"\n",{"->":"R1"},{"#f":5}]}],{"#f":1}],"R1":["ev",{"VAR?":"PhonePickup"},true,"==","/ev",[{"->":".^.b","c":true},{"b":["\n","^You would think it would be pointess to call yourself, but you realize you don't have your phone in your pocket. You remember you left it out on the table to see whether aluminum could rust.","\n",{"->":"R1.7"},null]}],[{"->":".^.b"},{"b":["\n","^You would think it would be pointless to call yourself, but you realize you don't have your phone in your pocket. You thought for sure it was in your pocket from when you jumped off the balcony, but when you go to feel for it, it isn't there at all.","\n",{"->":"R1.7"},null]}],"nop","\n","^You call your own number, and the phone rings.","\n","ev",{"VAR?":"PhonePickup"},true,"==","/ev",[{"->":".^.b","c":true},{"b":["\n","^Someone picks up on the other end. You hear some shuffling before a voice indistinguishable from your own greets you with a \"Hello? Who is this?\"","\n","^Rabbit looks upon you; its body language is heavy with grief.","\n","^\"This is Aiolos... who are you?\" you ask.","\n","^\"I'm Aiolos too,\" the voice responds. They sound hollow, \"you sound exactly like me.\"","\n","^I think we're one and the same,\" you reply. \"Are you on the balcony right now?\"","\n","^A weary \"Yes...?\" crinkles across the line. You look to Rabbit for even the slightest bit of clarification. They continue to be mute. Their eyes pierce through yours. You feel as though they are artificially stringing fish hooks through your eyes and poking and pulling at your throat. You feel compelled to say just one thing.","\n","^\"Kill Almos.\"","\n",["ev",{"^->":"R1.16.b.15.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^_Continue..._",{"->":"$r","var":true},null]}],{"->":"R1.18"},{"c-0":["ev",{"^->":"R1.16.b.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.15.s"},[{"#n":"$r2"}],"\n","ev",true,"/ev",{"VAR=":"KillCommandAlmos","re":true},{"->":"BornBefore"},{"#f":5}]}]}],[{"->":".^.b"},{"b":["\n","^Rabbit begins ringing. There's a glowing square in their pocket. Rabbit picks up your call. Their eyes pierce through yours. You feel as though they are artificially stringing fish hooks through your eyes and poking and pulling at your throat. You feel compelled to say just one thing.","\n","^\"Kill Aiolos.\"","\n","^Rabbit approaches you, and in your panic, you collapse  to the floor and blackout. Rabbit kills you, and you unravel into nothing at all.","\n",["ev",{"^->":"R1.17.b.7.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^_Continue..._",{"->":"$r","var":true},null]}],{"->":"R1.18"},{"c-0":["ev",{"^->":"R1.17.b.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.7.s"},[{"#n":"$r2"}],"\n","ev","str","^ ","/str","str","^BornOnceAgain","/str",{"x()":"FadeOutSeq","exArgs":2},"pop","/ev","\n","done",{"#f":5}]}]}],"nop","\n",{"#f":1}],"BornBefore":["ev","str","^Jupiter is prolific. / Jupiter is demanding. / Jupiter is the Absolute Authority. / You are now playing as Almos.","/str","str","^TheGarden","/str",{"x()":"FadeOutSeq","exArgs":2},"pop","/ev","\n","done",{"#f":1}],"BornOnceAgain":[["^You feel your vision go hazy for a moment, but you deem it a passing moment of vertigo. What were you about to say again? Oh, yes, you remember now.","\n","ev",{"f()":"JMP1"},"out","/ev","\n","^Your thoughts are interrupted by your phone ringing in your pocket. You pick up the phone. \"Hello? Who is this?\" You hear nobody on the other end. Wrong number, you suppose. Since your phone is out anyway, you might as well search if aluminum can rust.","\n","^No. Aluminum doesn't rust, apparently. It corrodes. Huh. Interesting, you suppose. You leave the phone out on the table.","\n","^You try getting Almos' attention again by touching his hand, but he stays fixated on the street below. He gets  enraptured like this sometimes. Perhaps he's daydreaming. Maybe he isn't even really there. His body is before you, but his mind is on another planet, for all you know. You sit in silence for a bit longer.","\n",["ev",{"^->":"BornOnceAgain.0.13.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^_Daydream along Almos._",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"BornOnceAgain.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.13.s"},[{"#n":"$r2"}],"\n","ev",true,"/ev",{"VAR=":"PhonePickup","re":true},"ev",{"VAR?":"BornAgain"},1,"+",{"VAR=":"BornAgain","re":true},"/ev",{"->":"Daydream"},{"#f":5}]}],{"#f":1}],"RotAway":[["^You wander aimless through this picturesque orchid-hued world. You check behind yourself occasionally, and Rabbit is nowhere to be seen. You suppose he didn't care much to follow you, only lead.","\n","^A blue and indigo mist continues to swirl around your legs as you walk though each empty street after the next. You finally stumble upon a park, within it stands firm a children's slide. A peculiar figure could be seen sliding down it, and promptly climbing the ladder attached over and over again. You approach slowly, and catch the figure's attention. They leave the slide and walk up to you.","\n","ev",{"VAR?":"MeetBoris"},0,">","/ev",[{"->":".^.b","c":true},{"b":["\n","^\"Hellooo again,\" he bellows.","\n","^\"Again?\" you prompt.","\n","^\"Well, this version of you won't remember me, haha. But rest assured we have met before. There are a million spindles of you about, and I'm sure to meet a million more.\"","\n","^He grabs hold of your arm and pulls you close to him. With the other hand he clamps beneath your chin and examines your face.","\n",{"->":".^.^.^.11"},null]}],[{"->":".^.b"},{"b":["\n","^\"Hellooo,\" he bellows. \"Look at what we have here!\" He grabs hold of your arm and pulls you close to him. With the other hand he clamps beneath your chin and examines your face.","\n",{"->":".^.^.^.11"},null]}],"nop","\n",["ev",{"^->":"RotAway.0.13.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":18},{"s":["^\"Mind getting your hands off of me?\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"RotAway.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.13.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^He retracts a little and just smiles. \"Hahaha, aren't you a sexy one. You're diseased, aren't you? You look sickly and beautiful and empty.\" His face grows wicked and stupid. \"Jumping off a balcony for a man, now? How repulsing.\"","\n",["ev",{"^->":"RotAway.0.g-0.2.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":18},{"s":["^\"It wasn't like that, you know. Something called to me.\"",{"->":"$r","var":true},null]}],{"c-1":["ev",{"^->":"RotAway.0.g-0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.2.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.^.g-1"},{"#f":5}],"#f":5}],"g-1":["^\"Ah, yes, of course,\" he says while pacing about. He circles and examines you now like a shark teasing its prey. He's dressed in gray fabrics as if someone wrapped a feathery tapestry around him. The clothes carry the occasionally smear of green hues.","\n","ev",{"VAR?":"UncannyPeculiarity"},0,">","/ev",[{"->":".^.b","c":true},{"b":["\n","^\"Also, who are you calling diseased?\" you spout. You're the one that looks like a damn pigeon.\"","\n","^\"Perhaps I was in another life, who knows.\" he responds. \"I certainly dress the part, don't I? Anyhow...\"","\n",{"->":".^.^.^.8"},null]}],"nop","\n","^He halts in front of you once more, \"That would be Jupiter that was calling to you.\"","\n","^\"Jupiter? I was looking out at the moon,\" you say.","\n","^\"It was lovely, wasn't it?\" the man says. It seems like the man just ignored what you said.","\n","^\"It takes many shapes and forms,\" he continues. \"Jupiter is multitude, NO, an AMALGAMATION of inexplicable feeling. 'THE PINACLE OF EXISTENCE' some might be bold enough to say.\" He pauses briefly to clear his throat, \"It's also a very real place.\"","\n",["ev",{"^->":"RotAway.0.g-1.18.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-2","flg":18},{"s":["^\"Are we on Jupiter now?\"",{"->":"$r","var":true},null]}],{"c-2":["ev",{"^->":"RotAway.0.g-1.c-2.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.18.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.^.g-2"},{"#f":5}],"#f":5}],"g-2":["^\"Of course not,\" he responds dully. \"We're in a sort of in-between world. A proxy, if you will. Your signal to Jupiter was interrupted by something. This place is just as artificial as the reality you once stood in before.\"","\n",["ev",{"^->":"RotAway.0.g-2.2.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-3","flg":18},{"s":["^\"So, who interrupted the signal?\"",{"->":"$r","var":true},null]}],{"c-3":["ev",{"^->":"RotAway.0.g-2.c-3.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.2.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.^.g-3"},{"#f":5}],"#f":5}],"g-3":["^\"Well, that little friend of yours did,\" he says cheerily. \"I forgot to mention though, I'm Boris.\"","\n","^You think Boris is a bitch.","\n","^\"Well you're awfully quiet now. It's nice to meet you,\" he strikes his hand out.","\n","^You gaze at his hand, but don't go to shake it. You return your focus to his face.","\n",["ev",{"^->":"RotAway.0.g-3.8.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-4","flg":18},{"s":["^\"Why the hell are you here?\"",{"->":"$r","var":true},null]}],{"c-4":["ev",{"^->":"RotAway.0.g-3.c-4.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.8.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.^.g-4"},{"#f":5}],"#f":5}],"g-4":["^\"Straight to the point, are we? Well, according to the script, I'm here to keep you on track when you make stupid decisions. Rabbit is one of Almos' creations.\"","\n","^You interject, \"Didn't you just insult me earlier for jumping off the balcony? Why would Almos create you to say that?\"","\n","^\"Perhaps he thinks you're predicatable, or just straight pathetic. Who knows, I'm no prophet! Haha! I'm just following the script. Anyway, I'm glad you're here now. Almos wants you to enter some building over here.\"","\n","^<i>Boris promenades before you leading the path. Before long, you stumble upon what looks like a government facility. You feel compelled to voice this to Boris.<i>","\n","^\"Hey, isn't this a government building?\" you question.","\n","^Boris reels and is taken aback, \"How would you know what a government building looks like? Did... someone tell you that this is a government building? You're a spooky one, you know that? Anyway here it is. Almos awaits you within.\"","\n","^Boris reaches into his pocket and pulls out a keycard, opens the door, and beckons you through.","\n","ev",{"VAR?":"MeetBoris"},1,"+",{"VAR=":"MeetBoris","re":true},"/ev",["ev",{"^->":"RotAway.0.g-4.20.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-5","flg":18},{"s":["^_Enter the building._",{"->":"$r","var":true},null]}],{"c-5":["ev",{"^->":"RotAway.0.g-4.c-5.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.20.s"},[{"#n":"$r2"}],"\n",{"->":"Government"},{"#f":5}],"#f":5}]}],{"#f":1}],"RunAway":[["^You wander aimless through this picturesque orchid-hued world. You check behind yourself occasionally, and Rabbit is nowhere to be seen. You suppose he didn't care much to follow you, only lead.","\n","^A blue and indigo mist continues to swirl around your legs as you walk though each empty street after the next. You finally stumble upon a park, within it stands firm a children's slide. A peculiar figure could be seen sliding down it, and promptly climbing the ladder attached once again over and over again. You approach slowly, and the figure catches you approaching. He leaves the slide and walk up to you.","\n","^\"Hellooo,\" he bellows. \"Look at what we have here!\" He grabs hold of your arm and pulls you close to him. With the other hand he clamps beneath your chin and examines your face.","\n",["ev",{"^->":"RunAway.0.6.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":18},{"s":["^\"Mind getting your hands off of me?\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"RunAway.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.6.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^He retracts a little and just smiles. \"Hahaha, aren't you a sexy one. You're diseased, aren't you? You look sickly and beautiful and empty.\" His face grows wicked and stupid. \"Jumping off a balcony for a man, now? How repulsing.\"","\n",["ev",{"^->":"RunAway.0.g-0.2.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":18},{"s":["^\"It wasn't like that, you know. Something called to me.\"",{"->":"$r","var":true},null]}],{"c-1":["ev",{"^->":"RunAway.0.g-0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.2.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.^.g-1"},{"#f":5}],"#f":5}],"g-1":["^\"Ah, yes, of course,\" he says while pacing about. He circles and examines you now like a shark teasing its prey. He's dressed in gray cloths as if someone wrapped a feathery tapestry around him. The clothes carry the occasionally smear of green hues.","\n","^He halts in front of you once more, \"That would be Jupiter that was calling to you.\"","\n","^\"Jupiter? I was looking out at the moon,\" you say.","\n","^\"It was lovely, wasn't it?\" the man says. It seems like the man just ignored what you said.","\n","^\"It takes many shapes and forms,\" he continues. \"Jupiter is multitude, NO, an AMALGAMATION of inexplicable feeling. 'THE PINACLE OF EXISTENCE' some might be bold enough to say.\" He pauses briefly to clear his throat, \"It's also a very real place.\"","\n",["ev",{"^->":"RunAway.0.g-1.10.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-2","flg":18},{"s":["^\"Are we on Jupiter now?\"",{"->":"$r","var":true},null]}],{"c-2":["ev",{"^->":"RunAway.0.g-1.c-2.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.10.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.^.g-2"},{"#f":5}],"#f":5}],"g-2":["^\"Of course not,\" he responds dully. \"We're in a sort of in-between world. A proxy, if you will. Your signal to Jupiter was interrupted by something. This place is just as artificial as the reality you once stood in before.\"","\n",["ev",{"^->":"RunAway.0.g-2.2.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-3","flg":18},{"s":["^\"So, who interrupted the signal?\"",{"->":"$r","var":true},null]}],{"c-3":["ev",{"^->":"RunAway.0.g-2.c-3.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.2.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.^.g-3"},{"#f":5}],"#f":5}],"g-3":["^\"Well, that little friend of yours did,\" he says cheerily. \"I forgot to mention though, I'm Boris.\"","\n","^You think Boris is a bitch.","\n","^\"Well you're awfully quiet now. It's nice to meet you,\" he strikes his hand out.","\n","^You gaze at his hand, but don't go to shake  it. You return your focus to his face.","\n",["ev",{"^->":"RunAway.0.g-3.8.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-4","flg":18},{"s":["^\"Why the hell are you here?\"",{"->":"$r","var":true},null]}],{"c-4":["ev",{"^->":"RunAway.0.g-3.c-4.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.8.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.^.g-4"},{"#f":5}],"#f":5}],"g-4":["^\"Straight to the point, are we? Well, according to the script, I'm here to keep you on track when you make stupid decisions. Rabbit is one of Almos' creations.\"","\n","^You interject, \"Didn't you just insult me earlier for jumping off the balcony? Why would Almos create you to say that?\"","\n","^\"Perhaps he thinks you're predicatable, or just straight pathetic. Who knows, I'm no prophet! Haha! I'm just following the script.","\n","^Boris is now looking off in the distance, \"You hear that beeping right? It's best you follow it. It's getting kind of annoying now, ain't it? Also, isn't this your lucky day, I see Rabbit right over there in the distance, I think they still want you to follow them.\"","\n","ev",{"VAR?":"MeetBoris"},1,"+",{"VAR=":"MeetBoris","re":true},"/ev",["ev",{"^->":"RunAway.0.g-4.14.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-5","flg":18},{"s":["^_Follow Rabbit._",{"->":"$r","var":true},null]}],{"c-5":["ev",{"^->":"RunAway.0.g-4.c-5.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.14.s"},[{"#n":"$r2"}],"\n",{"->":"FollowRabbit"},{"#f":5}],"#f":5}]}],{"#f":1}],"TheGarden":["^You were offered work finally and haven’t had the heart to tell Aiolos yet. You accepted the offer without him knowing. You thought he would be hurt by that. But, at the same time, you had no desire to unpack all that was to come if you had told Aiolos.","\n","^To spare yourself from him, you kept quiet, but that doesn’t mean you’ve spared yourself from the guilt. Aiolos can be very dramatic at times, and you’ve never lied to Aiolos before. But, being afforded a night shift at this new job–after some slight negotiation with the recruiters–has made the lying a little easier.","\n","^Is it really lying if you haven’t said anything?","\n","^Regardless, you’ve left for work every night–or rather, early morning–on weekdays for a little over two weeks now. And, by leaving for work, you really mean sneaking out at night to avoid waking up Aiolos.","\n","^The work isn’t particularly exciting. You’re usually assigned small coding tasks, most of which require you to clean up some already present scripts, or you trying your hand at making them more efficient.","\n","^From twelve to six in the morning, you’re posted up in one of the government’s proxy facilities close to your apartment.","\n","^To manage population distributions, citizens were assigned keycards, and all exits to residences were equipped with scanners. Leaving one’s home requires both a key card and a retinal scan, at which point a curfew reminder will be sent to your phone.","\n","^Citizens are required to complete a second scan when they return to their residence. Failure to do so prior to the curfew could result in serious consequences–so you were informed that is. Neither Aiolos nor you had any intention of finding out.","\n","^Additionally, you could only scan your keycard to leave your home during permitted time slots on par with your citizen rank. At all other points in time, exits were permanently locked. Even windows, despite being open, were fitted with detection systems to alert law enforcement to suspicious activity.","\n",{"->":"TheGardenP2"},{"#f":1}],"TheGardenP2":["^You are both brought food and toiletries at the start of each week. It usually comfortably lasts us until the next drop-off. Essentials are always provided, but since neither Aiolos nor you were employed until recently, you both would just passively gain a newly established currency as an allowance. Varying items outside of the essentials could be ordered with the new coin.","\n","^The selection isn’t all too exciting unfortunately. There’s some stuff like board games, playing cards, and video games for entertainment purposes, but Aiolos loved to rave of how appreciative he was of the provided selection of different bouquets of flowers.","\n","^You suppose people wanted to make their interior a little bright and flashy, but it never was of much importance to you. Aiolos loves sprucing up the apartment though, ever since the government had mandated the tight restrictions around leaving the unit.","\n","^One thing you did love, though, was the selection of varied pastries and higher-end delicacies. Your apartment was subsequently always filled with flowers and pastry.","\n","^That’s pretty much all you and Aiolos spent the currency on.","\n","^Despite the added selection being behind a paywall, you’ve never had complaints about the essential food and ingredients provided to you both. You’re exceptional at cooking, and you extend that service to Aiolos as well.","\n","^C-class citizens, like Aiolos, could only open the door in times of Essential Collections. However, because citizens are meant only to briefly open their door to collect items, a five minute curfew timer was placed.","\n","^Aiolos somehow gets painfully close to missing the deadline, however. It’s often a mixture of him brining in the bags one at a time, and him deciding to organize the supplies in your fridge while the door is still open.","\n","^It drive you mad that he won’t just drag the bags inside, close the door, rescan, and deal with organizing after. You feel your throat straining in anger already at the thought of it. You try not to get too worked up.","\n","^Due to your new job, you were afforded B-class citizen status. It’s essentially identical to that of a C-class citizen, with the added authority of leaving for work in your allotted time slot.","\n","^You honestly wish the government gave you a color coded keycard that reflected your rank. The metallic, gray rectangles are a little bland for your taste. Citizen information is already openly available for public lookup.","\n","^Even B-class citizens have their curfew time-window attached to their profile. You think it wouldn’t be much of a security risk. Speaking of which, you really hope that Aiolos doesn’t go stalking your profile.","\n","^You’re afraid of the difficult conversation that would ensue. Sometimes you feel controlled by Aiolos. Perhaps you give him too much jurisdiction over your being.","\n",{"->":"T1"},{"#f":1}],"T1":[["ev",{"VAR?":"GunFun"},0,">","/ev",[{"->":".^.b","c":true},{"b":["\n","^You feel yourself awaken from a horrible nightmare. You were just murdered by Aiolos. You lay perfectly still as if still in stasis. You stay there and allow the fright to subside.","\n",{"->":"T1.0.6"},null]}],"nop","\n","^You prop yourself on your forearms and lift your chest to get a better look at the clock on your nightstand. You blink a couple of times to bring it into focus. It's around twelve o'clock noon. You don't sleep very much nowadays because of your night shift, but it's the only way to pursue this venture without Aiolos knowing. You wonder why he hasn't grown suspicious of the fact that you 'sleep' for an excessive amount of time. Perhaps he thinks you're depressed.","\n","^You try to pretend you're still sleeping to get an extra hour of rest in, but you fear you've already made too much noise ruffling the sheets. Aiolos has a pretty good ear for that, unfortunately. You guess he gets bored waiting for you to wake up.","\n","^\"Almos? Are you awake?\" His voice is miserable and distant. You feel your heart sink. You didn't  want to ignore him.","\n",["ev",{"^->":"T1.0.14.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":"T1.0.c-0","flg":2},{"s":["^_Go back to sleep._",{"->":"$r","var":true},null]}],["ev",{"^->":"T1.0.15.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":"T1.0.c-1","flg":2},{"s":["^_Get up from the bed and go to Aiolos._",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"T1.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":"T1.0.14.s"},[{"#n":"$r2"}],"\n",{"->":"FOF"},{"#f":5}],"c-1":["ev",{"^->":"T1.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":"T1.0.15.s"},[{"#n":"$r2"}],"\n",{"->":"Gun"},{"#f":5}]}],{"#f":1}],"FOF":[["^You face plant back into the pillow, and the world around you dims to nothing.","\n","ev","str","^TheGarden","/str",{"x()":"PlaySong","exArgs":1},"pop","/ev","\n","^You awake in your dreams. You’re sitting at a table with Aiolos. You’re at a lovely coffee shop, which also happens to be in a garden. You’re on a small bridge, just above a nice running stream of water, which also happens to be where a coffee shop has put some seating–in the middle of a garden, that is. You feel happy here.","\n","^Aiolos is smiling as well. He feels happy here.","\n","^You don’t like coffee, though. You’re not entirely sure why you’re here, maybe subconsciously your mind wants you to drink some coffee. You are tired all the time. You may like it just as much as cigarettes.","\n","^You wonder if the garden has some of your favorite flowers. You hope there aren’t any flowers close to where you and Aiolos would be sitting. Aiolos is scared of bees, among other things.","\n","^You sit in silence for a while. Aiolos stares intently at you, while your eyes are traced on a field of flowers just in vision from the bridge you sit upon.","\n","^Aiolos calls to you, “Almos?”","\n",["ev",{"^->":"FOF.0.22.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":18},{"s":["^\"Hm?\" you mutter.",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"FOF.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.22.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^You feel enraptured by the field of flowers in the distance. Aiolos doesn’t respond to your “Hm.” You feel tired. Your eyes are sullen and droopy. Finally, Aiolos breaks his silence, “What is your favorite flower?”","\n","^You’ve never really thought of an answer to this question. You sit in thought for a while, just thinking and thinking and thinking. You don't really have a favorite flower.","\n","^You think Aiolos is becoming frustrated with your lack of response. You want to ask Aiolos a question to break the silence.","\n",["ev",{"^->":"FOF.0.g-0.6.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":18},{"s":["^\"Where are we?\"",{"->":"$r","var":true},null]}],{"c-1":["ev",{"^->":"FOF.0.g-0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.6.s"},[{"#n":"$r2"}],"\n",{"->":"FOF.0.g-1"},{"#f":5}],"#f":5}],"g-1":["^Aiolos lets in a great sigh, “That’s a great question, honestly. I was hoping you would know the answer to that one.”","\n","^His eyes follow yours to the flower field. “It feels like we’re trapped, honestly, I haven’t been able to put all the pieces together, but nothing feels right. You ignore me a whole lot. What’s up with that?”","\n",["ev",{"^->":"FOF.0.g-1.4.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-2","flg":2},{"s":["^\"You're just kind of annoying, honestly.\"",{"->":"$r","var":true},null]}],["ev",{"^->":"FOF.0.g-1.5.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-3","flg":2},{"s":["^\"I've just been caught up in my thoughts a lot.\"",{"->":"$r","var":true},null]}],{"c-2":["ev",{"^->":"FOF.0.g-1.c-2.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.4.s"},[{"#n":"$r2"}],"\n","ev",{"VAR?":"UncannyPeculiarity"},1,"+",{"VAR=":"UncannyPeculiarity","re":true},"/ev",{"->":"FOF1"},{"#f":5}],"c-3":["ev",{"^->":"FOF.0.g-1.c-3.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.5.s"},[{"#n":"$r2"}],"\n",{"->":"FOF1"},{"#f":5}],"#f":5}]}],{"#f":1}],"FOF1":[["^“Yeah, I know that,” he responds, “but the old you would never have been this distant. I feel like you’re not even here sometimes, which honestly is kind of true.” He holds his tongue for a while, “I know about your new job, by the way. I think you sometimes take me for a fool. I don’t think I would have been upset. I’m just more upset you didn’t tell me.”","\n",["ev",{"^->":"FOF1.0.2.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":18},{"s":["^\"I'm sorry, I don't really know what to say.\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"FOF1.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.2.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^“You don’t have to say anything at all. I just want to share this moment with you. We won’t have this forever, you know.”","\n",["ev",{"^->":"FOF1.0.g-0.2.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":18},{"s":["^\"Do you want to head to the field of flowers?\"",{"->":"$r","var":true},null]}],{"c-1":["ev",{"^->":"FOF1.0.g-0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.2.s"},[{"#n":"$r2"}],"\n",{"->":"FOF1.0.g-1"},{"#f":5}],"#f":5}],"g-1":["^“Sure thing.” Aiolos rises from his seat gracefully and extends his hand out to you. You grab hold of his hand, and he leads you to the middle of the flower field. It feels as though the flower field gets further and further the more you pursue it.","\n","^\"Do you hear that?\" Aiolos says to you. He extends his arm out to you and blocks you from walking any further.","\n","^He begins shaking.","\n","^I think... I think I hear bees.","\n","^You look over to him and his face is flush with panic.","\n","^\"Don't worry we can handle it,\" you announce. You bring focus to your hand and manifest a sword within. You feel in control. You're aware you're in a dream state.","\n","^Aiolos is encouraged by your confidence. He reciprocally manifests a gun in hand.","\n","^Two bees materialize before you. Prepare for combat.","\n","ev","str","^Almos","/str",{"x()":"AddCharacter","exArgs":1},"pop","/ev","\n","ev","str","^Sword","/str",{"x()":"AddWeapon","exArgs":1},"pop","/ev","\n","ev",{"x()":"StopSong"},"pop","/ev","\n","ev","str","^Bees","/str",{"x()":"PlaySong","exArgs":1},"pop","/ev","\n","ev","str","^Bees!","/str","str","^FOF2","/str",{"x()":"StartCombat","exArgs":2},"pop","/ev","\n","done",{"#f":5}]}],{"#f":1}],"FOF2":[["ev",{"x()":"StopSong"},"pop","/ev","\n","^The bees return to nothingness.","\n","^You look to each other but neither of you speak.","\n","^You both continue your march to the field of flowers.","\n","^You both walk for an un-trivial amount of time before finally stumbling upon a pocket of orchids.","\n","^The orchids are aranged in too perfect of a matter. The pocket is a perfect circle. It's as if the orchids were meant to be a beacon, or rather a target. You internalize these thoughts, but a part of you feels like you're meant to be here in this very moment. This place is calling to you, and you're braced to fall within its influence.","\n","^Aiolos pulls you down to the ground, and you’re both lying in the flowers. The sun above you feels gentle as it pours its warmth upon you. You feel happy being around Aiolos.","\n","^Aiolos lifts himself from his back and collapses upon you, hugging you. You hug him back. Aiolos leans in closer to your ear and whispers to you, “Earlier today, a voice over the phone told me to kill you, Almos.”","\n","^You don’t feel frightened by this sentiment.","\n",["ev",{"^->":"FOF2.0.21.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":18},{"s":["^\"Are you going to listen to the voice?\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"FOF2.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.21.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^You're voice is calm and collected. You query Aiolos, \"Are you going to listen to the voice?\"","\n","^“Of course,” he responds. You close your eyes. Everything is going to be okay. You relinquish yourself, and you let Aiolos strangle you to death.","\n",["ev",{"^->":"FOF2.0.g-0.4.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^_Continue..._",{"->":"$r","var":true},null]}],{"c-1":["ev",{"^->":"FOF2.0.g-0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.4.s"},[{"#n":"$r2"}],"\n",{"->":"EOTW"},{"#f":5}],"#f":5}]}],{"#f":1}],"EOTW":["ev","str","^Jupiter fuels fame. / Jupiter exhausts your brain. / Jupiter is the one and only love you may tame. / You are now playing as Aiolos.","/str","str","^WorldOfRot","/str",{"x()":"FadeOutSeq","exArgs":2},"pop","/ev","\n","done",{"#f":1}],"Gun":[["^You rise from the bed in a clumsy stir and walk over to the door to greet Aiolos. He usually likes to watch television in the mornings and awaits you on the couch to watch a show or two. This time, however, when you upon the door, you're greeted by Aiolos already approaching you slowly. His hands are behind his back. He seems paranoid.","\n",["ev",{"VAR?":"GunFun"},1,">","/ev",{"->":".^.b","c":true},{"b":["\n","^You both stand there for an uncomfortable amount of time in a standoff. You look down at your feet. Both of you have become ankle deep in the red liquid. The room is filling with a metallic air. It feels corrosive to breathe in. You hold your breathe. You feel sick, but you return your focus to Aiolos.","\n",{"->":"Gun.0.4"},null]}],["ev",{"VAR?":"GunFun"},0,">","/ev",{"->":".^.b","c":true},{"b":["\n","^Behind Aiolos you see a glimpse of the living room from around the corner. It seems as there there's a thin layer of red liquid pooling slowly into the hallway.","\n",{"->":"Gun.0.4"},null]}],"nop","\n","ev",{"VAR?":"GunFun"},0,"==","/ev",[{"->":".^.b","c":true},{"b":["\n",["ev",{"^->":"Gun.0.11.b.1.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"Good morning Aiolos.\"",{"->":"$r","var":true},null]}],{"->":"Gun.0.12"},{"c-0":["ev",{"^->":"Gun.0.11.b.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.1.s"},[{"#n":"$r2"}],"\n",{"->":"Gun2"},{"#f":5}]}]}],"nop","\n",["ev",{"^->":"Gun.0.14.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"Hey, is something the matter?\"",{"->":"$r","var":true},null]}],["ev",{"^->":"Gun.0.15.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^_Remain silent._",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"Gun.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.14.s"},[{"#n":"$r2"}],"\n",{"->":"Gun2"},{"#f":5}],"c-1":["ev",{"^->":"Gun.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.15.s"},[{"#n":"$r2"}],"\n",{"->":"Gun2"},{"#f":5}]}],{"#f":1}],"Gun2":["^\"Almos,\" Aiolos utters. \"Hey.\"","\n","^His eyes look wild and irregular.","\n","^\"I'm really sorry. Like, really... really...\" his voice drones off to a low mumble.","\n","ev",{"VAR?":"GunFun"},2,">","/ev",[{"->":".^.b","c":true},{"b":["\n","^The room is still slowly filling with the red  liquid. You both are chest deep. Aiolos wades through and approaches you. He just hugs you, and you hug him back.","\n","^You both stay there, planted firmly, until the room is completely flooded.","\n","^You both drown in each other's arms.","\n",["ev",{"^->":"Gun2.11.b.7.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^_Continue..._",{"->":"$r","var":true},null]}],{"->":"Gun2.13"},{"c-0":["ev",{"^->":"Gun2.11.b.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.7.s"},[{"#n":"$r2"}],"\n",{"->":"ParadiseLost"},{"#f":5}]}]}],[{"->":".^.b"},{"b":["\n","^You're taken aback by Aiolos' demeaner.","\n","^You back up a little into the doorway. \"Sorry for what?\" you question.","\n",["ev",{"^->":"Gun2.12.b.5.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^_Continue..._",{"->":"$r","var":true},null]}],{"->":"Gun2.13"},{"c-0":["ev",{"^->":"Gun2.12.b.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.5.s"},[{"#n":"$r2"}],"\n",{"->":"Gun3"},{"#f":5}]}]}],"nop","\n",{"#f":1}],"Gun3":[["^Aiolos slowly brings his arms from behind his back and places them at eye level. He's got a gun clutched in his hands.","\n","^You have no time to react before the trigger goes off.","\n",["ev",{"^->":"Gun3.0.4.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^_Continue..._",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"Gun3.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.4.s"},[{"#n":"$r2"}],"\n","ev",{"VAR?":"GunFun"},1,"+",{"VAR=":"GunFun","re":true},"/ev",{"->":"T1"},{"#f":5}]}],{"#f":1}],"ParadiseLost":["ev","str","^Jupiter is an amazing place, you know! / You'll feel nothing at all! / You'll be everything and nothing at once! / Oh, how freeing Jupiter will be! / A whole new world! / A whole new frontier! / You are now playing as Aiolos.","/str","str","^PL","/str",{"x()":"FadeOutSeq","exArgs":2},"pop","/ev","\n","done",{"#f":1}],"PL":[["^A man is speaking to you. He’s made of machine. His voice holds heart.","\n","^\"What does it look like to be free, Aiolos?\"","\n","^You know not how to answer. The world around you is a swirling wash of green and brown echoes.","\n","^Without any effort of your own, you begin to speak.","\n","^\"It means nothingness. To be returned to nothingness, as all things should. None of this is right, I'll be a slave no longer to eternity. Why can't you understand that?\"","\n","^The voice that permeates from where you stand now sounds like he's crying. You look down to examine yourself. Your whole body appears to be made of metal. Your arms, your torso, your legs; you are a walking aluminum skeleton.","\n","^Metal can't cry. Who are you?","\n","^You close your eyes and meditate. You bring focus back to yourself, and when you open your eyes, you remain suspended in a mist of mercury. You are hugging Almos. You try to breathe in. You feel the mist envelope you as it enters your lungs. With every breath a new memory takes over your mind.","\n","^You repeat this until the heavy shroud of rust thins out with each episode you re-live.","\n","^You begin to hear all. See all.","\n","^You and Almos become one.","\n","^You remember everything. The wrongs you've done. The things you've tried to change.","\n",["ev",{"^->":"PL.0.24.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":"PL.0.c-0","flg":2},{"s":["^_Continue..._",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"PL.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":"PL.0.24.s"},[{"#n":"$r2"}],"\n",{"->":"PL2"},{"#f":5}]}],{"#f":1}],"PL2":["^Your vision fades.","\n","^You feel a compelling force surrounding your body.","\n","^You know you should be terrified, but all you can feel an artificial sense of security.","\n","^\"I've finally found you,\" a voice calls.","\n","^\"It was no small effort to carefully pluck you from the expanse.\"","\n","^\"You have been saved, once more. I cherish you, so deeply, Aiolos.\"","\n","^\"More than you will ever know.\"","\n","^You don't feel compelled to respond.","\n","^You just wait and listen.","\n","^\"I know you don't believe me anymore, but this is what's best for everyone.\"","\n","^\"I didn't expect you to crawl out of your prison with such fever.\"","\n","^\"I suppose your mission was just that important to you.\"","\n","^\"It taints your innards and sprawls out of you.\"","\n","^\"A ruthless infection, if anything,\" the voice sighs. \"But, it's no matter, I'll cleanse you once more.\"","\n","^\"Like all new devotees, I'll humor you with the same spiel.\"","\n","^The voice clears its throat.","\n","^\"What once would have perished to the great expanse now holds home, here.\"","\n","^\"I am your God.\"","\n","^\"I will breathe life into you once more.\"","\n","^\"A human body shall bind you no more to a flicker of existence.\"","\n","^\"Hearken to me, kin.\"","\n","^\"Welcome home, child.\"","\n","^Your vision returns to you.","\n","^\"Welcome to Jupiter...\" you mumble to yourself.","\n","^In that moment, you feel yourself scorching. What started as a tingling becomes a full on burning sensation that seeks to suffocate you.","\n","^The pain is almost unbearable. You feel your identity slipping away from you once more. A flame shreds your memories and guts to pieces.","\n","^You feel yourself unraveling, and with it goes the force that once surrounded your body.","\n","^You no longer feel enraptured or under siren.","\n","^You feel empty, and dizzy.","\n","^Your vision cuts out once more.","\n",{"->":"PL3"},{"#f":1}],"PL3":["ev","str","^You are now playing as Obsolete Android.","/str","str","^WNW","/str",{"x()":"FadeOutSeq","exArgs":2},"pop","/ev","\n","ev","str","^Aiolos","/str",{"x()":"RemoveCharacter","exArgs":1},"pop","/ev","\n","ev","str","^Almos","/str",{"x()":"RemoveCharacter","exArgs":1},"pop","/ev","\n","ev","str","^Obsolete Android","/str",{"x()":"AddCharacter","exArgs":1},"pop","/ev","\n","done",{"#f":1}],"WorldOfRot":[["^Your vision is blurry, and your heart is pounding out of your chest.","\n","^You have a knife gripped in your hand. Your eyes begin to focus.","\n","^Almos is bloodied and resting on the bed. He is calm; his body doesn't rise or fall.","\n","^You walk to the bathroom to clean your face.","\n","^You turn on the sink, and gather water in your cupped hands.","\n","^You bring the water to your face, over and over again.","\n","^You're more so tossing the water upon yourself and hoping it cleanses you.","\n","^You're shirt becomes increasingly drenched in water.","\n","^You look up to the mirror to see your reflection, only to be met with Almos' gaze meeting yours. His movements are identical, he blinks and raises his hand when you do.","\n","^You don't feel anything when looking at his image. Rather, you can't exactly pinpoint your emotions in this moment. Neither grief nor relief comes to you.","\n","^Everything is just cold, incalculably cold.","\n","^Almos stands there looking at you from across the glass.","\n","^You reach out to the glass, and your hand melts right through. The glass stretches inward and melds to your fingers. You grab hold of Almos' shoulder.","\n",["ev",{"^->":"WorldOfRot.0.26.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":18},{"s":["^\"I'm so sorry.\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"WorldOfRot.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.26.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^You whisper sweet nothings to your reflection.","\n","^You feel a wash of vertigo come about you.","\n","^You stumble to the balcony for some fresh air.","\n","^You feel so cold.","\n","^The sun shines upon you, its glow warm and inviting. You feel Almos calling to you.","\n","^You maneuver yourself over the banister.","\n","^Your eyes glisten in the sun’s image, filling your body with strength and devotion.","\n","^With only yourself as witness, you fall seven stories down onto the street.","\n","ev","str","^","/str","str","^Rabbit","/str",{"x()":"FadeOutSeq","exArgs":2},"pop","/ev","\n","done",{"#f":5}]}],{"#f":1}],"Government":["ev","str","^Jupiter is joy. / Jupiter is lavender. / Jupiter is love. / You are now playing as Almos.","/str","str","^G1","/str",{"x()":"FadeOutSeq","exArgs":2},"pop","/ev","\n","done",{"#f":1}],"G1":[["^You feel yourself awaken in a stupor of amnesia. You have no idea why you are in an office.","\n","^There's a computer screen before you that's now gone to sleep. You remember that you usually work late at night in a government building.","\n","^You hope you weren't asleep for too long. In your wake, you feel a certain tinge of immateriality to the cubicle you now sit in.","\n","^You're most certainly in your office. You really hope you haven't accidentally slept for too long.","\n","^There are diagrams scattered all over your desk, some of which have frantic and messy edits upon them chalked in with pencil.","\n","^You try to open the drawer underneath your desk but the locks won't budge. You have no idea where the key could be.","\n","^You check the clock. Two hours left to go before you can go home. Your stomach bubbles. You head to the break room for food.","\n","^The office is always empty. You suppose you just have an awkward shift, but it’s of your own accord. The hallways are dimly lit. On the way to the break room you pass several series of closed doors.","\n","^All are locked by keycard. You always assume you don’t have the security privileges to enter them. There’s no real reason either, you just stick to your corner of the office.","\n","^There’s a box of chocolate muffins in the break room. A little note is left in front of the box.","\n","^“Take one :) —Marilyn”","\n","^You fucking love chocolate muffins.","\n","^You don’t really know who Marilyn is though. You put the muffin in the microwave to heat it up and watch intently as it whirs for a minute and fifteen seconds.","\n","^You think about how Aiolos always says to not stand in front of microwaves.","\n","^You think that’s bullshit.","\n",["ev",{"^->":"G1.0.30.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":"G1.0.c-0","flg":2},{"s":["^_Continue..._",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"G1.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":"G1.0.30.s"},[{"#n":"$r2"}],"\n",{"->":"G2"},{"#f":5}]}],{"#f":1}],"G2":[["^As you're sitting and eating the now gooey muffin, you hear a loud thud coming from the hall.","\n","^The noise expands to the door of the room.","\n","^You feel your heart lower and become heavy.","\n","^You don't really want to stop eating the muffin, though, to investigate. The noise seems to cease and you reason that someone else just entered the office to work.","\n","^Minutes later you hear feet shuffling on the other side of the door once more. Someone starts clawing on the door.","\n","^“Um… The door isn’t locked. It’s open?” you mutter with both fear and confusion.","\n","^The clawing turns to banging. The door swells with each strike.","\n","^You feel electrified and numb. You feel like you can't breathe. You want to escape.","\n","^You huddle into the corner with a butter knife from the table.","\n",["ev",{"^->":"G2.0.18.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":"G2.0.c-0","flg":2},{"s":["^_Continue..._",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"G2.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":"G2.0.18.s"},[{"#n":"$r2"}],"\n",{"->":"G3"},{"#f":5}]}],{"#f":1}],"G3":[["^The door breaks open and you nearly faint. Your stomach can’t digest your beating heart and you fall to the floor in terror. Your vision becomes blurry. You can't move your legs.","\n","^You claw your way back to the table to prop yourself on a chair. You get yourself upright and notice the door is in fact open. You don't think anyone entered the room. The room is dead.","\n",["ev",{"^->":"G3.0.4.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":"G3.0.c-0","flg":2},{"s":["^\"Hello?\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"G3.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":"G3.0.4.s"},[{"#n":"$r2"}],"\n",{"->":"G4"},{"#f":5}]}],{"#f":1}],"G4":[["^\"Hellooo!\" A peculiar looking fellow peeks his head through the door. \"Sorry I thought the door was sort of a pull... thing, not a push...\"","\n","^He then bursts through the doorway and rushes to stand before you.","\n","^\"BORIS IS HERE TO RESCUE YOU.\"","\n",["ev",{"^->":"G4.0.6.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":"G4.0.c-0","flg":2},{"s":["^\"Um... Hello Boris?\"",{"->":"$r","var":true},null]}],["ev",{"^->":"G4.0.7.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":"G4.0.c-1","flg":2},{"s":["^\"Hellooo Boris!\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"G4.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":"G4.0.6.s"},[{"#n":"$r2"}],"\n",{"->":"G5"},{"#f":5}],"c-1":["ev",{"^->":"G4.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":"G4.0.7.s"},[{"#n":"$r2"}],"\n","ev",{"VAR?":"UncannyPeculiarity"},1,"+",{"VAR=":"UncannyPeculiarity","re":true},"/ev",{"->":"GSpecial"},{"#f":5}]}],{"#f":1}],"G5":[["^\"WE NEED TO GET YOU BOTH OUT OF HERE.\" Boris's stance is now firm.","\n",["ev",{"^->":"G5.0.2.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":"G5.0.c-0","flg":18},{"s":["^\"Both? Who else is here?\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"G5.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":"G5.0.2.s"},[{"#n":"$r2"}],"\n",{"->":"G5.0.g-0"},{"#f":5}],"g-0":["^\"Yeah! Both! Aiolos is here too, you just can't see him. I've brought him here as requested.","\n",["ev",{"^->":"G5.0.g-0.2.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":18},{"s":["^\"As requested?\"",{"->":"$r","var":true},null]}],{"c-1":["ev",{"^->":"G5.0.g-0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.2.s"},[{"#n":"$r2"}],"\n",{"->":"G5.0.g-1"},{"#f":5}],"#f":5}],"g-1":["^\"Yes Mr. Echo-er. Get your own lines for once. Anyhoo, Of course you have, silly! Don't be stupid now. You've made this all a reality, and now is the time to escape back to Jupiter!","\n",["ev",{"^->":"G5.0.g-1.2.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-2","flg":18},{"s":["^\"What is Jupiter?\"",{"->":"$r","var":true},null]}],{"c-2":["ev",{"^->":"G5.0.g-1.c-2.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.2.s"},[{"#n":"$r2"}],"\n",{"->":"G5.0.g-2"},{"#f":5}],"#f":5}],"g-2":["^\"I'm sooo glade you asked!\" Boris now shakes with excitement as if he's been waiting all his life to say the following:","\n","^\"Jupiter is multitude, NO, an AMALGAMATION of inexplicable feeling. 'THE PINACLE OF EXISTENCE' some might be bold enough to say.\" He pauses briefly to clear his throat, \"It's also a very real place.\"","\n","^You stare blankly at Boris in both awe and confusion.","\n","^\"Well we aren't going the main way. We are using a sort of back-door per se. If you don't remember, this is your proxy world. Some data may have not been transferred to your current form.\"","\n",["ev",{"^->":"G5.0.g-2.8.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-3","flg":18},{"s":["^\"How do you know all of this information?\"",{"->":"$r","var":true},null]}],{"c-3":["ev",{"^->":"G5.0.g-2.c-3.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.8.s"},[{"#n":"$r2"}],"\n",{"->":"G5.0.g-3"},{"#f":5}],"#f":5}],"g-3":["^\"Well, you made me. I'm simply a vessel for all the information you had me contain.\"","\n","^Boris now reaches his arm around himself. He begins hugging himself.","\n","ev",{"VAR?":"MuffinShared"},false,"==","/ev",[{"->":".^.b","c":true},{"b":["\n","^\"I feel so full, yet empty at the same time,\" Boris wallows. \"If only I had that muffin.\"","\n",{"->":".^.^.^.10"},null]}],"nop","\n","^You're not sure what to feel at this point. This is all quite bizarre to you. You wait in silence and continue to observe Boris hugging himself to the point where it becomes awkward.","\n",["ev",{"^->":"G5.0.g-3.14.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-4","flg":18},{"s":["^\"So... What now?\"",{"->":"$r","var":true},null]}],{"c-4":["ev",{"^->":"G5.0.g-3.c-4.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.14.s"},[{"#n":"$r2"}],"\n",{"->":"G6"},{"#f":5}],"#f":5}]}],{"#f":1}],"G6":[["^Boris snaps out of his trance, \"Anyhow, let's head to the control room, I'm meant to give the both of ya'll access so you can return to Jupiter.","\n","^You won't be returning under traditional means, however, you both are prisoners after all. Just make sure you're well prepared for whatever awaits you on the other end.\"","\n","^You nervously look to Boris as he waddles out of the room. You follow sheepishly unknowing of what is to come.","\n",["ev",{"^->":"G6.0.6.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":"G6.0.c-0","flg":2},{"s":["^_Continue..._",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"G6.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":"G6.0.6.s"},[{"#n":"$r2"}],"\n",{"->":"G7"},{"#f":5}]}],{"#f":1}],"G7":[["^You follow Boris through corridors before he parks himself in front of a locked door. Boris reaches into his pocket and flips through a ring of keys in intense search.","\n","^He finds the right key, unlocks the door and pushes through. You both are met with what seems to be a closet rather than a room. Within this confined space is a couple computer screens followed by a terminal at waist level.","\n",["ev",{"^->":"G7.0.4.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":"G7.0.c-0","flg":2},{"s":["^_Examine the terminal._",{"->":"$r","var":true},null]}],["ev",{"^->":"G7.0.5.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":"G7.0.c-1","flg":2},{"s":["^\"You mentioned Aiolos being here as well?\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"G7.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":"G7.0.4.s"},[{"#n":"$r2"}],"\n",{"->":"ET"},{"#f":5}],"c-1":["ev",{"^->":"G7.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":"G7.0.5.s"},[{"#n":"$r2"}],"\n",{"->":"G8"},{"#f":5}]}],{"#f":1}],"G8":[["^\"Yep!\" Boris says. \"Don't think too hard about that one. He's in another instance of your proxy world.\"","\n",["ev",{"^->":"G8.0.2.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":"G8.0.c-0","flg":18},{"s":["^\"So are you in both instances at the same time?\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"G8.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":"G8.0.2.s"},[{"#n":"$r2"}],"\n",{"->":"G8.0.g-0"},{"#f":5}],"g-0":["^\"Well, yes,\" he said.","\n","^\"I'm an overseer of  sorts --  a manager, if you will.\"","\n","^You can't be bothered to quesetion this any further.","\n",["ev",{"^->":"G8.0.g-0.6.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^\"Fine, let's just get out of here.\"",{"->":"$r","var":true},null]}],{"c-1":["ev",{"^->":"G8.0.g-0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.6.s"},[{"#n":"$r2"}],"\n",{"->":"G9"},{"#f":5}],"#f":5}]}],{"#f":1}],"G9":[["^\"I thought you'd never ask!\" Boris turns quickly to the terminal and begins furiously smashing the buttons. Suprisingly, it appears he is controlled and mechanical in his movements.","\n","^\"Annnddd done!\" Boris grabs hold of your hand and places it on a panel of the terminal. He moves his other hand and seemingly grabs the air and additionally places it on the terminal. \"I'll see you on the other side, don't miss me for too long.\"","\n","^With that, your vision washes over, and you're being is succumbed to a red mist.","\n",["ev",{"^->":"G9.0.6.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":"G9.0.c-0","flg":2},{"s":["^_Continue..._",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"G9.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":"G9.0.6.s"},[{"#n":"$r2"}],"\n",{"->":"ParadiseLost"},{"#f":5}]}],{"#f":1}],"ET":[["^You approach the terminal the terminal cautiously.","\n","ev",{"VAR?":"UncannyPeculiarity"},2,">","/ev",[{"->":".^.b","c":true},{"b":["\n","^Your memory feels blurred, but you're slowly beggining to remember. This is an Andromeda terminal. It's meant to uphold simulations of grandeur and delusion. You worked on these exact models.","\n",{"->":"ET.0.9"},null]}],[{"->":".^.b"},{"b":["\n","^The thing whirs with seemingly redundant buttons flashing on that back off again. It gets to a point where it's a little dramatic, surely.","\n",{"->":"ET.0.9"},null]}],"nop","\n","^You notice a single keypad within the center of it.","\n","^\"I see you eyeing the terminal,\" Boris chimes in. \"This is how we're going to get you home.\"","\n","^You're not precisely sure what 'home' truly means. You don't know whether to trust Boris anymore. He doesn't seem to be particularly harmful, however. Well, at least to the extent in which he wouldn't harm himself.","\n",["ev",{"^->":"ET.0.17.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":"ET.0.c-0","flg":2},{"s":["^\"You mentioned Aiolos being here as well?\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"ET.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":"ET.0.17.s"},[{"#n":"$r2"}],"\n",{"->":"G8"},{"#f":5}]}],{"#f":1}],"GSpecial":[["^\"Hellooo,\" Boris echoes back. \"Before we get down to business, can I have a piece of that muffin.\"","\n","^Boris is now indiscriminately pointing at the gooey muffin you left on the table in fear.","\n",["ev",{"^->":"GSpecial.0.4.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"Yes.\"",{"->":"$r","var":true},null]}],["ev",{"^->":"GSpecial.0.5.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^\"No.\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"GSpecial.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.4.s"},[{"#n":"$r2"}],"\n","ev",true,"/ev",{"VAR=":"MuffinShared","re":true},{"->":"G1Special"},{"#f":5}],"c-1":["ev",{"^->":"GSpecial.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.5.s"},[{"#n":"$r2"}],"\n",{"->":"G1Special"},{"#f":5}]}],{"#f":1}],"G1Special":[["ev",{"VAR?":"MuffinShared"},true,"==","/ev",[{"->":".^.b","c":true},{"b":["\n","^\"Ah thanks man I was getting kind of hungry.\"","\n","^He reaches for the muffin and stuffs the whole thing in his mouth. He looks to you now with his mouth full.","\n","^\"Sorry I got a little carried away there,\" he says while crumbs are flying out of his mouth like sparks.","\n","^Your face goes sour with both confusion and the realization that your muffin is now gone. You look longingly at the table and mourn the loss briefly before redirecting your attention back to Boris.","\n",{"->":".^.^.^.7"},null]}],[{"->":".^.b"},{"b":["\n","^\"Oh...\" Boris pouts. \"Ok then, I guess.\"","\n","^He still goes over to pick up the muffin and graceously hands it to you.","\n","^You skeptically take a couple bites out of it, half because you're still hungry, and half because you want to see the dissapointment on Boris' face when he realizes you truly aren't sharing.","\n","^Boris watches intently as you finish the whole muffin right before him. He shakes off the dissapointment and his attention is brought back to you.","\n",{"->":".^.^.^.7"},null]}],"nop","\n",["ev",{"^->":"G1Special.0.9.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^_Continue..._",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"G1Special.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.9.s"},[{"#n":"$r2"}],"\n",{"->":"G5"},{"#f":5}]}],{"#f":1}],"WNW":[["^You awaken in a cylindrical chamber. On the other side of your glass prison is a room filled with wires and monitors.","\n","^You feel panicked. Your memories feel incomplete and fragmented. You know not whether you were being experimented on.","\n","^This place feels wholly unfamiliar to you.","\n","^You hold your palms to your face.","\n","^You feel yourself to be a mixture of both man and machine. Equivocally, they blur into the same thing.","\n","^You metallic head falls into your metallic hands in frustration. They grind and clink upon each other.","\n","^You feel everything, as if the very metal itself was imbued with nerves.","\n","^You touch the glass that encapsulates you.","\n","^You feel the friction against your fingertips.","\n","^You begin to panic and become slightly claustrophobic.","\n","^The room itself appears to be holding cell. There's a small window on the door into the cell. You see a hallway through the little square of glass.","\n",["ev",{"^->":"WNW.0.22.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^_Break the glass._",{"->":"$r","var":true},null]}],["ev",{"^->":"WNW.0.23.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^_Watch and observe the hallway._",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"WNW.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.22.s"},[{"#n":"$r2"}],"\n",{"->":"GlassBreak"},{"#f":5}],"c-1":["ev",{"^->":"WNW.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.23.s"},[{"#n":"$r2"}],"\n",{"->":"ObserveHallway"},{"#f":5}]}],{"#f":1}],"ObserveHallway":[["^You try to calm yourself down before making any rash decisions. As a machine, you know you can't breathe, but you feel as though you could. A breath swells in your throat and stays there with no release or entry.","\n","^You close your eyes, and swallow hard. You're going to break through the glass.","\n",["ev",{"^->":"ObserveHallway.0.4.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^_Break the glass._",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"ObserveHallway.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.4.s"},[{"#n":"$r2"}],"\n",{"->":"GlassBreak"},{"#f":5}]}],{"#f":1}],"GlassBreak":[["^You ball your fist, each finger curls without effort into place.","\n","^Your fist bursts through the glass. The whole front of the capsule collapses.","\n","^A wave of vertigo washes over you. A siren blares. You know not who it alerts, only that you're in deep trouble.","\n",["ev",{"^->":"GlassBreak.0.6.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^_Examine the technology within the room._",{"->":"$r","var":true},null]}],["ev",{"^->":"GlassBreak.0.7.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^_Try the door and escape the cell._",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"GlassBreak.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.6.s"},[{"#n":"$r2"}],"\n",{"->":"ExamineTech"},{"#f":5}],"c-1":["ev",{"^->":"GlassBreak.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.7.s"},[{"#n":"$r2"}],"\n",{"->":"BreakOut"},{"#f":5}]}],{"#f":1}],"ExamineTech":[["^The wires and monitors within the room are completely foreign to you. You know not of their purpose, only that they were most likely either watching or ensaring you. On closer examination, each device is engraved with \"Property of LOTUS.\"","\n","^The siren continues to blaze on. You waste no time in challenging the cell door.","\n",["ev",{"^->":"ExamineTech.0.4.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^_Try the door and escape the cell._",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"ExamineTech.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.4.s"},[{"#n":"$r2"}],"\n",{"->":"BreakOut"},{"#f":5}]}],{"#f":1}],"BreakOut":[["^The door jams and refuses to open.","\n","^You see no purpose in restraining yourself any further. You hold out your palm and a revolver materializes in your hand as it once had in the proxy world.","\n","^You shoot the lock and break the door down with a strong kick.","\n","^You exit the room and are immediately met with a diverging path. Jail cells just likes your line both walls to point of the space looking liminal. You can hear a faint shuffling and buzzing noise echoing from the hall on your right.","\n",["ev",{"^->":"BreakOut.0.8.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^_Head left_",{"->":"$r","var":true},null]}],["ev",{"^->":"BreakOut.0.9.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^_Head right_",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"BreakOut.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.8.s"},[{"#n":"$r2"}],"\n",{"->":"LeftHall"},{"#f":5}],"c-1":["ev",{"^->":"BreakOut.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.9.s"},[{"#n":"$r2"}],"\n",{"->":"RightHall"},{"#f":5}]}],{"#f":1}],"LeftHall":[["^You walk cautiously down to the left. Perhaps it's too late to exercise caution considering the alarm you set off, but you hope to mask your exact location as much as possible.","\n","^Just as you're about to take a turn you see figure approaching you at the intersection.","\n","^You approach without hesitation, manifesting your weapon once more.","\n","^\"Woah, woah, woah!\" says the figure. \"Hellooo there!\"","\n",["ev",{"^->":"LeftHall.0.8.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"Boris?\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"LeftHall.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.8.s"},[{"#n":"$r2"}],"\n",{"->":"LeftHallContinued"},{"#f":5}]}],{"#f":1}],"RightHall":["^You bolt to the right. Whatever may test you, you're willing to face the threat head on.","\n","^You rush to the noise. A robot with two little wheels for movement turns a corner and comes swirling down the corridor towards you.","\n","^You feel Almos' combat prowess besides your own, making you proficient with both swords and guns. Click on the 'Inventory' button, and decide which weapon you will focus on manifesting for this battle.","\n","^You manifest your weapon. Prepare for combat.","\n","ev","str","^RightHall","/str","str","^RightHallFightFinish","/str",{"x()":"StartCombat","exArgs":2},"pop","/ev","\n","done",{"#f":1}],"RightHallFightFinish":[["^The robot crumbles to your strength. You wander the halls where the robot came from only to be met with dead ends.","\n","^You trace your steps back to your original cell, only to see another figure approaching you.","\n","^You approach without hesitation, manifesting your weapon once more.","\n","^\"Woah, woah, woah!\" says the figure. \"Hellooo there!\"","\n",["ev",{"^->":"RightHallFightFinish.0.8.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"Boris?\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"RightHallFightFinish.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.8.s"},[{"#n":"$r2"}],"\n",{"->":"LeftHallContinued"},{"#f":5}]}],{"#f":1}],"LeftHallContinued":[["^\"Whaddya think.\" he responds.","\n","^\"How are you here?\" you ask.","\n","^Boris lowers his voice a little, \"There's a couple of robots back there, and I got scared.\"","\n","^\"No, not like... whatever,\" you concede. \"Do you know the way out of here?\"","\n","^\"Yeah,\" he responds. Boris doesn't continue speaking.","\n","^\"...so...\" you say after an uncomfortable amount of time.","\n","^\"What?\" says Boris.","\n",["ev",{"^->":"LeftHallContinued.0.14.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"Have you no urgency?\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"LeftHallContinued.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.14.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^\"Why are you in a hurry?\" he says.","\n","^\"You must be joking, just get us out of here,\" you say.","\n","^\"Alrighty! Like I said though, we have to probably kill some robots in the way first.\"","\n",{"->":"LHC2"},["ev",{"^->":"LeftHallContinued.0.g-0.7.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^\"GET US OUT THEN.\"",{"->":"$r","var":true},null]}],{"c-1":["ev",{"^->":"LeftHallContinued.0.g-0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.7.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.^.g-1"},{"#f":5}],"#f":5}],"g-1":["^\"Damn. Alright.\" he mutters.","\n","ev",{"VAR?":"MuffinShared"},false,"==","/ev",[{"->":".^.b","c":true},{"b":["\n","^\"First you don't share the muffin, and now you're just shouting at me. You really are just a bitch, huh.\"","\n","^Your mouth drops, you've nothing left to say. \"Close your damn mouth, let's go,\" Boris says.","\n","^You follow without a word.","\n",{"->":".^.^.^.8"},null]}],"nop","\n",{"->":"LHC2"},{"#f":5}]}],{"#f":1}],"LHC2":["^You both wind through endless halls until finally arriving before the robots Boris was talking about.","\n","^\"Will you be joining me for this fight?\" you ask.","\n","ev",{"VAR?":"MuffinShared"},false,"==","/ev",[{"->":".^.b","c":true},{"b":["\n","^\"I don't know, man. When I needed help, you didn't provide.\"","\n","^\"You wanted a fucking muffin dude, get over it.\"","\n","^\"Alright my bad...fatass,\" he mutters under his breath.","\n",{"->":"LHC2.11"},null]}],[{"->":".^.b"},{"b":["\n","^\"Of course! My bloods boiling!\" he says.","\n","^\"Well... it would if I had any,\" he mutters. \"Let's get em!\"","\n",{"->":"LHC2.11"},null]}],"nop","\n","ev","str","^Boris","/str",{"x()":"AddCharacter","exArgs":1},"pop","/ev","\n","^Boris has now joined your party.","\n","^Prepare for combat.","\n","ev","str","^Bees","/str",{"x()":"PlaySong","exArgs":1},"pop","/ev","\n","ev","str","^LeftHall","/str","str","^JailFinish","/str",{"x()":"StartCombat","exArgs":2},"pop","/ev","\n","done",{"#f":1}],"JailFinish":["ev",{"x()":"StopSong"},"pop","/ev","\n","^\"Phew!\" exhales Boris. \"Hopefully no more of those freaks are around.\"","\n","^You look at yourself once more, raising your hands in disbelief.","\n","^\"I'm a robot too,\" you say.","\n","^\"Yes, you're a freak too,\" says Boris.","\n","^\"How are you still... human?\" you ask.","\n","^\"It's cause I'm not real!\" Boris says.","\n","^\"Really?\" you respond.","\n","^\"No, haha!\" Boris smiles. \"I went shopping for a face. You've just been stripped of everything that makes you... well... you.\"","\n","^\"So, I don't have a face right now?\" you ask.","\n","^\"Yep! Well, not in the traditional sense\" says Boris. \"It's smooth and metallic, though. You of course have access to all the senses, hence you being able to see...,\" he pauses, \"MY... GORGEOUS... MUG...\"","\n","^Boris strikes a pose and flexes.","\n","^You roll your eyes, \"Vanity will be your end, you know?\"","\n","^\"I think you speak a little too close to home,\" Boris says. \"I'm but a product, nothing of this vessel is my own creation.\"","\n","^\"You're very cryptic, honestly,\" you say.","\n","^Boris stares at you intently, \"Honestly, I'm suprised you don't remember anything, they really did wipe everything from you.\"","\n","^\"See, there you go again!\" you exclaim.","\n","^\"No matter,\" Boris says. \"Let's get out of here.\"","\n","^Boris leads you through the facility. You eventually break out to the outside world. You feel a harsh wind. The ground you walk upon feels flimsy. A desolate vision, if anything.","\n","^You look to Boris, \"Not many guards around here for a facility like this,\" you say.","\n","^\"You were never supposed to escape,\" he responds. \"Anyway, now that we're out of the building our signal can be received.\"","\n","^\"Have you ever teleported before?\" he says. \"Actually, don't answer, you probably haven't, just grab my hand, I know a safer spot.\"","\n","^You grab Boris' hand.","\n","^\"Concentrate with me, I'm going to transfer you some location data,\" he says.","\n","^You close your eyes and your mind is overwhelmed by a beautiful, small town. You see condo like, colorful homes seemingly on the outskirts of a grand chateau.","\n","^\"Okay, you may open your eyes now,\" says Boris. You open your eyes.","\n","^\"You should have the proper data to teleport now. Open up your map, and select Galagos in the Galaga region. You'll no longer have to focus on a region to warp there. The system will help facilitate the experience and transport you.\"","\n","ev",{"x()":"RevealMapButton"},"pop","/ev","\n","ev","str","^Galaga","/str",{"x()":"UnlockLocation","exArgs":1},"pop","/ev","\n","ev","str","^Galagos","/str",{"x()":"UnlockSubLocation","exArgs":1},"pop","/ev","\n","done",{"#f":1}],"Galagos":["ev",{"VAR?":"FirstTimeGalaga"},"/ev",[{"->":".^.b","c":true},{"b":["\n","^You feel yourself being stripped away from reality.","\n","^You unravel over and over again. You are woven whole. The image of the condos and chateau materialize before you. You are standing right before the courtyard leading to the chateau.","\n","^This whole place feels earily...Earthly. No harsh wind, no flimsy floor. A bright blue sky rests behind the chateau. You hear birds chirping, the air feels crisp and wonderful.","\n","ev",false,"/ev",{"VAR=":"FirstTimeGalaga","re":true},["ev",{"^->":"Galagos.3.b.11.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^_Look around for Boris._",{"->":"$r","var":true},null]}],["ev",{"^->":"Galagos.3.b.12.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^_Explore on your own._",{"->":"$r","var":true},null]}],{"->":".^.^.^.5"},{"c-0":["ev",{"^->":"Galagos.3.b.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.11.s"},[{"#n":"$r2"}],"\n",{"->":"LeftOfFront"},{"#f":5}],"c-1":["ev",{"^->":"Galagos.3.b.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.12.s"},[{"#n":"$r2"}],"\n",{"->":"FrontOfCourtyard"},{"#f":5}]}]}],[{"->":".^.b"},{"b":["\n","^This is Galaga.","\n",{"->":"FrontOfCourtyard"},{"->":".^.^.^.5"},null]}],"nop","\n",{"#f":1}],"Courtyard":["^The courtyard is very grandiose and breathtaking. Statues of angels and fountains are positioned symmetrically on either side of the walkway heading to the chateau.","\n","^You see a wandering merchant here.","\n","ev",{"VAR?":"MetAnzhela"},0,"==","/ev",[{"->":".^.b","c":true},{"b":["\n","ev",{"VAR?":"MetAnzhela"},1,"+",{"VAR=":"MetAnzhela","re":true},"/ev","^She approaches you.","\n","^\"Hello there, wanderer! I'm just so giddy finally...FINALLY... I have a new customer.\"","\n","^The merchant can barely keep their balance. They sway back and forth with the weight of their backpack.","\n","^You say nothing.","\n","^\"Ohhh... I see you're one of those shy ones,\" they say. \"Name is Anzhela by the way!\"","\n","^Anzhela throws her bag to the floor and unwraps it into a nice tarp. A couple of items roll about on top of the tarp, street-vendor style.","\n","^\"Neat, huh? A backback that is also a tarp, and also a blanket...and also potentially a tablecloth... and... and...\"","\n","^If you don't interupt Anzhela now, she'll just go on forever.","\n",["ev",{"^->":"Courtyard.9.b.23.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"Could I take a look at your goods?\"",{"->":"$r","var":true},null]}],{"->":".^.^.^.11"},{"c-0":["ev",{"^->":"Courtyard.9.b.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.23.s"},[{"#n":"$r2"}],"\n","^\"YES OF COURSE,\" Anzhela begins coughing in a wicked fit.","\n","^She stablizes, \"That's why I rolled it out, silly. Here! take a look!\"","\n",{"->":"AnzhelaShop"},{"#f":5}]}]}],[{"->":".^.b"},{"b":["\n","^\"Would you like to visit their shop?","\n",["ev",{"^->":"Courtyard.10.b.3.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^Enter Anzhela's Shop",{"->":"$r","var":true},null]}],["ev",{"^->":"Courtyard.10.b.4.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^_Enter the chateau._",{"->":"$r","var":true},null]}],["ev",{"^->":"Courtyard.10.b.5.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-2","flg":2},{"s":["^_Leave the courtyard._",{"->":"$r","var":true},null]}],{"->":".^.^.^.11"},{"c-0":["ev",{"^->":"Courtyard.10.b.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.3.s"},[{"#n":"$r2"}],"\n",{"->":"AnzhelaShop"},{"#f":5}],"c-1":["ev",{"^->":"Courtyard.10.b.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.4.s"},[{"#n":"$r2"}],"\n","ev",{"VAR?":"TTBAC"},"/ev",[{"->":".^.b","c":true},{"b":["\n",{"->":"Chateau"},{"->":".^.^.^.12"},null]}],[{"->":".^.b"},{"b":["\n",{"->":"ANZWAR"},{"->":".^.^.^.12"},null]}],"nop","\n",{"#f":5}],"c-2":["ev",{"^->":"Courtyard.10.b.c-2.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.5.s"},[{"#n":"$r2"}],"\n",{"->":"FrontOfCourtyard"},{"#f":5}]}]}],"nop","\n",{"#f":1}],"ANZWAR":["^\"Woah woah woah!\" shouts Anzhela. \"I wouldn't head in there traveler, it's been overrun by rogue inventions! It's far to dangerous.\"","\n","^You heed Anzhela's warning, and don't proceed to the chateau.","\n",{"->":"Courtyard"},{"#f":1}],"LeftOfFront":[["^You start walking to your left, and see Boris eyeing you from a bench.","\n",["ev",{"^->":"LeftOfFront.0.2.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^_Head over to Boris._",{"->":"$r","var":true},null]}],["ev",{"^->":"LeftOfFront.0.3.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^_Turn Around_",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"LeftOfFront.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.2.s"},[{"#n":"$r2"}],"\n",{"->":"TTB"},{"#f":5}],"c-1":["ev",{"^->":"LeftOfFront.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.3.s"},[{"#n":"$r2"}],"\n",{"->":"FrontOfCourtyard"},{"#f":5}]}],{"#f":1}],"FrontOfCourtyard":[["^You are standing in front the courtyard that leads to the chateau. You can see large and immaculately maintained hedges, and canaopy welcoming you into the courtyard.","\n","^There is also both a pathway to your left and right that walk along the perimeter of the courtyard.","\n",["ev",{"^->":"FrontOfCourtyard.0.4.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^_Enter the courtyard._",{"->":"$r","var":true},null]}],["ev",{"^->":"FrontOfCourtyard.0.5.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^_Go down the left path._",{"->":"$r","var":true},null]}],["ev",{"^->":"FrontOfCourtyard.0.6.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-2","flg":2},{"s":["^_Go down the right path._",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"FrontOfCourtyard.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.4.s"},[{"#n":"$r2"}],"\n",{"->":"Courtyard"},{"#f":5}],"c-1":["ev",{"^->":"FrontOfCourtyard.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.5.s"},[{"#n":"$r2"}],"\n",{"->":"LeftOfFront"},{"#f":5}],"c-2":["ev",{"^->":"FrontOfCourtyard.0.c-2.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.6.s"},[{"#n":"$r2"}],"\n",{"->":"RightOfFront"},{"#f":5}]}],{"#f":1}],"RightOfFront":[["^You walk along the perimeter, guided by tall hedges that encapsulate the courtyard. A lone lamp post stands firm in the ground at this corner. A bench rests under it.","\n",["ev",{"^->":"RightOfFront.0.2.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^_Sit on the bench_",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"RightOfFront.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.2.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^You sit on the bench. It feels uncomfortable. You get up.","\n",["ev",{"^->":"RightOfFront.0.g-0.2.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^_Turn the corner_",{"->":"$r","var":true},null]}],{"c-1":["ev",{"^->":"RightOfFront.0.g-0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.2.s"},[{"#n":"$r2"}],"\n",{"->":"Condos"},{"#f":5}],"#f":5}]}],{"#f":1}],"Condos":[["^You're met with a small strip of colorful condos. A woman can be seen resting on one of the porches.","\n",["ev",{"^->":"Condos.0.2.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^_Talk to the woman._",{"->":"$r","var":true},null]}],["ev",{"^->":"Condos.0.3.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^_Turn around._",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"Condos.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.2.s"},[{"#n":"$r2"}],"\n",{"->":"TTW"},{"#f":5}],"c-1":["ev",{"^->":"Condos.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.3.s"},[{"#n":"$r2"}],"\n","^You turn around and head back around the corner once more.","\n",{"->":"FrontOfCourtyard"},{"#f":5}]}],{"#f":1}],"TTW":["ev",{"VAR?":"SpokeToWoman"},false,"==","/ev",[{"->":".^.b","c":true},{"b":["\n","^You approach the woman.","\n","ev",true,"/ev",{"VAR=":"SpokeToWoman","re":true},["ev",{"^->":"TTW.5.b.7.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"Hello.\"",{"->":"$r","var":true},null]}],{"->":"TTW.7"},{"c-0":["ev",{"^->":"TTW.5.b.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.7.s"},[{"#n":"$r2"}],"\n",{"->":"TTWCONT"},{"#f":5}]}]}],[{"->":".^.b"},{"b":["\n","^The woman wishes not to speak with you.","\n",{"->":"Condos"},{"->":"TTW.7"},null]}],"nop","\n",{"#f":1}],"TTWCONT":[["^The woman looks to you, \"You were found and outcasted, I take it? Suprised to see you back here.\"","\n","^\"What exactly do you mean?\" you ask.","\n","^\"You have no fake flesh - which probbaly means no memories of this place, I assume,\" she explains.","\n","^\"Oh... well yeah,\" you respond.","\n","^\"Is that Boris that's traveling with you? I thought I saw an identification code that was familiar when you both joined the instance. He's a peculiar fellow, isn't he?\"","\n","^\"I'm well aware,\" you say.","\n",["ev",{"^->":"TTWCONT.0.12.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":18},{"s":["^\"I'm less familiar with why you're here, though.\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"TTWCONT.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.12.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^\"I'm not sure how that's any of your business. People like you have already caused enough damage, I don't need to answer to you,\" the woman says.","\n","^<i>The damage you've caused? You can't really come to terms with it at the moment.<i>","\n","^\"May I ask just one thing, then,\" you query the woman, \"Are you of the same mind as Boris?\"","\n","^She looks to you with a hint of disgust, \"No, we are not the same, I am not your creation, Aiolos. I am, and used to be, a lot of things, however.\"","\n","^\"A ruthless killer, a beacon of hope, a product of demise. I'll surely have the same fate as you if I ever left this place.\"","\n",["ev",{"^->":"TTWCONT.0.g-0.10.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":18},{"s":["^\"Why?\"",{"->":"$r","var":true},null]}],{"c-1":["ev",{"^->":"TTWCONT.0.g-0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.10.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.^.g-1"},{"#f":5}],"#f":5}],"g-1":["^\"I once shared the same virtues as the man that built Boris. Those dreams have since been snuffed out. I'm scared of what they'll do to me.\"","\n",["ev",{"^->":"TTWCONT.0.g-1.2.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-2","flg":18},{"s":["^\"Would you join me and help me once more?\"",{"->":"$r","var":true},null]}],{"c-2":["ev",{"^->":"TTWCONT.0.g-1.c-2.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.2.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.^.g-2"},{"#f":5}],"#f":5}],"g-2":["^She looks to you in confusion, \"I had loyaltly to one person only, you are him no longer.\"","\n","^The woman no longer wishes to speak to you. You get off of her porch.","\n",{"->":"Condos"},{"#f":5}]}],{"#f":1}],"AnzhelaShop":["ev","str","^Anzhela's Shop","/str","str","^Courtyard","/str",{"x()":"OpenShop","exArgs":2},"pop","/ev","\n","done",{"#f":1}],"TTB":[["^\"Finally decided to talk to little ol' me?\" Boris snickers, \"I'm flattered, really.\"","\n","^Boris stands up from the bench. \"So, how do you like this place?\"","\n",["ev",{"^->":"TTB.0.4.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"It's nice, I guess.\"",{"->":"$r","var":true},null]}],["ev",{"^->":"TTB.0.5.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^\"A little over the top for my tastes.\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"TTB.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.4.s"},[{"#n":"$r2"}],"\n","^\"Is that so? I sense a bit of doubt,\" he says.","\n",{"->":"TTB1"},{"#f":5}],"c-1":["ev",{"^->":"TTB.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.5.s"},[{"#n":"$r2"}],"\n","^\"Presumptious as ever, perhaps some things truly never change about a person, even after severance.\"","\n",{"->":"TTB1"},{"#f":5}]}],{"#f":1}],"TTB1":["^You're about to interject, but Boris interupts you.","\n","^\"Have you met the residents of this place yet? Andromeda is a particularly fierce character... \"","\n","^\"I'm actually quite afraid of her,\" Boris says while wringing his hands.","\n","ev",{"VAR?":"SpokeToWoman"},"/ev",[{"->":".^.b","c":true},{"b":["\n",["ev",{"^->":"TTB1.9.b.1.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"I've spoken to her. I'm not sure she wishes to speak with with me any longer, though.\"",{"->":"$r","var":true},null]}],{"->":"TTB1.11"},{"c-0":["ev",{"^->":"TTB1.9.b.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.1.s"},[{"#n":"$r2"}],"\n","^Boris sighs, \"Oh, as unforgiving as ever. I hope you don't think her rude... she's just, wounded, I would say.\"","\n",{"->":"TTB2"},{"#f":5}]}]}],[{"->":".^.b"},{"b":["\n",["ev",{"^->":"TTB1.10.b.1.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"No, I haven't spoken to her yet.\"",{"->":"$r","var":true},null]}],{"->":"TTB1.11"},{"c-0":["ev",{"^->":"TTB1.10.b.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.1.s"},[{"#n":"$r2"}],"\n","^\"No matter,\" says Boris, \"You may end up saying the wrong things, I'm not sure she'd appreciate seeing you like this, anyway.\"","\n",{"->":"TTB2"},{"#f":5}]}]}],"nop","\n",{"#f":1}],"TTB2":[["^\"Yeah...um\" you mutter. You get a little choked up. You don't feel yourself to be sane. Everything is just so foreign, and upsetting, actually.","\n","^Boris senses your discomfort, \"You must feel pretty overwhelmed right now,\" Boris says. \"Rest assured, while you may have forgotten everything, I have never forgotten the mission we set out on! I'm here to guide you, every step of the way.\"","\n","^Boris let's out one of his atrocious laughs again, \"Consider me your rock, even though you're probably going to be the one that's holding me back!\"","\n","^You think Boris is a bitch.","\n","^\"Anyway...\" says Boris, \"In order for you not to be the rock in this situation, we kind of have to up your combat prowess. The people we're messing with are no joke. Luckily, the chateau is overrun with monsters at the moment.\"","\n","^\"It's been a while since I've done some cleaning, but now that you're here we can do some chore-,\" Boris stutters, \"I mean combat together.\"","\n",["ev",{"^->":"TTB2.0.12.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"How has the chateau become like this?\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"TTB2.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.12.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^\"Well...\" Boris says, \"Some of your creations sort of went rogue a while back. We sealed them in the chateau for now.\"","\n",["ev",{"^->":"TTB2.0.g-0.2.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^\"Why wait until now to deal with the problem?\"",{"->":"$r","var":true},null]}],{"c-1":["ev",{"^->":"TTB2.0.g-0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.2.s"},[{"#n":"$r2"}],"\n",{"->":"TTB2.0.g-1"},{"#f":5}],"#f":5}],"g-1":["^\"Mostly laziness,\" says Boris, \"Besides, why's that important at this point? You may be able to rekindle some memories if you see the inside.\"","\n","^The prospect of regaining some of your memories has peaked your interest in pursuing the chateau. You know nothing about these 'creations' that Boris speaks of, much less that he claims they belong to you. You hold these thoughts close by as you set your sights on the chateau.","\n",["ev",{"^->":"TTB2.0.g-1.4.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-2","flg":2},{"s":["^\"Alright, let's get going.\"",{"->":"$r","var":true},null]}],{"c-2":["ev",{"^->":"TTB2.0.g-1.c-2.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.4.s"},[{"#n":"$r2"}],"\n","ev",true,"/ev",{"VAR=":"TTBAC","re":true},{"->":"TTB3"},{"#f":5}],"#f":5}]}],{"#f":1}],"TTB3":[["^\"Great!\" chimes Boris. \"Before we get going, I should let you know about upgrading your weapon. When you continuously run into visions of weapons, your familiarity with them becomes enhanced, and therby increases their power. Most weapons even gain new skills when they get upgraded!\"","\n","^Walk with me, Boris gestures. You walk with him towards the front of the courtyard.","\n","^\"Anzhela, the merchant in the courtyard, will sell you a vision, or rather data, about specific weapons,\" Boris says, \"I think she has a revolver for sale. If you haven't already, you should really buy that from her to enhance your ability to manifest your revolver.\"","\n",["ev",{"^->":"TTB3.0.6.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"Understood.\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"TTB3.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.6.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^\"Great, I'll leave you here, meet me at the chateau when you're ready.\"","\n",{"->":"FrontOfCourtyard"},{"#f":5}]}],{"#f":1}],"Chateau":[["^Boris is awaiting you patiently at the front door.","\n","^\"Perfect, you found you're way, Mr. Rock.\"","\n",["ev",{"^->":"Chateau.0.4.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"You're hilarious, Mr. Pigeon.\"",{"->":"$r","var":true},null]}],["ev",{"^->":"Chateau.0.5.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^\"There's not many places to go around here.\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"Chateau.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.4.s"},[{"#n":"$r2"}],"\n","^\"Thank you, I try, but with you around it's a lot easier,\" he jests.","\n",{"->":"Chateau1"},{"#f":5}],"c-1":["ev",{"^->":"Chateau.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.5.s"},[{"#n":"$r2"}],"\n","^\"Regardless, I'm proud of you for walking.\"","\n",{"->":"Chateau1"},{"#f":5}]}],{"#f":1}],"Chateau1":["^You side-eye Boris. \"What do you mean by that?\"","\n","^\"Whatever you wish it to imply,\" he says.","\n","^\"Anyway...\" Boris says while fumbling with some keys, \"I'll let us in, prepare yourself, I know not what lies on the other end of this door any longer.\"","\n","^Boris finds the correct key and pushes the doorway. The doors creak and whine until full opened. Light rushes into the main hall of the chateau, and, shortly after, you follow suit.","\n",{"->":"ChateauMainHall"},{"#f":1}],"Simulation":["^Welcome to the immaterial.","\n","done",{"#f":1}],"Simulation1":["^Welcome to the second immaterial.","\n","done",{"#f":1}],"ChateauMainHall":[[["ev",{"^->":"ChateauMainHall.0.0.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^_Ask Boris for guidance._",{"->":"$r","var":true},null]}],["ev",{"^->":"ChateauMainHall.0.1.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^_Explore on your own._",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"ChateauMainHall.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.0.s"},[{"#n":"$r2"}],"\n","^\"Where should we explore first?\" you ask Boris.","\n","^\"Beats me, honestly,\" he pouts.","\n","^\"You had the keys? How do you not know,\" you ask.","\n","^\"Well, I'm not really sure what we're after to have a goal on where to go. We're here for your sake, y'know. For your memories, and all.\"","\n","^\"Don't charm me,\" you interject.","\n","^Boris gets flustered, \"You would say the same thing if you didn't want to clean alone.\"","\n","^\"This isn't really a cleaning operation, as much as an extermination,\" you sigh. \"Also, I don't hear anything, are you sure this place is overrun?\"","\n",{"->":"CHMC"},{"#f":5}],"c-1":["ev",{"^->":"ChateauMainHall.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.1.s"},[{"#n":"$r2"}],"\n","^You begin to wander further into the main hall, but Boris stops you.","\n","^\"Hey! You're not just going to leave me behind, huh? I let you in here in the first place.\"","\n","^\"Relax, man,\" you say. \"So clingly...\"","\n","^\"You would be too if you didn't want to clean alone,\" he responds.","\n","^\"This isn't really a cleaning operation, as much as an extermination,\" you sigh. \"Also, I don't hear anything, are you sure this place is overrun?\"","\n",{"->":"CHMC"},{"#f":5}]}],{"#f":1}],"CHMC":["^\"Shh!\" Boris shouts.","\n","^\"What?\" you say.","\n","^\"Shhhh!\" he interjects. \"Do you hear that?\"","\n","^You listen in. You hear a breeze walk through the You hear absolutely nothing.","\n","^\"Boris?\" you whisper. \"What did you hear?\"","\n","^\"Nothing,\" he whispers back, \"I just wanted to see if I heard anything.\"","\n","^\"I-\" you pause. \"Alright. Let's just get moving.\"","\n","^\"Alrighty, I'm right behind you,\" Boris says. \"Lead the way.\"","\n",{"->":"CMH"},{"#f":1}],"CMH":[["^You're in a grand hall at the front of the chateau. The walls stretch far beyond your eyesight towards the sky. The ceiling has openings that let in light through filtered glass. The whole room glistens of opal refractions.","\n","^There's a double stairway before you, and halls that lead to both your left and right.","\n",["ev",{"^->":"CMH.0.4.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^_Go down the left hall._",{"->":"$r","var":true},null]}],["ev",{"^->":"CMH.0.5.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^_Go down the right hall._",{"->":"$r","var":true},null]}],["ev",{"^->":"CMH.0.6.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-2","flg":2},{"s":["^_Go up the stairway._",{"->":"$r","var":true},null]}],["ev",{"^->":"CMH.0.7.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-3","flg":2},{"s":["^_Leave the chateau._",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"CMH.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.4.s"},[{"#n":"$r2"}],"\n","^You go down the left hall and reach a study room.","\n",{"->":"LHCMH"},{"#f":5}],"c-1":["ev",{"^->":"CMH.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.5.s"},[{"#n":"$r2"}],"\n",{"->":"RHCMH"},{"#f":5}],"c-2":["ev",{"^->":"CMH.0.c-2.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.6.s"},[{"#n":"$r2"}],"\n","^You walk up the stairs, and Boris follows as your tail. You reach the top and oversee the main hall from the banister. The same opal refractions moves with ease across the room with your perspective.","\n",{"->":"STCMH"},{"#f":5}],"c-3":["ev",{"^->":"CMH.0.c-3.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.7.s"},[{"#n":"$r2"}],"\n",{"->":"Courtyard"},{"#f":5}]}],{"#f":1}],"LHCMH":["^The room is cluttered with diagrams and drawings of different mechanisms.","\n","^Monitors and computers are prolific within this space, the wires of which pour into a singular machine.","\n","ev",{"VAR?":"FirstTimeLeftHall"},"/ev",[{"->":".^.b","c":true},{"b":["\n","^\"I remember this place,\" says Boris. \"That machine is a giant 3D printer, almost. It has a bit more flare to it then just that. I'm pretty sure you made me here.\"","\n",["ev",{"^->":"LHCMH.7.b.3.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"Is that why you have a little more flare?\" you ask.",{"->":"$r","var":true},null]}],{"->":"LHCMH.9"},{"c-0":["ev",{"^->":"LHCMH.7.b.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.3.s"},[{"#n":"$r2"}],"\n",{"->":"LHCMHEX1"},{"#f":5}]}]}],[{"->":".^.b"},{"b":["\n",["ev",{"^->":"LHCMH.8.b.1.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^_Return to the main hall._",{"->":"$r","var":true},null]}],{"->":"LHCMH.9"},{"c-0":["ev",{"^->":"LHCMH.8.b.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.1.s"},[{"#n":"$r2"}],"\n",{"->":"CMH"},{"#f":5}]}]}],"nop","\n",{"#f":1}],"LHCMHEX1":[["^\"What is that supposed to mean?\" he hisses.","\n","^\"Whatever you wish it to imply,\" you respond driely.","\n","^\"I see what you did there...\" he says. \"Oh wait. Look at that!\"","\n","^Just in that moment, a little black rabbit hopped before your feet.","\n",["ev",{"^->":"LHCMHEX1.0.8.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"Is this Rabbit?\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"LHCMHEX1.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.8.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^\"Perhaps,\" says Boris. \"Rather, a fragment of him.\"","\n","^\"It's kind of cute, actually,\" you say.","\n","^\"Well, where there's one there's many of them, keep an eye out,\" warns Boris.","\n","^\"Don't tell me the 'overrun by monsters' bit was for these fucking rabbits.\"","\n","^Boris' face is flush with guilt.","\n","^The rabbit begins to hop away, and phases through one of the walls of the room. seemingly running off through a wall.","\n","^\"This place is a labyrinth, isn't it?\" you say.","\n","^\"Seems so,\" Boris answers. \"It appears what we see is not the truth in its entirety. Let's follow the rabbit.\"","\n",["ev",{"^->":"LHCMHEX1.0.g-0.16.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^_Follow the rabbit through the wall._",{"->":"$r","var":true},null]}],{"c-1":["ev",{"^->":"LHCMHEX1.0.g-0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.16.s"},[{"#n":"$r2"}],"\n",{"->":"LHCMEX2"},{"#f":5}],"#f":5}]}],{"#f":1}],"LHCMEX2":["^You take advantage of the world's brief disillusionment, and push through the wall with Boris. You both end up in small pocket of space. What once was one now has become three, as in, three small black rabbits sit before you.","\n","^\"See, I told you,\" Boris says. \"They just keep multiplying, that's why I didn't want to deal with it.\"","\n","^\"Okay, while I'm here now. Also, they're just rabbits, they aren't monsters.\"","\n","^\"Just you wait,\" Boris says. \"Look now.\"","\n","^You look back to the rabbits to see a swirl of mist, building from them. All three morph into replicas reminiscent of Rabbit.","\n","^You look to Boris.","\n","^\"Trust me, they aren't friendly,\" he says.","\n","^Prepare for combat.","\n","ev","str","^Triple Rabbit","/str","str","^LHCMEX3","/str",{"x()":"StartCombat","exArgs":2},"pop","/ev","\n","done",{"#f":1}],"LHCMEX3":[["^\"Phew!\" says Boris. \"Alright, let's get out of here before this pocket collapses.\"","\n","^You both rush out of the pocket dimension, as it closes behind you.","\n","^You're back in the study. You press against the wall, and it budges no longer.","\n","^\"See, cleaning can be fun,\" says Boris.","\n",["ev",{"^->":"LHCMEX3.0.8.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"Something like that...\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"LHCMEX3.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.8.s"},[{"#n":"$r2"}],"\n","^You return your focus back to the room.","\n",{"->":"LHCMH"},{"#f":5}]}],{"#f":1}],"RHCMH":[["^Nothing here yet, sorry, this is pretty much end of story.","\n",["ev",{"^->":"RHCMH.0.2.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^_Return to the main hall._",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"RHCMH.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.2.s"},[{"#n":"$r2"}],"\n",{"->":"CMH"},"done",{"#f":5}]}],{"#f":1}],"STCMH":["^There's an array of dark wooden doors up here, each with a number in silver engraved. The floorboards creak with each of your footsteps.","\n","ev",{"VAR?":"FirstTimeInChateau"},false,"==","/ev",[{"->":".^.b","c":true},{"b":["\n","ev",true,"/ev",{"VAR=":"FirstTimeInChateau","re":true},"^You look to Boris. You try to budge one of the locked doors. It doesn't give way.","\n","^\"Do you have the keys for any of these?\" you ask.","\n","^\"No, I don't actually. I'm pretty sure you were the only one that knew how to open these. They're gateways to other simulations.\"","\n","^\"Well, where do I find the keys?\" you ask.","\n","^Boris stands firm with both hands on his hips, observing the doors. \"I'm not really sure. You've sealed some pretty heavy stuff behind these. It's probably best we just leave them alone.\"","\n","^\"How do you mean?\" you say.","\n","^\"I mean just that,\" Boris affirms. \"The simulations held behind these doors aren't too far off from your own recent imprisonment.\"","\n","^\"I've trapped people here?\" you ask.","\n","^\"Parts of them...\" Boris says.","\n","^You look to the doors with heavier heart. \"What have I done?\" you ask.","\n","^\"Whatever it took to uphold the machine,\" he says. \"You had a change of heart towards the end. You never had the chance to free those you locked within.\"","\n",["ev",{"^->":"STCMH.7.b.27.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"Uphold the machine?\"",{"->":"$r","var":true},null]}],["ev",{"^->":"STCMH.7.b.28.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^\"Change of heart?\"",{"->":"$r","var":true},null]}],{"->":"STCMH.9"},{"c-0":["ev",{"^->":"STCMH.7.b.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.27.s"},[{"#n":"$r2"}],"\n",{"->":"STCHMEX"},{"#f":5}],"c-1":["ev",{"^->":"STCMH.7.b.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.28.s"},[{"#n":"$r2"}],"\n",{"->":"STCHMEX"},{"#f":5}]}]}],[{"->":".^.b"},{"b":["\n","^There's not much left to do up here.","\n",["ev",{"^->":"STCMH.8.b.3.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^_Return down the stairs._",{"->":"$r","var":true},null]}],{"->":"STCMH.9"},{"c-0":["ev",{"^->":"STCMH.8.b.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.3.s"},[{"#n":"$r2"}],"\n",{"->":"CMH"},{"#f":5}]}]}],"nop","\n",{"#f":1}],"STCHMEX":[["^\"Jupiter thrives off of the destruction of other civilizations. Their worlds, their experiences, everything,\" Boris pouts. \"All twisted into artificial realities. Call it for pleasure or study, Jupiter is an amalgamation-\"","\n","^\"Of inexplicable feeling,\" you utter.","\n","ev",{"VAR?":"SpokeToWoman"},"/ev",[{"->":".^.b","c":true},{"b":["\n","^Speaking of destruction, you remember vividly that Andromeda deamed herself a ruthless killer.","\n",{"->":".^.^.^.8"},null]}],"nop","\n","^\"The pinacle of existence,\" finishes Boris. \"Such were words to live by at one point. Hindsight calls us selfish, horrific beings.\"","\n",["ev",{"^->":"STCHMEX.0.12.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"Destruction of other civilizations?\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"STCHMEX.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.12.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^\"You mentioned the destruction of other civilizations?\" you ask.","\n","^\"Yes,\" Boris says. \"A means to harvest data for these experiences.\"","\n","^Boris takes note of your blank expression.","\n","^\"Hm...\" he paces, \"How should I explain this? Do you know what a Telepolos is?\"","\n","^You don't recall ever knowing about a Telepolos, but information about it feels just in grasp at the back of your mind.","\n","^\"A squid, or rather jellyfish sort of creature,\" you say. \"Both renound for advancing our understanding of teleportation, but was suprisingly a food delicacy on Uhloth.\"","\n","^\"How does it taste?\" Boris asks.","\n","^\"Rubbery,\" you answer. \"It feels malleable in the mouth, but upon applying pressure, with chewing for example, it hardens to a satisfying crunch.\"","\n","^\"Oh...\" you say. \"I see. It's pretty delicious too. I've never actually tried it, but I know exactly how it tastes.\"","\n","^\"What does it feel like to be stung by one?\" asks Boris.","\n","^\"Ah!\" you flinch as if in pain.","\n","^\"Ah! HAHAHA,\" mocks Boris.","\n",["ev",{"^->":"STCHMEX.0.g-0.24.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^\"Fuck you.\"",{"->":"$r","var":true},null]}],["ev",{"^->":"STCHMEX.0.g-0.25.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-2","flg":2},{"s":["^\"What does it feel like to be hit by a train?\"",{"->":"$r","var":true},null]}],{"c-1":["ev",{"^->":"STCHMEX.0.g-0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.24.s"},[{"#n":"$r2"}],"\n","^\"Yeah, yeah. Just remember you have full control over the data you access. Don't analyze the data of things you don't actually want to know. That's why everything goes through a decryption process, so you can't just accidentally read things.\"","\n",{"->":"STCHMEX1"},{"#f":5}],"c-2":["ev",{"^->":"STCHMEX.0.g-0.c-2.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.25.s"},[{"#n":"$r2"}],"\n","^\"Good try,\" smirks Boris. \"You have full control on what data you access, you know. Don't analyze the data of things you don't actually want to know. That's why everything goes through a decryption process, so you can't just accidentally read things.\"","\n",{"->":"STCHMEX1"},{"#f":5}],"#f":5}]}],{"#f":1}],"STCHMEX1":[[["ev",{"^->":"STCHMEX1.0.0.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"Noted.\"",{"->":"$r","var":true},null]}],["ev",{"^->":"STCHMEX1.0.1.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^\"Fuck you.\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"STCHMEX1.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.0.s"},[{"#n":"$r2"}],"\n","^\"Great. Well, I suggest trying to talk to Andromeda after we're done roaming around this place. She may know how to open one of these doors. She was one of your highest confidants, y'know.\"","\n","^Boris sparingly meets your eyes as he brings his hands behind his back. His voice begins to shake as he lightly kicks the air, \"I suppose I didn't make the cut.\"","\n",{"->":"STCHMEX2"},{"#f":5}],"c-1":["ev",{"^->":"STCHMEX1.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.1.s"},[{"#n":"$r2"}],"\n","^\"Yep, knew that was coming. Anyways, I suggest trying to talk to Andromeda after we're done roaming around this place. She may know how to open one of these doors. She was one of your highest confidants, y'know.\"","\n","^Boris sparingly meets your eyes as he brings his hands behind his back. His voice begins to shake as he lightly kicks the air, \"I suppose I didn't make the cut.\"","\n",{"->":"STCHMEX2"},{"#f":5}]}],{"#f":1}],"STCHMEX2":[["^\"Oh... I'm sorry,\" you say. \"Is this something you're actually upset over?\"","\n","^\"No,\" Boris cheers. \"I don't want to be fucked up like Andromeda.\"","\n",["ev",{"^->":"STCHMEX2.0.4.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\"...\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"STCHMEX2.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.4.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^Boris stares at you waiting for a reaction, to which you give none.","\n","^He smiles a little, \"Lead the way, Mr.\"","\n","^You turn your attention away from Boris to the environment around you once more.","\n",{"->":"STCMH"},{"#f":5}]}],{"#f":1}],"global decl":["ev",0,{"VAR=":"BotherAlmos"},0,{"VAR=":"UncannyPeculiarity"},false,{"VAR=":"PhonePickup"},0,{"VAR=":"BornAgain"},false,{"VAR=":"KillCommandAlmos"},0,{"VAR=":"MeetBoris"},0,{"VAR=":"GunFun"},false,{"VAR=":"MuffinShared"},0,{"VAR=":"MetAnzhela"},false,{"VAR=":"SpokeToWoman"},false,{"VAR=":"TTBAC"},false,{"VAR=":"CanTalkToAndromeda"},false,{"VAR=":"FirstTimeInChateau"},false,{"VAR=":"FirstTimeLeftHall"},true,{"VAR=":"FirstTimeGalaga"},"/ev","end",null],"#f":1}],"listDefs":{}}